{
  "source_id": "pdi_ac2681026ddf",
  "source_type": "guidance_pdi",
  "source_url": "https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/permanent-residence/economic-classes/live-caregivers/assessing-admissibility-requirements.html",
  "canonical_url": "https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/permanent-residence/economic-classes/live-caregivers/assessing-admissibility-requirements.html",
  "title": "Permanent residence applications from live-in caregivers: Assessing admissibility requirements",
  "language": "en",
  "manual": "Permanent residence applications from live",
  "chapter": "in caregivers: Assessing admissibility requirements",
  "heading_path": [
    "Permanent residence applications from live-in caregivers: Assessing admissibility requirements"
  ],
  "last_updated": "2019-06-11",
  "crawl_ts": "2026-02-12T00:00:00Z",
  "http": {
    "status_code": 200,
    "content_type": "text/markdown"
  },
  "content_hash": "dbee8f8a8f9f5a7795cab1e64f7319d8d3479260579b448d7169a8de02584458",
  "raw_html_path": null,
  "markdown_path": "scripts/scraper/ircc_data_clean/assessing-admissibility-requirements-ac2681026d.md",
  "text": "Published Time: Thu, 12 Feb 2026 00:42:28 GMT\n\nPermanent residence applications from live-in caregivers: Assessing admissibility requirements\n==============================================================================================\n\nThis section contains policy, procedures and guidance used by IRCC staff. It is posted on the department’s website as a courtesy to stakeholders.\n\nOnce the case processing centre or the responsible IRCC inland office has determined that the principal applicant is a member of the live-in caregiver class under [section 113](http://laws-lois.justice.gc.ca/eng/regulations/SOR-2002-227/section-113.html#h-73) of the Immigration and Refugee Protection Regulations(IRPR), all family members in Canada or abroad who are identified in the application (whether accompanying or not) must undergo medical, criminal and security checks to determine admissibility.\n\nLive-in Caregiver Program (LCP) applicants cannot be granted permanent residence if they, or any family members, are inadmissible under sections 33 to 42 of the Immigration and Refugee Protection Act (IRPA). When applications for the principal applicant and their family members are being processed concurrently at different offices, a final decision cannot be made until it has been determined that all applicants are not inadmissible.\n\nOfficers should refer a case to the responsible IRCC inland office if\n\n* there are concerns regarding the identity of the principal applicant\n* the case is complex or exceptional\n* an interview is warranted\n* misrepresentation is suspected\n* there are serious criminality or security concerns, as described in section A34, section A35, subsection A36(1), section A37 or section A40\n\nFor detailed information about determining admissibility, refer to chapter ENF 2/OP 18, Evaluating inadmissibility.\n\nOn this page\n------------\n\n* [Medical examinations](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/permanent-residence/economic-classes/live-caregivers/assessing-admissibility-requirements.html#medical_examinations)\n* [Inadmissibility and non-accompanying family members](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/permanent-residence/economic-classes/live-caregivers/assessing-admissibility-requirements.html#inadmissibility)\n* [Processing family members](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/permanent-residence/economic-classes/live-caregivers/assessing-admissibility-requirements.html#processing)\n* [Ineligible family members](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/permanent-residence/economic-classes/live-caregivers/assessing-admissibility-requirements.html#ineligible)\n* [Inadmissible family members](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/permanent-residence/economic-classes/live-caregivers/assessing-admissibility-requirements.html#inadmissible)\n* [Non-compliant family members – Requests for information or medical examinations](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/permanent-residence/economic-classes/live-caregivers/assessing-admissibility-requirements.html#non-compliant)\n* [Assessment of overseas family members](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/permanent-residence/economic-classes/live-caregivers/assessing-admissibility-requirements.html#assessment)\n\nMedical examinations\n--------------------\n\nForeign nationals who have applied for permanent resident status and are members of the live-in caregiver class are exempt from the requirement to submit to a medical examination [[R30(1)(g)](http://laws-lois.justice.gc.ca/eng/regulations/SOR-2002-227/section-30.html#docCont)], unless there is reason to believe that the live-in caregiver has a health condition that may endanger public health or safety [[R30(1)(a)(iv)](http://laws-lois.justice.gc.ca/eng/regulations/SOR-2002-227/section-30.html#docCont)].\n\nConversely, family members in Canada or abroad must always complete and pass a medical examination as part of a live-in caregiver’s application for permanent residence.\n\n### How to determine if a medical examination is required\n\n#### Situation 1: At the time of the submission of the application for permanent residence, the officer does not have reason to believe that the principal applicant has a health condition that is likely to be a danger to public health or safety.\n\n**For example, previously assessed**\n\n* M1 case\n* M2/S2.04 case (adequately treated syphilis)\n* M3 case (when the initial diagnosis does not mention any risk to public safety)\n\n##### Action required\n\n* Do not request that the principal applicant complete a subsequent medical examination as part of their application for permanent residence.\n* Accept the previous medical result and record the medical assessment for the permanent residence application as “Passed”.\n\n#### Situation 2: An immigration officer has new medical information that suggests that the applicant may be a danger to public health or safety, or, at the time of the submission of the application for permanent residence, the officer has reason to believe the applicant has a health condition that is likely to be a danger to public health or safety.\n\n**For example, previously assessed**\n\n* M2/S2.02 case (inactive pulmonary tuberculosis) (**only in cases where the imposed condition to report for medical surveillance remains and there has been no proof of compliance**)\n* M3 case (where the initial diagnosis could lead to a risk to public safety)\n\n##### Action required\n\n* Send a request to the Health Branch regarding the concerns identified. **The email subject should be “LCP-Concurrence to request a medical examination”.**\n* Upon receiving concurrence from the Health Branch, request that the principal applicant complete a new medical examination.\n\n**or**\n\n* If the Health Branch does not concur, accept the previous medical result and record the medical assessment for the permanent residence application as “Passed”. \n\nInadmissibility and non-accompanying family members\n---------------------------------------------------\n\n* The case processing centre should review Global Case Management System (GCMS) notes from the initial work permit application at the visa office to verify that the visa officer confirmed the applicant’s marital status. The case processing centre may ask the visa office to confirm or discredit the statutory declaration or other information provided by the live-in caregiver concerning their marital status at the time of their application for permanent residence.\n* A non-accompanying family member may become an accompanying family member only if requested by the principal applicant before permanent residence has been granted and if the appropriate fees are paid at the time the request is made.\n\nFor more information about processing family members, see [Processing members of the family class](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/permanent-residence/non-economic-classes.html).\n\nProcessing family members\n-------------------------\n\nThe case processing centre is responsible for completing the eligibility of all family members. After the triage criteria has been reviewed, if the eligibility or admissibility assessment of an overseas family member is deemed complex, a verification activity is created in GCMS and assigned to the responsible IRCC office overseas, and that office is also added as a secondary office. The application at the case processing centre cannot be finalized until the overseas verification activity is completed. However, the case processing centre can carry on processing other parts of the file, if needed.\n\nOnce the verification activity has been completed by the IRCC office overseas, the case processing centre resumes processing, based on the outcome of the verification, and is responsible for carrying on any follow-up actions before finalizing the file, such as\n\n* sending procedural fairness letters\n* issuing medical instructions\n* making other admissibility decisions\n\nIneligible family members\n-------------------------\n\nAfter an application is reviewed, if an officer believes that the declared spouse or declared dependent children are not members of the family class, as defined in the IRPR, the officer should apply procedural fairness, outline their concerns to the applicant and provide a deadline for the applicant to submit additional information about the ineligible spouse or dependent children. If the officer still believes that the spouse or dependent child is ineligible by the deadline, the officer should remove the ineligible spouse or dependent child and continue to assess the admissibility of the remaining family members. The officer must send a removal letter explaining why the ineligible family member can no longer be included in the application and cannot be issued travel documents.\n\nIf the family member is located outside Canada, the case processing centre visa officer (or the IRCC inland officer) who has concerns about the ineligible family member can assign a verification to the appropriate IRCC office overseas. If the overseas office concurs that the dependant is not a family member after the verification has been completed, it is the responsibility of the case processing centre (or the IRCC inland office, as applicable) to apply procedural fairness, as outlined in the previous paragraph; to remove the ineligible dependant; and to send the removal letter.\n\nIf the ineligible family member is being processed on the caregiver application, this family member should be disassociated from the application with the reason listed as “Ineligible family member”.\n\nSee [instructions on processing members of the family class](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/permanent-residence/non-economic-classes.html) for more information.\n\nInadmissible family members\n---------------------------\n\nAfter an application has been reviewed, if an officer believes that a family member of the principal applicant is inadmissible, the officer should apply procedural fairness, outline their concerns to the applicant and provide a deadline for the applicant to submit additional information about the possible inadmissibility. If no additional information is provided by the deadline, or the additional information does not change the inadmissibility assessment, the officer must refuse the application.\n\nIf the family member is being processed outside Canada, the case processing centre visa officer (or the IRCC inland officer) who has concerns about the inadmissible family member can assign a verification to the appropriate IRCC office overseas. If the overseas office concurs that the family member is inadmissible after the verification has been completed, the overseas officer must notify the case processing centre (or the IRCC inland office, as applicable) of the inadmissible family member. The case processing centre (or the IRCC inland office) is always responsible for notifying the principal applicant of the inadmissible family member and, subsequently, the refusal of their application, even when the family members are processed by a visa office. On caregiver applications, while the office processing the inadmissible family member sets the admissibility activity as “Failed”, the case processing centre (or the IRCC inland office, as applicable) enters the final refusal decision.\n\nNon-compliant family members – Requests for information or medical examinations\n-------------------------------------------------------------------------------\n\nOfficers must ensure that [procedural fairness (PDF, 597.29 KB)](https://www.canada.ca/content/dam/ircc/migration/ircc/english/resources/manuals/op/op01-eng.pdf) has been respected before closing an application. Although the person is inadmissible when failing to comply, the principal applicant must have been given an opportunity to provide documents or information in response to the original request. Therefore, the principal applicant as well as the case processing centre (or the IRCC inland office, as applicable) should be included in all procedural fairness correspondence sent to overseas family members. Correspondence should also be recorded and uploaded in GCMS.\n\nWhen there is non-compliance by overseas family members and sufficient opportunity has been given to submit the information or undergo a medical exam, the officer must assess the application based on the information on file and find the applicant inadmissible as per section A11 (pursuant to subsection A16(1) or (2), or paragraph R30(1)(a), as applicable).\n\nIf the overseas family members are being assessed on a separate live-in caregiver application, a new eligibility activity should be created and set to “Failed”, and the final disposition should be set to “Refused”. Subsequently, the case processing centre (or the IRCC inland office, as applicable) must be advised.\n\nIf the overseas family members are being assessed on the live-in caregiver application, the case processing centre (or the IRCC inland office, as applicable) must be advised immediately that the family member or members are inadmissible and that processing of the overseas family members has been completed.\n\nIn either case, the case processing centre (or the IRCC inland office, as applicable) must take the appropriate action.\n\n* If the case processing centre determines that the principal applicant has been adequately notified of the request, they should assess and conclude the application, based on the information on file, and refuse it on non-compliance.\n* If non-compliance is determined by a visa office, the case processing centre should send another procedural fairness letter to the applicant, notifying them of the non-compliance by overseas family members.\n* If the case processing centre determines that the additional time requested by the principal applicant or their family members is unwarranted, they should assess the application, based on the information on file, and refuse it on non-compliance.\n\nFor further guidance on non-compliance, refer to section 10 of chapter ENF 2/OP 18, Evaluating inadmissibility, and [section 5.12 of chapter OP 2, Processing members of the family class](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/permanent-residence/non-economic-classes.html#familyClass).\n\nAssessment of overseas family members\n-------------------------------------\n\nAfter the application has been reviewed, if a visa officer determines that all overseas family members are admissible and have met statutory requirements, the visa officer should send an email to the case processing centre (or the IRCC inland office, as applicable) to advise them of this.\n\nIf the overseas family members are **non-accompanying**, the final disposition of the live-in caregiver application should be set to “Withdrawn”, and a note should be entered, indicating the file is now closed because the overseas family members are non-accompanying. A non-concurrent closure letter must be sent to the family members.\n\nIf the overseas family members are **accompanying**, the officer should wait for notification from the IRCC inland office that the principal applicant in Canada has landed before issuing travel documents to the overseas family members. If applicable, the officer should also ensure that the [Declaration from Non-Accompanying Parent/Guardian for Minors Immigrating to Canada form [IMM 5604] (PDF, 609.23 KB)](https://www.canada.ca/content/dam/ircc/migration/ircc/english/pdf/kits/forms/imm5604e.pdf) and a signed piece of photo identification is on file for minor dependants. If this form or an appropriate document in lieu of consent (court order or custody agreement) cannot be provided, the minor cannot be issued travel documents and is changed to a non-accompanying dependant. A final decision of “Approved” should be entered on live-in caregiver applications for accompanying overseas family members only after the principal applicant on file has landed.\n\nFor further guidance on consent, see [sections 5.7 and 5.8 of chapter OP 1, Procedures (PDF, 597.29 KB)](https://www.canada.ca/content/dam/ircc/migration/ircc/english/resources/manuals/op/op01-eng.pdf).\n\nPage details\n------------\n\n 2019-06-11",
  "sections": [
    {
      "heading": "Permanent residence applications from live-in caregivers: Assessing admissibility requirements",
      "heading_path": [
        "Permanent residence applications from live-in caregivers: Assessing admissibility requirements"
      ],
      "anchor": "#permanent-residence-applications-from-live-in-caregivers-assessing-admissibility-requirements",
      "text": "Published Time: Thu, 12 Feb 2026 00:42:28 GMT\n\nPermanent residence applications from live-in caregivers: Assessing admissibility requirements\n==============================================================================================\n\nThis section contains policy, procedures and guidance used by IRCC staff. It is posted on the department’s website as a courtesy to stakeholders.\n\nOnce the case processing centre or the responsible IRCC inland office has determined that the principal applicant is a member of the live-in caregiver class under [section 113](http://laws-lois.justice.gc.ca/eng/regulations/SOR-2002-227/section-113.html#h-73) of the Immigration and Refugee Protection Regulations(IRPR), all family members in Canada or abroad who are identified in the application (whether accompanying or not) must undergo medical, criminal and security checks to determine admissibility.\n\nLive-in Caregiver Program (LCP) applicants cannot be granted permanent residence if they, or any family members, are inadmissible under sections 33 to 42 of the Immigration and Refugee Protection Act (IRPA). When applications for the principal applicant and their family members are being processed concurrently at different offices, a final decision cannot be made until it has been determined that all applicants are not inadmissible.\n\nOfficers should refer a case to the responsible IRCC inland office if\n\n* there are concerns regarding the identity of the principal applicant\n* the case is complex or exceptional\n* an interview is warranted\n* misrepresentation is suspected\n* there are serious criminality or security concerns, as described in section A34, section A35, subsection A36(1), section A37 or section A40\n\nFor detailed information about determining admissibility, refer to chapter ENF 2/OP 18, Evaluating inadmissibility.\n\nOn this page\n------------\n\n* [Medical examinations](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/permanent-residence/economic-classes/live-caregivers/assessing-admissibility-requirements.html#medical_examinations)\n* [Inadmissibility and non-accompanying family members](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/permanent-residence/economic-classes/live-caregivers/assessing-admissibility-requirements.html#inadmissibility)\n* [Processing family members](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/permanent-residence/economic-classes/live-caregivers/assessing-admissibility-requirements.html#processing)\n* [Ineligible family members](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/permanent-residence/economic-classes/live-caregivers/assessing-admissibility-requirements.html#ineligible)\n* [Inadmissible family members](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/permanent-residence/economic-classes/live-caregivers/assessing-admissibility-requirements.html#inadmissible)\n* [Non-compliant family members – Requests for information or medical examinations](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/permanent-residence/economic-classes/live-caregivers/assessing-admissibility-requirements.html#non-compliant)\n* [Assessment of overseas family members](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/permanent-residence/economic-classes/live-caregivers/assessing-admissibility-requirements.html#assessment)\n\nMedical examinations\n--------------------\n\nForeign nationals who have applied for permanent resident status and are members of the live-in caregiver class are exempt from the requirement to submit to a medical examination [[R30(1)(g)](http://laws-lois.justice.gc.ca/eng/regulations/SOR-2002-227/section-30.html#docCont)], unless there is reason to believe that the live-in caregiver has a health condition that may endanger public health or safety [[R30(1)(a)(iv)](http://laws-lois.justice.gc.ca/eng/regulations/SOR-2002-227/section-30.html#docCont)].\n\nConversely, family members in Canada or abroad must always complete and pass a medical examination as part of a live-in caregiver’s application for permanent residence."
    },
    {
      "heading": "Situation 1: At the time of the submission of the application for permanent residence, the officer does not have reason to believe that the principal applicant has a health condition that is likely to be a danger to public health or safety.",
      "heading_path": [
        "Permanent residence applications from live-in caregivers: Assessing admissibility requirements",
        "How to determine if a medical examination is required",
        "Situation 1: At the time of the submission of the application for permanent residence, the officer does not have reason to believe that the principal applicant has a health condition that is likely to be a danger to public health or safety."
      ],
      "anchor": "#situation-1-at-the-time-of-the-submission-of-the-application-for-permanent-residence-the-officer-does-not-have-reason-to-believe-that-the-principal-applicant-has-a-health-condition-that-is-likely-to-be-a-danger-to-public-health-or-safety",
      "text": "**For example, previously assessed**\n\n* M1 case\n* M2/S2.04 case (adequately treated syphilis)\n* M3 case (when the initial diagnosis does not mention any risk to public safety)"
    },
    {
      "heading": "Action required",
      "heading_path": [
        "Permanent residence applications from live-in caregivers: Assessing admissibility requirements",
        "How to determine if a medical examination is required",
        "Situation 1: At the time of the submission of the application for permanent residence, the officer does not have reason to believe that the principal applicant has a health condition that is likely to be a danger to public health or safety.",
        "Action required"
      ],
      "anchor": "#action-required",
      "text": "* Do not request that the principal applicant complete a subsequent medical examination as part of their application for permanent residence.\n* Accept the previous medical result and record the medical assessment for the permanent residence application as “Passed”."
    },
    {
      "heading": "Situation 2: An immigration officer has new medical information that suggests that the applicant may be a danger to public health or safety, or, at the time of the submission of the application for permanent residence, the officer has reason to believe the applicant has a health condition that is likely to be a danger to public health or safety.",
      "heading_path": [
        "Permanent residence applications from live-in caregivers: Assessing admissibility requirements",
        "How to determine if a medical examination is required",
        "Situation 1: At the time of the submission of the application for permanent residence, the officer does not have reason to believe that the principal applicant has a health condition that is likely to be a danger to public health or safety.",
        "Situation 2: An immigration officer has new medical information that suggests that the applicant may be a danger to public health or safety, or, at the time of the submission of the application for permanent residence, the officer has reason to believe the applicant has a health condition that is likely to be a danger to public health or safety."
      ],
      "anchor": "#situation-2-an-immigration-officer-has-new-medical-information-that-suggests-that-the-applicant-may-be-a-danger-to-public-health-or-safety-or-at-the-time-of-the-submission-of-the-application-for-permanent-residence-the-officer-has-reason-to-believe-the-applicant-has-a-health-condition-that-is-likely-to-be-a-danger-to-public-health-or-safety",
      "text": "**For example, previously assessed**\n\n* M2/S2.02 case (inactive pulmonary tuberculosis) (**only in cases where the imposed condition to report for medical surveillance remains and there has been no proof of compliance**)\n* M3 case (where the initial diagnosis could lead to a risk to public safety)"
    },
    {
      "heading": "Action required",
      "heading_path": [
        "Permanent residence applications from live-in caregivers: Assessing admissibility requirements",
        "How to determine if a medical examination is required",
        "Situation 1: At the time of the submission of the application for permanent residence, the officer does not have reason to believe that the principal applicant has a health condition that is likely to be a danger to public health or safety.",
        "Situation 2: An immigration officer has new medical information that suggests that the applicant may be a danger to public health or safety, or, at the time of the submission of the application for permanent residence, the officer has reason to believe the applicant has a health condition that is likely to be a danger to public health or safety.",
        "Action required"
      ],
      "anchor": "#action-required",
      "text": "* Send a request to the Health Branch regarding the concerns identified. **The email subject should be “LCP-Concurrence to request a medical examination”.**\n* Upon receiving concurrence from the Health Branch, request that the principal applicant complete a new medical examination.\n\n**or**\n\n* If the Health Branch does not concur, accept the previous medical result and record the medical assessment for the permanent residence application as “Passed”. \n\nInadmissibility and non-accompanying family members\n---------------------------------------------------\n\n* The case processing centre should review Global Case Management System (GCMS) notes from the initial work permit application at the visa office to verify that the visa officer confirmed the applicant’s marital status. The case processing centre may ask the visa office to confirm or discredit the statutory declaration or other information provided by the live-in caregiver concerning their marital status at the time of their application for permanent residence.\n* A non-accompanying family member may become an accompanying family member only if requested by the principal applicant before permanent residence has been granted and if the appropriate fees are paid at the time the request is made.\n\nFor more information about processing family members, see [Processing members of the family class](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/permanent-residence/non-economic-classes.html).\n\nProcessing family members\n-------------------------\n\nThe case processing centre is responsible for completing the eligibility of all family members. After the triage criteria has been reviewed, if the eligibility or admissibility assessment of an overseas family member is deemed complex, a verification activity is created in GCMS and assigned to the responsible IRCC office overseas, and that office is also added as a secondary office. The application at the case processing centre cannot be finalized until the overseas verification activity is completed. However, the case processing centre can carry on processing other parts of the file, if needed.\n\nOnce the verification activity has been completed by the IRCC office overseas, the case processing centre resumes processing, based on the outcome of the verification, and is responsible for carrying on any follow-up actions before finalizing the file, such as\n\n* sending procedural fairness letters\n* issuing medical instructions\n* making other admissibility decisions\n\nIneligible family members\n-------------------------\n\nAfter an application is reviewed, if an officer believes that the declared spouse or declared dependent children are not members of the family class, as defined in the IRPR, the officer should apply procedural fairness, outline their concerns to the applicant and provide a deadline for the applicant to submit additional information about the ineligible spouse or dependent children. If the officer still believes that the spouse or dependent child is ineligible by the deadline, the officer should remove the ineligible spouse or dependent child and continue to assess the admissibility of the remaining family members. The officer must send a removal letter explaining why the ineligible family member can no longer be included in the application and cannot be issued travel documents.\n\nIf the family member is located outside Canada, the case processing centre visa officer (or the IRCC inland officer) who has concerns about the ineligible family member can assign a verification to the appropriate IRCC office overseas. If the overseas office concurs that the dependant is not a family member after the verification has been completed, it is the responsibility of the case processing centre (or the IRCC inland office, as applicable) to apply procedural fairness, as outlined in the previous paragraph; to remove the ineligible dependant; and to send the removal letter.\n\nIf the ineligible family member is being processed on the caregiver application, this family member should be disassociated from the application with the reason listed as “Ineligible family member”.\n\nSee [instructions on processing members of the family class](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/permanent-residence/non-economic-classes.html) for more information.\n\nInadmissible family members\n---------------------------\n\nAfter an application has been reviewed, if an officer believes that a family member of the principal applicant is inadmissible, the officer should apply procedural fairness, outline their concerns to the applicant and provide a deadline for the applicant to submit additional information about the possible inadmissibility. If no additional information is provided by the deadline, or the additional information does not change the inadmissibility assessment, the officer must refuse the application.\n\nIf the family member is being processed outside Canada, the case processing centre visa officer (or the IRCC inland officer) who has concerns about the inadmissible family member can assign a verification to the appropriate IRCC office overseas. If the overseas office concurs that the family member is inadmissible after the verification has been completed, the overseas officer must notify the case processing centre (or the IRCC inland office, as applicable) of the inadmissible family member. The case processing centre (or the IRCC inland office) is always responsible for notifying the principal applicant of the inadmissible family member and, subsequently, the refusal of their application, even when the family members are processed by a visa office. On caregiver applications, while the office processing the inadmissible family member sets the admissibility activity as “Failed”, the case processing centre (or the IRCC inland office, as applicable) enters the final refusal decision.\n\nNon-compliant family members – Requests for information or medical examinations\n-------------------------------------------------------------------------------\n\nOfficers must ensure that [procedural fairness (PDF, 597.29 KB)](https://www.canada.ca/content/dam/ircc/migration/ircc/english/resources/manuals/op/op01-eng.pdf) has been respected before closing an application. Although the person is inadmissible when failing to comply, the principal applicant must have been given an opportunity to provide documents or information in response to the original request. Therefore, the principal applicant as well as the case processing centre (or the IRCC inland office, as applicable) should be included in all procedural fairness correspondence sent to overseas family members. Correspondence should also be recorded and uploaded in GCMS.\n\nWhen there is non-compliance by overseas family members and sufficient opportunity has been given to submit the information or undergo a medical exam, the officer must assess the application based on the information on file and find the applicant inadmissible as per section A11 (pursuant to subsection A16(1) or (2), or paragraph R30(1)(a), as applicable).\n\nIf the overseas family members are being assessed on a separate live-in caregiver application, a new eligibility activity should be created and set to “Failed”, and the final disposition should be set to “Refused”. Subsequently, the case processing centre (or the IRCC inland office, as applicable) must be advised.\n\nIf the overseas family members are being assessed on the live-in caregiver application, the case processing centre (or the IRCC inland office, as applicable) must be advised immediately that the family member or members are inadmissible and that processing of the overseas family members has been completed.\n\nIn either case, the case processing centre (or the IRCC inland office, as applicable) must take the appropriate action.\n\n* If the case processing centre determines that the principal applicant has been adequately notified of the request, they should assess and conclude the application, based on the information on file, and refuse it on non-compliance.\n* If non-compliance is determined by a visa office, the case processing centre should send another procedural fairness letter to the applicant, notifying them of the non-compliance by overseas family members.\n* If the case processing centre determines that the additional time requested by the principal applicant or their family members is unwarranted, they should assess the application, based on the information on file, and refuse it on non-compliance.\n\nFor further guidance on non-compliance, refer to section 10 of chapter ENF 2/OP 18, Evaluating inadmissibility, and [section 5.12 of chapter OP 2, Processing members of the family class](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/permanent-residence/non-economic-classes.html#familyClass).\n\nAssessment of overseas family members\n-------------------------------------\n\nAfter the application has been reviewed, if a visa officer determines that all overseas family members are admissible and have met statutory requirements, the visa officer should send an email to the case processing centre (or the IRCC inland office, as applicable) to advise them of this.\n\nIf the overseas family members are **non-accompanying**, the final disposition of the live-in caregiver application should be set to “Withdrawn”, and a note should be entered, indicating the file is now closed because the overseas family members are non-accompanying. A non-concurrent closure letter must be sent to the family members.\n\nIf the overseas family members are **accompanying**, the officer should wait for notification from the IRCC inland office that the principal applicant in Canada has landed before issuing travel documents to the overseas family members. If applicable, the officer should also ensure that the [Declaration from Non-Accompanying Parent/Guardian for Minors Immigrating to Canada form [IMM 5604] (PDF, 609.23 KB)](https://www.canada.ca/content/dam/ircc/migration/ircc/english/pdf/kits/forms/imm5604e.pdf) and a signed piece of photo identification is on file for minor dependants. If this form or an appropriate document in lieu of consent (court order or custody agreement) cannot be provided, the minor cannot be issued travel documents and is changed to a non-accompanying dependant. A final decision of “Approved” should be entered on live-in caregiver applications for accompanying overseas family members only after the principal applicant on file has landed.\n\nFor further guidance on consent, see [sections 5.7 and 5.8 of chapter OP 1, Procedures (PDF, 597.29 KB)](https://www.canada.ca/content/dam/ircc/migration/ircc/english/resources/manuals/op/op01-eng.pdf).\n\nPage details\n------------\n\n 2019-06-11"
    }
  ],
  "links": {
    "outbound": [
      "http://laws-lois.justice.gc.ca/eng/regulations/SOR-2002-227/section-113.html",
      "https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/permanent-residence/economic-classes/live-caregivers/assessing-admissibility-requirements.html",
      "http://laws-lois.justice.gc.ca/eng/regulations/SOR-2002-227/section-30.html",
      "https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/permanent-residence/non-economic-classes.html",
      "https://www.canada.ca/content/dam/ircc/migration/ircc/english/resources/manuals/op/op01-eng.pdf"
    ],
    "internal_children": []
  },
  "quality": {
    "is_toc_like": false,
    "is_low_text": false,
    "notes": []
  }
}