{
  "source_id": "pdi_9229c8998b5e",
  "source_type": "guidance_pdi",
  "source_url": "https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/foreign-workers/international-free-trade-agreements/canada-chile/business-visitors.html",
  "canonical_url": "https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/foreign-workers/international-free-trade-agreements/canada-chile/business-visitors.html",
  "title": "Business visitors – CCFTA [R186(a)] – Authorization to work without a work permit – International Mobility Program",
  "language": "en",
  "manual": "Business visitors – CCFTA [R186(a)] – Authorization to work without a work permit – International Mobility Program",
  "chapter": null,
  "heading_path": [
    "Business visitors – CCFTA [R186(a)] – Authorization to work without a work permit – International Mobility Program"
  ],
  "last_updated": "2024-10-03",
  "crawl_ts": "2026-02-12T00:00:00Z",
  "http": {
    "status_code": 200,
    "content_type": "text/markdown"
  },
  "content_hash": "f8e33080194c3c08fcdc24acab2be87105e07c2931dff72e158e4235574b8f90",
  "raw_html_path": null,
  "markdown_path": "scripts/scraper/ircc_data_clean/business-visitors-9229c8998b.md",
  "text": "Published Time: Thu, 12 Feb 2026 00:38:00 GMT\n\nBusiness visitors – CCFTA [R186(a)] – Authorization to work without a work permit – International Mobility Program\n==================================================================================================================\n\nThis section contains policy, procedures and guidance used by IRCC staff. It is posted on the department’s website as a courtesy to stakeholders.\n\nIn these instructions “officers” refers to employees of both Immigration, Refugees and Citizenship Canada and the Canada Border Services Agency.\n\nThe instructions on this page should be reviewed in conjunction with\n\n* [Business visitors [R186(a)]: Authorization to work without a work permit – International Mobility Program](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/foreign-workers/work-without-permit/business.html)\n* [Public list of Employers who have been non-compliant](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/foreign-workers/eligibility/public-list-employers-who-have-been-non-compliant.html)\n\nOfficers should initially assess Chilean citizens against the general [business visitor instructions](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/foreign-workers/work-without-permit/business.html) for [R186(a)](https://laws-lois.justice.gc.ca/eng/regulations/SOR-2002-227/section-186.html) found in the Immigration and Refugee Protection Regulations (IRPR) and related Program Delivery Instructions (PDIs). In cases where their activities are not covered by the general provisions, officers should refer to the business visitor provisions provided in [Chapter K of the Canada-Chile Free Trade Agreement (CCFTA)](https://www.international.gc.ca/trade-commerce/trade-agreements-accords-commerciaux/agr-acc/chile-chili/fta-ale/03k.aspx?lang=eng) to determine eligibility under R186(a).\n\nOn this page\n------------\n\n* [Eligibility](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/foreign-workers/international-free-trade-agreements/canada-chile/business-visitors.html#s1)\n* [Permissible business activities](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/foreign-workers/international-free-trade-agreements/canada-chile/business-visitors.html#s2)\n* [Documentary evidence](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/foreign-workers/international-free-trade-agreements/canada-chile/business-visitors.html#s3)\n* [Final decision](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/foreign-workers/international-free-trade-agreements/canada-chile/business-visitors.html#s4)\n\nEligibility\n-----------\n\nTo be eligible as a business visitor under CCFTA, a foreign national must:\n\n* be a citizen of Chile;\n* be engaged in permissible business activities as described in [Appendix K-03.I.1](https://www.international.gc.ca/trade-commerce/trade-agreements-accords-commerciaux/agr-acc/chile-chili/fta-ale/03k.aspx?lang=eng#:~:text=card%20for%20foreigners.-,Appendix%20K%2D03.I.1,-Business%20Visitors) of the CCFTA;\n* be engaged in permissible activities that are international in scope;\n* not have intent to enter the Canadian labour market; \n * the primary source of remuneration for the business activity remains outside Canada\n * the principal place of business of the foreign national remains outside Canada\n\n* be compliant with existing immigration and admissibility requirements for temporary entry;\n* request entry as a business visitor at a port of entry.\n\nBorder services officers at the Primary Inspection Line may make the determination that a foreign national meets the requirements for temporary entry as a business visitors, **except persons applying for entry under the after-sales service provision**. These foreign nationals should be referred to Immigration Secondary due to the complexity of the application and for reasons of client service and program consistency.\n\nPermissible business activities\n-------------------------------\n\nThe permissible business activities are generally of a commercial nature that reflect the components of a business cycle. Typical examples of business activities include, but are not limited to, consultation, negotiation, discussion, research, participation in educational, professional or business conventions or meetings and soliciting business.\n\nThe following are the permissible business activities under [Appendix K-03.I.1](https://www.international.gc.ca/trade-commerce/trade-agreements-accords-commerciaux/agr-acc/chile-chili/fta-ale/03k.aspx?lang=eng#:~:text=card%20for%20foreigners.-,Appendix%20K%2D03.I.1,-Business%20Visitors) of the CCFTA:\n\n* [Research and design](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/foreign-workers/international-free-trade-agreements/canada-chile/business-visitors.html#s2-1)\n* [Growth, manufacture and production](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/foreign-workers/international-free-trade-agreements/canada-chile/business-visitors.html#s2-2)\n* [Marketing](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/foreign-workers/international-free-trade-agreements/canada-chile/business-visitors.html#s2-3)\n* [Sales](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/foreign-workers/international-free-trade-agreements/canada-chile/business-visitors.html#s2-4)\n* [Distribution](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/foreign-workers/international-free-trade-agreements/canada-chile/business-visitors.html#s2-5)\n* [General service](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/foreign-workers/international-free-trade-agreements/canada-chile/business-visitors.html#s2-6)\n* [After-sales service](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/foreign-workers/international-free-trade-agreements/canada-chile/business-visitors.html#s2-7)\n\nThe term “commercial transaction” found in some provisions in [Appendix K-03.I.1](https://www.international.gc.ca/trade-commerce/trade-agreements-accords-commerciaux/agr-acc/chile-chili/fta-ale/03k.aspx?lang=eng#:~:text=card%20for%20foreigners.-,Appendix%20K%2D03.I.1,-Business%20Visitors) of the CCFTA may be described as any act within the confines of the law that is performed expressly to derive a profit. Commercial transactions refer to discussions and negotiations in respect to the sale, purchase, marketing, distribution, advertisement, procurement, transmission, transportation or packaging of goods or services.\n\n### Research and design\n\n* Technical, scientific and statistical researchers conducting independent research or research for an [enterprise](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/terms-definitions.html#e1) located in the territory of the other Party.\n\n### Growth, manufacture and production\n\n* Purchasing and production management personnel conducting commercial transactions for an enterprise located in the territory of the other Party.\n\n### Marketing\n\n* Market researchers and analysts conducting independent research or analysis for an enterprise located in the territory of the other Party.\n* Trade fair and promotional personnel attending a trade convention to only promote their product may be granted entry under this provision. For [sales](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/foreign-workers/international-free-trade-agreements/canada-chile/business-visitors.html#s2-4) different provisions apply.\n* Organizers of trade fairs whose exhibitors are wholly of Chilean origin may be granted entry under this provision.\n\n### Sales\n\n* Sales representatives and agents taking orders or negotiating contracts for goods or services for an enterprise located in the territory of the other Party but not delivering goods or providing services\n\n* Buyers purchasing for an enterprise located in the territory of the other Party.\n\n### Distribution\n\n* Customs brokers providing consulting services regarding the facilitation of the import or export of goods.\n\n### General service\n\n* Professionals engaging in a business activity at a professional level in a profession set out in [Appendix K-03.IV.1](https://www.international.gc.ca/trade-commerce/trade-agreements-accords-commerciaux/agr-acc/chile-chili/fta-ale/03k.aspx?lang=eng#:~:text=de%20Extranjer%C3%ADa%22).-,Appendix%20K%2D03.IV.1,-Professionals) of the CCFTA. \n * In order to determine whether the professional meet the conditions of R186(a) an officer should consider how the professional is being renumerated. An individual who is to be paid in Canada would be considered to be joining the labour market and could not be authorized to enter Canada as a business visitor, whereas, professionals whose primary source of remuneration for the business activity remains outside Canada may qualify.\n\n* Management and supervisory personnel engaging in a commercial transaction for an enterprise located in the territory of the other Party.\n* Financial services personnel (insurers, bankers or investment brokers) engaging in commercial transactions for an enterprise located in the territory of the other Party.\n* Public relations and advertising personnel consulting with [business associates](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/terms-definitions.html#b1), or attending or participating in conventions.\n* Tourism personnel (tour and travel agents, tour guides or tour operators) attending or participating in conventions or conducting a tour that has begun in the territory of the other Party, and\n* Translators or interpreters performing services as employees of an enterprise located in the territory of the other Party.\n\n### After-sales service\n\n* Installers, repair and maintenance personnel, and supervisors, possessing specialized knowledge essential to a seller's contractual obligation, performing services or training workers to perform services, pursuant to a warranty or other service contract incidental to the sale of commercial or industrial equipment or machinery, including computer software, purchased from an enterprise located outside the territory of the Party into which temporary entry is sought, during the life of the warranty or service agreement.\n* After-sales service includes the installation, repair, or servicing of commercial, industrial equipment, machinery, or computer software.\n* Installation includes setting-up and testing of the commercial, industrial equipment, machinery, or computer software. It does **not** include operating the equipment or machinery, or computer software for production.\n\n#### Specific eligibility requirements for after-sales service\n\nThe following requirements apply to business visitors seeking entry under the after-sales service provisions of CCFTA:\n\n* A citizen of Chile, who is employed by an enterprise established in Chile;\n* purpose of entry is to install, repair, service, or supervise these functions, or train workers to perform services;\n* work is pursuant to original sales contract and any warranty or service agreement incidental (connected) to the sale of equipment or machinery (including computer software);\n* equipment or machinery (including computer software) is commercial or industrial (not for household or personal use);\n* equipment or machinery or computer software was manufactured and purchased outside Canada;\n* work is carried out during the validity of any warranty or service agreement or any extensions of same;\n* work requires specialized knowledge (which excludes hands-on building and construction work); and\n* compliance with existing immigration requirements for temporary entry.\n\n**Note:** Persons granted entry to train or to supervise training may also train or supervise workers who are doing the hands-on building and construction work. This may require demonstrating certain procedures. The demonstration must not result in the completion of an [installation](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/terms-definitions.html#i1) or servicing task, or of part of such task, or in the productive operation of the equipment or machinery.\n\nThe CCFTA**does not**relieve after-sales service personnel, or any other business person, from the obligation to comply with municipal, regional, provincial/territorial, or other federal requirements where these apply.\n\n#### Work that does not meet the eligibility requirements of after-sales service\n\nPersons whose activities or services in Canada would constitute hands-on building and construction work may **not** enter under [R186(a)](https://laws-lois.justice.gc.ca/eng/regulations/SOR-2002-227/section-186.html) and CCFTA as after-sales service.\n\nGenerally, the entry of foreign tradespersons in the building and construction industry is subject to an assessment of the availability of domestic labour (an LMIA). As part of the LMIA process, Service Canada will consult with organized labour prior to making a determination.\n\nFor personnel performing the installation or servicing, entry should not be granted when performing hands-on building and construction work. The performance of these activities are not permitted, regardless of wording in sales, warranty or service agreements supporting they be completed.\n\n**Building and construction work:**includes installing, maintaining, and repairing utility services, any part of the fabric of any building or structure, or machinery, equipment, or structures within a building.\n\nBuilding and construction work includes activities normally performed by (but not limited to):\n\n* labourers;\n* millwrights;\n* heat and frost insulators;\n* bricklayers;\n* carpenters and joiners;\n* electrical workers;\n* operating engineers (includes heavy equipment operators);\n* elevator constructors;\n* sheet metal workers;\n* teamsters;\n* boilermakers;\n* residential, commercial, or industrial painters (including the application of all service coatings no matter how applied);\n* bridge, structural, and ornamental ironworkers;\n* plumbers and pipefitters;\n* roofers; and\n* plasterers and cement masons.\n\nBuilding and construction work includes work involving:\n\n* assembly lines;\n* conveyor belts and systems;\n* overhead cranes;\n* heating, cooling, and ventilation or exhaust systems;\n* elevators and escalators;\n* boilers and turbines; and\n* dismantling or demolition of commercial or industrial equipment or machinery, whether on-site or in-plant.\n\nDocumentary evidence\n--------------------\n\nA business visitor under CCFTA must provide the following documentation:\n\n* proof of Chilean citizenship;\n* documentation to support the purpose for entry (must be a business activity listed in [Appendix K-03.I.1](https://www.international.gc.ca/trade-commerce/trade-agreements-accords-commerciaux/agr-acc/chile-chili/fta-ale/03k.aspx?lang=eng#:~:text=card%20for%20foreigners.-,Appendix%20K%2D03.I.1,-Business%20Visitors) of the CCFTA; and\n* evidence that the business activity is international in scope and that they are not attempting to enter the Canadian labour market. \n * the primary source of remuneration is outside Canada, and\n * the person’s place of business remains outside Canada and the profits of the business are accumulated primarily outside Canada.\n\nOral declaration as to the principal place of business and the actual place of accrual of profits can be used as documentary evidence. If further proof is requested, a letter from the employer or the representing organization is sufficient. Prior approval procedures, labour certification tests, or other similar procedures cannot be required. Every effort should be made to avoid the requirement of a visa.\n\nIn general, an individual who is to be paid in Canada would be considered to be joining the labour market and could not be authorized to enter Canada as a business visitor. The payment of expenses incidental to the trip is allowed, as is an honorarium.\n\n### Documentary evidence for after-sales service\n\nBusiness visitors applying under the after-sales service provision of [Appendix K-03.I.1](https://www.international.gc.ca/trade-commerce/trade-agreements-accords-commerciaux/agr-acc/chile-chili/fta-ale/03k.aspx?lang=eng#:~:text=card%20for%20foreigners.-,Appendix%20K%2D03.I.1,-Business%20Visitors) of the CCFTA should be referred for a secondary examination when seeking entry, due to the complexity of the application and for reasons of client service and program\n\nThe following documentation is required:\n\n* proof of Chilean citizenship; and\n* copies of the original sales agreement, and warranty or service agreement, including extensions, which clearly support the purpose of entry.\n\nThe warranty or service contract must be incidental to, or connected to the sale of commercial or industrial equipment or machinery, including computer software.\n\nThe warranty or service agreement does not need to have the same date as the sales agreement. Particularly with third party service as it may take a number of months after the sale before the company installing or servicing the machinery is identified and sub-contracted.\n\nThe initial warranty or service agreement may be extended provided that the sales agreement, or initial warranty or service agreement contained a provision allowing for the extension. The after-sales service, therefore, continues to be contracted as part of the sale of the equipment or machinery, or computer software.\n\n#### Third party service\n\nIf [third party service](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/terms-definitions.html#t3) occurs, there must be clear wording in the sales agreement that specifies a third party will perform the installation, warranty, or service work. Unless such wording exists, there is no evidence that the third party service is incidental to the sale. However, the firm need not be named in the agreement, as it may take some time for the firm to be identified. When a third party is not named in the sales agreement, business visitors may be expected to provide a letter from the seller of the equipment that identifies them as the third party referenced in the original sales agreement.\n\nWhen a seller located in Chile contracts the after-sales servicing to a third party, it must be established in Chile.\n\n#### Lack of Documentation\n\nEvery effort should be made to allow documentation to be provided (e.g., by fax, email or verbal explanation) from the company in Canada or the business visitor’s employer in Chile.\n\nThe requirement for documentation has been imposed in order to clearly establish that the proposed activity is incidental or connected to the sale of the equipment or machinery or computer software.\n\nA verbal statement that the business of the applicant is being carried on outside Canada can be acceptable. Alternative indications (business cards, business papers, advertising pamphlets, etc.) may be helpful.\n\nFinal decision\n--------------\n\n### Visitor record\n\nA business visitor’s stay in Canada will usually be short-term (6 months or less).\n\nIt is recommended that border services officers consider issuing a [visitor record](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/visitors/visitor-record.html) to a business visitor engaged in ‘after-sales service’ work for a period of longer than 6 months and indicate in the “Remarks” section why a longer period of time is being granted.\n\nThese visits may take place over a period of weeks or months. In these circumstances, border services officers should consider issuing a visitor record to reduce potential referrals on future entries.\n\nApplications for extension of status should be determined based on whether the foreign national remains eligible.\n\nPage details\n------------\n\n 2024-10-03",
  "sections": [
    {
      "heading": "Business visitors – CCFTA [R186(a)] – Authorization to work without a work permit – International Mobility Program",
      "heading_path": [
        "Business visitors – CCFTA [R186(a)] – Authorization to work without a work permit – International Mobility Program"
      ],
      "anchor": "#business-visitors-ccfta-r186-a-authorization-to-work-without-a-work-permit-international-mobility-program",
      "text": "Published Time: Thu, 12 Feb 2026 00:38:00 GMT\n\nBusiness visitors – CCFTA [R186(a)] – Authorization to work without a work permit – International Mobility Program\n==================================================================================================================\n\nThis section contains policy, procedures and guidance used by IRCC staff. It is posted on the department’s website as a courtesy to stakeholders.\n\nIn these instructions “officers” refers to employees of both Immigration, Refugees and Citizenship Canada and the Canada Border Services Agency.\n\nThe instructions on this page should be reviewed in conjunction with\n\n* [Business visitors [R186(a)]: Authorization to work without a work permit – International Mobility Program](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/foreign-workers/work-without-permit/business.html)\n* [Public list of Employers who have been non-compliant](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/foreign-workers/eligibility/public-list-employers-who-have-been-non-compliant.html)\n\nOfficers should initially assess Chilean citizens against the general [business visitor instructions](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/foreign-workers/work-without-permit/business.html) for [R186(a)](https://laws-lois.justice.gc.ca/eng/regulations/SOR-2002-227/section-186.html) found in the Immigration and Refugee Protection Regulations (IRPR) and related Program Delivery Instructions (PDIs). In cases where their activities are not covered by the general provisions, officers should refer to the business visitor provisions provided in [Chapter K of the Canada-Chile Free Trade Agreement (CCFTA)](https://www.international.gc.ca/trade-commerce/trade-agreements-accords-commerciaux/agr-acc/chile-chili/fta-ale/03k.aspx?lang=eng) to determine eligibility under R186(a).\n\nOn this page\n------------\n\n* [Eligibility](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/foreign-workers/international-free-trade-agreements/canada-chile/business-visitors.html#s1)\n* [Permissible business activities](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/foreign-workers/international-free-trade-agreements/canada-chile/business-visitors.html#s2)\n* [Documentary evidence](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/foreign-workers/international-free-trade-agreements/canada-chile/business-visitors.html#s3)\n* [Final decision](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/foreign-workers/international-free-trade-agreements/canada-chile/business-visitors.html#s4)\n\nEligibility\n-----------\n\nTo be eligible as a business visitor under CCFTA, a foreign national must:\n\n* be a citizen of Chile;\n* be engaged in permissible business activities as described in [Appendix K-03.I.1](https://www.international.gc.ca/trade-commerce/trade-agreements-accords-commerciaux/agr-acc/chile-chili/fta-ale/03k.aspx?lang=eng#:~:text=card%20for%20foreigners.-,Appendix%20K%2D03.I.1,-Business%20Visitors) of the CCFTA;\n* be engaged in permissible activities that are international in scope;\n* not have intent to enter the Canadian labour market; \n * the primary source of remuneration for the business activity remains outside Canada\n * the principal place of business of the foreign national remains outside Canada\n\n* be compliant with existing immigration and admissibility requirements for temporary entry;\n* request entry as a business visitor at a port of entry.\n\nBorder services officers at the Primary Inspection Line may make the determination that a foreign national meets the requirements for temporary entry as a business visitors, **except persons applying for entry under the after-sales service provision**. These foreign nationals should be referred to Immigration Secondary due to the complexity of the application and for reasons of client service and program consistency.\n\nPermissible business activities\n-------------------------------\n\nThe permissible business activities are generally of a commercial nature that reflect the components of a business cycle. Typical examples of business activities include, but are not limited to, consultation, negotiation, discussion, research, participation in educational, professional or business conventions or meetings and soliciting business.\n\nThe following are the permissible business activities under [Appendix K-03.I.1](https://www.international.gc.ca/trade-commerce/trade-agreements-accords-commerciaux/agr-acc/chile-chili/fta-ale/03k.aspx?lang=eng#:~:text=card%20for%20foreigners.-,Appendix%20K%2D03.I.1,-Business%20Visitors) of the CCFTA:\n\n* [Research and design](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/foreign-workers/international-free-trade-agreements/canada-chile/business-visitors.html#s2-1)\n* [Growth, manufacture and production](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/foreign-workers/international-free-trade-agreements/canada-chile/business-visitors.html#s2-2)\n* [Marketing](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/foreign-workers/international-free-trade-agreements/canada-chile/business-visitors.html#s2-3)\n* [Sales](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/foreign-workers/international-free-trade-agreements/canada-chile/business-visitors.html#s2-4)\n* [Distribution](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/foreign-workers/international-free-trade-agreements/canada-chile/business-visitors.html#s2-5)\n* [General service](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/foreign-workers/international-free-trade-agreements/canada-chile/business-visitors.html#s2-6)\n* [After-sales service](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/foreign-workers/international-free-trade-agreements/canada-chile/business-visitors.html#s2-7)\n\nThe term “commercial transaction” found in some provisions in [Appendix K-03.I.1](https://www.international.gc.ca/trade-commerce/trade-agreements-accords-commerciaux/agr-acc/chile-chili/fta-ale/03k.aspx?lang=eng#:~:text=card%20for%20foreigners.-,Appendix%20K%2D03.I.1,-Business%20Visitors) of the CCFTA may be described as any act within the confines of the law that is performed expressly to derive a profit. Commercial transactions refer to discussions and negotiations in respect to the sale, purchase, marketing, distribution, advertisement, procurement, transmission, transportation or packaging of goods or services."
    },
    {
      "heading": "Research and design",
      "heading_path": [
        "Business visitors – CCFTA [R186(a)] – Authorization to work without a work permit – International Mobility Program",
        "Research and design"
      ],
      "anchor": "#research-and-design",
      "text": "* Technical, scientific and statistical researchers conducting independent research or research for an [enterprise](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/terms-definitions.html#e1) located in the territory of the other Party."
    },
    {
      "heading": "Growth, manufacture and production",
      "heading_path": [
        "Business visitors – CCFTA [R186(a)] – Authorization to work without a work permit – International Mobility Program",
        "Research and design",
        "Growth, manufacture and production"
      ],
      "anchor": "#growth-manufacture-and-production",
      "text": "* Purchasing and production management personnel conducting commercial transactions for an enterprise located in the territory of the other Party."
    },
    {
      "heading": "Marketing",
      "heading_path": [
        "Business visitors – CCFTA [R186(a)] – Authorization to work without a work permit – International Mobility Program",
        "Research and design",
        "Marketing"
      ],
      "anchor": "#marketing",
      "text": "* Market researchers and analysts conducting independent research or analysis for an enterprise located in the territory of the other Party.\n* Trade fair and promotional personnel attending a trade convention to only promote their product may be granted entry under this provision. For [sales](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/foreign-workers/international-free-trade-agreements/canada-chile/business-visitors.html#s2-4) different provisions apply.\n* Organizers of trade fairs whose exhibitors are wholly of Chilean origin may be granted entry under this provision."
    },
    {
      "heading": "Sales",
      "heading_path": [
        "Business visitors – CCFTA [R186(a)] – Authorization to work without a work permit – International Mobility Program",
        "Research and design",
        "Sales"
      ],
      "anchor": "#sales",
      "text": "* Sales representatives and agents taking orders or negotiating contracts for goods or services for an enterprise located in the territory of the other Party but not delivering goods or providing services\n\n* Buyers purchasing for an enterprise located in the territory of the other Party."
    },
    {
      "heading": "Distribution",
      "heading_path": [
        "Business visitors – CCFTA [R186(a)] – Authorization to work without a work permit – International Mobility Program",
        "Research and design",
        "Distribution"
      ],
      "anchor": "#distribution",
      "text": "* Customs brokers providing consulting services regarding the facilitation of the import or export of goods."
    },
    {
      "heading": "General service",
      "heading_path": [
        "Business visitors – CCFTA [R186(a)] – Authorization to work without a work permit – International Mobility Program",
        "Research and design",
        "General service"
      ],
      "anchor": "#general-service",
      "text": "* Professionals engaging in a business activity at a professional level in a profession set out in [Appendix K-03.IV.1](https://www.international.gc.ca/trade-commerce/trade-agreements-accords-commerciaux/agr-acc/chile-chili/fta-ale/03k.aspx?lang=eng#:~:text=de%20Extranjer%C3%ADa%22).-,Appendix%20K%2D03.IV.1,-Professionals) of the CCFTA. \n * In order to determine whether the professional meet the conditions of R186(a) an officer should consider how the professional is being renumerated. An individual who is to be paid in Canada would be considered to be joining the labour market and could not be authorized to enter Canada as a business visitor, whereas, professionals whose primary source of remuneration for the business activity remains outside Canada may qualify.\n\n* Management and supervisory personnel engaging in a commercial transaction for an enterprise located in the territory of the other Party.\n* Financial services personnel (insurers, bankers or investment brokers) engaging in commercial transactions for an enterprise located in the territory of the other Party.\n* Public relations and advertising personnel consulting with [business associates](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/terms-definitions.html#b1), or attending or participating in conventions.\n* Tourism personnel (tour and travel agents, tour guides or tour operators) attending or participating in conventions or conducting a tour that has begun in the territory of the other Party, and\n* Translators or interpreters performing services as employees of an enterprise located in the territory of the other Party."
    },
    {
      "heading": "After-sales service",
      "heading_path": [
        "Business visitors – CCFTA [R186(a)] – Authorization to work without a work permit – International Mobility Program",
        "Research and design",
        "After-sales service"
      ],
      "anchor": "#after-sales-service",
      "text": "* Installers, repair and maintenance personnel, and supervisors, possessing specialized knowledge essential to a seller's contractual obligation, performing services or training workers to perform services, pursuant to a warranty or other service contract incidental to the sale of commercial or industrial equipment or machinery, including computer software, purchased from an enterprise located outside the territory of the Party into which temporary entry is sought, during the life of the warranty or service agreement.\n* After-sales service includes the installation, repair, or servicing of commercial, industrial equipment, machinery, or computer software.\n* Installation includes setting-up and testing of the commercial, industrial equipment, machinery, or computer software. It does **not** include operating the equipment or machinery, or computer software for production."
    },
    {
      "heading": "Specific eligibility requirements for after-sales service",
      "heading_path": [
        "Business visitors – CCFTA [R186(a)] – Authorization to work without a work permit – International Mobility Program",
        "Research and design",
        "After-sales service",
        "Specific eligibility requirements for after-sales service"
      ],
      "anchor": "#specific-eligibility-requirements-for-after-sales-service",
      "text": "The following requirements apply to business visitors seeking entry under the after-sales service provisions of CCFTA:\n\n* A citizen of Chile, who is employed by an enterprise established in Chile;\n* purpose of entry is to install, repair, service, or supervise these functions, or train workers to perform services;\n* work is pursuant to original sales contract and any warranty or service agreement incidental (connected) to the sale of equipment or machinery (including computer software);\n* equipment or machinery (including computer software) is commercial or industrial (not for household or personal use);\n* equipment or machinery or computer software was manufactured and purchased outside Canada;\n* work is carried out during the validity of any warranty or service agreement or any extensions of same;\n* work requires specialized knowledge (which excludes hands-on building and construction work); and\n* compliance with existing immigration requirements for temporary entry.\n\n**Note:** Persons granted entry to train or to supervise training may also train or supervise workers who are doing the hands-on building and construction work. This may require demonstrating certain procedures. The demonstration must not result in the completion of an [installation](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/terms-definitions.html#i1) or servicing task, or of part of such task, or in the productive operation of the equipment or machinery.\n\nThe CCFTA**does not**relieve after-sales service personnel, or any other business person, from the obligation to comply with municipal, regional, provincial/territorial, or other federal requirements where these apply."
    },
    {
      "heading": "Work that does not meet the eligibility requirements of after-sales service",
      "heading_path": [
        "Business visitors – CCFTA [R186(a)] – Authorization to work without a work permit – International Mobility Program",
        "Research and design",
        "After-sales service",
        "Work that does not meet the eligibility requirements of after-sales service"
      ],
      "anchor": "#work-that-does-not-meet-the-eligibility-requirements-of-after-sales-service",
      "text": "Persons whose activities or services in Canada would constitute hands-on building and construction work may **not** enter under [R186(a)](https://laws-lois.justice.gc.ca/eng/regulations/SOR-2002-227/section-186.html) and CCFTA as after-sales service.\n\nGenerally, the entry of foreign tradespersons in the building and construction industry is subject to an assessment of the availability of domestic labour (an LMIA). As part of the LMIA process, Service Canada will consult with organized labour prior to making a determination.\n\nFor personnel performing the installation or servicing, entry should not be granted when performing hands-on building and construction work. The performance of these activities are not permitted, regardless of wording in sales, warranty or service agreements supporting they be completed.\n\n**Building and construction work:**includes installing, maintaining, and repairing utility services, any part of the fabric of any building or structure, or machinery, equipment, or structures within a building.\n\nBuilding and construction work includes activities normally performed by (but not limited to):\n\n* labourers;\n* millwrights;\n* heat and frost insulators;\n* bricklayers;\n* carpenters and joiners;\n* electrical workers;\n* operating engineers (includes heavy equipment operators);\n* elevator constructors;\n* sheet metal workers;\n* teamsters;\n* boilermakers;\n* residential, commercial, or industrial painters (including the application of all service coatings no matter how applied);\n* bridge, structural, and ornamental ironworkers;\n* plumbers and pipefitters;\n* roofers; and\n* plasterers and cement masons.\n\nBuilding and construction work includes work involving:\n\n* assembly lines;\n* conveyor belts and systems;\n* overhead cranes;\n* heating, cooling, and ventilation or exhaust systems;\n* elevators and escalators;\n* boilers and turbines; and\n* dismantling or demolition of commercial or industrial equipment or machinery, whether on-site or in-plant.\n\nDocumentary evidence\n--------------------\n\nA business visitor under CCFTA must provide the following documentation:\n\n* proof of Chilean citizenship;\n* documentation to support the purpose for entry (must be a business activity listed in [Appendix K-03.I.1](https://www.international.gc.ca/trade-commerce/trade-agreements-accords-commerciaux/agr-acc/chile-chili/fta-ale/03k.aspx?lang=eng#:~:text=card%20for%20foreigners.-,Appendix%20K%2D03.I.1,-Business%20Visitors) of the CCFTA; and\n* evidence that the business activity is international in scope and that they are not attempting to enter the Canadian labour market. \n * the primary source of remuneration is outside Canada, and\n * the person’s place of business remains outside Canada and the profits of the business are accumulated primarily outside Canada.\n\nOral declaration as to the principal place of business and the actual place of accrual of profits can be used as documentary evidence. If further proof is requested, a letter from the employer or the representing organization is sufficient. Prior approval procedures, labour certification tests, or other similar procedures cannot be required. Every effort should be made to avoid the requirement of a visa.\n\nIn general, an individual who is to be paid in Canada would be considered to be joining the labour market and could not be authorized to enter Canada as a business visitor. The payment of expenses incidental to the trip is allowed, as is an honorarium."
    },
    {
      "heading": "Documentary evidence for after-sales service",
      "heading_path": [
        "Business visitors – CCFTA [R186(a)] – Authorization to work without a work permit – International Mobility Program",
        "Research and design",
        "Documentary evidence for after-sales service"
      ],
      "anchor": "#documentary-evidence-for-after-sales-service",
      "text": "Business visitors applying under the after-sales service provision of [Appendix K-03.I.1](https://www.international.gc.ca/trade-commerce/trade-agreements-accords-commerciaux/agr-acc/chile-chili/fta-ale/03k.aspx?lang=eng#:~:text=card%20for%20foreigners.-,Appendix%20K%2D03.I.1,-Business%20Visitors) of the CCFTA should be referred for a secondary examination when seeking entry, due to the complexity of the application and for reasons of client service and program\n\nThe following documentation is required:\n\n* proof of Chilean citizenship; and\n* copies of the original sales agreement, and warranty or service agreement, including extensions, which clearly support the purpose of entry.\n\nThe warranty or service contract must be incidental to, or connected to the sale of commercial or industrial equipment or machinery, including computer software.\n\nThe warranty or service agreement does not need to have the same date as the sales agreement. Particularly with third party service as it may take a number of months after the sale before the company installing or servicing the machinery is identified and sub-contracted.\n\nThe initial warranty or service agreement may be extended provided that the sales agreement, or initial warranty or service agreement contained a provision allowing for the extension. The after-sales service, therefore, continues to be contracted as part of the sale of the equipment or machinery, or computer software."
    },
    {
      "heading": "Third party service",
      "heading_path": [
        "Business visitors – CCFTA [R186(a)] – Authorization to work without a work permit – International Mobility Program",
        "Research and design",
        "Documentary evidence for after-sales service",
        "Third party service"
      ],
      "anchor": "#third-party-service",
      "text": "If [third party service](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/terms-definitions.html#t3) occurs, there must be clear wording in the sales agreement that specifies a third party will perform the installation, warranty, or service work. Unless such wording exists, there is no evidence that the third party service is incidental to the sale. However, the firm need not be named in the agreement, as it may take some time for the firm to be identified. When a third party is not named in the sales agreement, business visitors may be expected to provide a letter from the seller of the equipment that identifies them as the third party referenced in the original sales agreement.\n\nWhen a seller located in Chile contracts the after-sales servicing to a third party, it must be established in Chile."
    },
    {
      "heading": "Lack of Documentation",
      "heading_path": [
        "Business visitors – CCFTA [R186(a)] – Authorization to work without a work permit – International Mobility Program",
        "Research and design",
        "Documentary evidence for after-sales service",
        "Lack of Documentation"
      ],
      "anchor": "#lack-of-documentation",
      "text": "Every effort should be made to allow documentation to be provided (e.g., by fax, email or verbal explanation) from the company in Canada or the business visitor’s employer in Chile.\n\nThe requirement for documentation has been imposed in order to clearly establish that the proposed activity is incidental or connected to the sale of the equipment or machinery or computer software.\n\nA verbal statement that the business of the applicant is being carried on outside Canada can be acceptable. Alternative indications (business cards, business papers, advertising pamphlets, etc.) may be helpful.\n\nFinal decision\n--------------"
    },
    {
      "heading": "Visitor record",
      "heading_path": [
        "Business visitors – CCFTA [R186(a)] – Authorization to work without a work permit – International Mobility Program",
        "Research and design",
        "Visitor record"
      ],
      "anchor": "#visitor-record",
      "text": "A business visitor’s stay in Canada will usually be short-term (6 months or less).\n\nIt is recommended that border services officers consider issuing a [visitor record](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/visitors/visitor-record.html) to a business visitor engaged in ‘after-sales service’ work for a period of longer than 6 months and indicate in the “Remarks” section why a longer period of time is being granted.\n\nThese visits may take place over a period of weeks or months. In these circumstances, border services officers should consider issuing a visitor record to reduce potential referrals on future entries.\n\nApplications for extension of status should be determined based on whether the foreign national remains eligible.\n\nPage details\n------------\n\n 2024-10-03"
    }
  ],
  "links": {
    "outbound": [
      "https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/foreign-workers/eligibility/public-list-employers-who-have-been-non-compliant.html",
      "https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/foreign-workers/work-without-permit/business.html",
      "https://laws-lois.justice.gc.ca/eng/regulations/SOR-2002-227/section-186.html",
      "https://www.international.gc.ca/trade-commerce/trade-agreements-accords-commerciaux/agr-acc/chile-chili/fta-ale/03k.aspx?lang=eng",
      "https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/foreign-workers/international-free-trade-agreements/canada-chile/business-visitors.html",
      "https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/terms-definitions.html",
      "https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/visitors/visitor-record.html"
    ],
    "internal_children": []
  },
  "quality": {
    "is_toc_like": false,
    "is_low_text": false,
    "notes": []
  }
}