{
  "source_id": "pdi_fe960c6561dd",
  "source_type": "guidance_pdi",
  "source_url": "https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/foreign-workers/public-policy-competitiveness-economy/c45.html",
  "canonical_url": "https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/foreign-workers/public-policy-competitiveness-economy/c45.html",
  "title": "Foreign medical or dental residents and medical research fellows – [R205(c)(ii) – C45]– International Mobility Program",
  "language": "en",
  "manual": "Foreign medical or dental residents and medical research fellows – [R205(c)(ii) – C45]– International Mobility Program",
  "chapter": null,
  "heading_path": [
    "Foreign medical or dental residents and medical research fellows – [R205(c)(ii) – C45]– International Mobility Program"
  ],
  "last_updated": "2024-12-24",
  "crawl_ts": "2026-02-12T00:00:00Z",
  "http": {
    "status_code": 200,
    "content_type": "text/markdown"
  },
  "content_hash": "2421262619f5119e2c7b24b881257085bcf352cf5e7c570b8eb619eecb2330e0",
  "raw_html_path": null,
  "markdown_path": "scripts/scraper/ircc_data_clean/c45-fe960c6561.md",
  "text": "Published Time: Thu, 12 Feb 2026 00:43:29 GMT\n\nForeign medical or dental residents and medical research fellows – [R205(c)(ii) – C45]– International Mobility Program\n======================================================================================================================\n\nThis section contains policy, procedures and guidance used by IRCC staff. It is posted on the department’s website as a courtesy to stakeholders.\n\nEffective immediately, most foreign nationals in Canada are no longer eligible to apply for a work permit at a port of entry.\n\nThe following work permit applications are exempt from the above restrictions and may still be accepted for processing at a port of entry:\n\n* **applicants who are citizens or permanent residents of the United States of America (USA)**\n* **professionals and technicians under free trade agreements (FTAs)**\n * professionals under the FTA with the USA and Mexico (T36)\n * professionals under the FTA with Chile (F22)\n * contractual service suppliers or independent professionals under the FTA with South Korea (F32)\n * professionals under the FTA with Panama (F42)\n * professionals or technicians under the FTA with Colombia (F12)\n * professionals or technicians under the FTA with Peru (F52)\n\n* **spouses or common-law partners**of applicants under the FTAs with South Korea (F32), Panama (F42) and Colombia (F12)\n* **truck drivers** who are required to depart Canada for the purpose of their employment and, prior to their departure from Canada, held a work permit or maintained status as a result of a pending application for work permit renewal (this does not include truck drivers operating solely within Canada)\n* **applicants with pre-scheduled Canada Border Services Agency (CBSA) appointments**\n\nIn these instructions, “officer” refers to employees of both Immigration, Refugees and Citizenship Canada and the Canada Border Services Agency.\n\nThe instructions on this page should be reviewed in conjunction with the following:\n\n* [Employer-specific work permits — General processing — International Mobility Program](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/foreign-workers/eligibility/employer-specific-labout-market-impact-assessment-exemptions.html)\n* [Conditions and validity period on work permits](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/foreign-workers/eligibility/eligibility-admissibility-conditions-including-validity-period.html)\n* [Public list of Employers who have been non-compliant](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/foreign-workers/eligibility/public-list-employers-who-have-been-non-compliant.html)\n\nThe Minister has designated the work performed by foreign nationals who have been accepted for a medical or dental residency or a medical research fellowship and are not funded by a Canadian public source as necessary for public policy reasons related to the competitiveness of Canada’s academic institutions, or economy under [subparagraph 205(c)(ii) of the Immigration and Refugee Protection Regulations (IRPR)](https://laws-lois.justice.gc.ca/eng/regulations/SOR-2002-227/section-205.html). This designation was implemented on September 1, 2010.\n\nOn this page:\n-------------\n\n* [Eligibility](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/foreign-workers/public-policy-competitiveness-economy/c45.html#eligibility)\n* [Documentary evidence](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/foreign-workers/public-policy-competitiveness-economy/c45.html#documentary-evidence)\n* [Definitions](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/foreign-workers/public-policy-competitiveness-economy/c45.html#definitions)\n * [Medical residents](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/foreign-workers/public-policy-competitiveness-economy/c45.html#medical-residents)\n * [Publicly funded](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/foreign-workers/public-policy-competitiveness-economy/c45.html#publicly-funded)\n * [Medical fellowship holders](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/foreign-workers/public-policy-competitiveness-economy/c45.html#medical-fellowship)\n\n* [Global Case Management System (GCMS) fields to review in the offer of employment](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/foreign-workers/public-policy-competitiveness-economy/c45.html#gcms)\n* [Work permit issuance in GCMS](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/foreign-workers/public-policy-competitiveness-economy/c45.html#gcms-1)\n* [Previous updates](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/foreign-workers/public-policy-competitiveness-economy/c45.html#previous-updates)\n\nForeign medical residents and fellows do not take away employment or training opportunities from Canadians, as these positions are specifically created for and funded entirely by foreign governments, in the case of residents. Foreign fellows support medical faculties with advanced clinical and research training due to ongoing shortages of Canadians available and interested in occupying such positions.\n\nEligibility\n-----------\n\nTo be eligible under the administrative code C45, a foreign national must\n\n* hold a medical degree equivalent to that of a Canadian Medical Doctorate (for example, MD, Doctor of Dental Surgery, Doctor of Dental Medicine) \n * Prospective fellowships must also be recognized medical specialists who have completed residency training.\n\n* be coming to Canada to \n * complete a residency at a Canadian hospital or in a clinical setting as part of their medical training (medical and dental residents)\n * continue specializing in some highly specific field of study to advance clinical or medical research (medical fellowships)\n\n* be offered a residency position that is not publicly funded in Canada \n * Medical research fellows can be publicly funded\n\n* pass an [immigration medical examination](https://www.canada.ca/en/immigration-refugees-citizenship/services/application/medical-police/medical-exams/requirements-temporary-residents.html)\n\nDocumentary evidence\n--------------------\n\nThe following documents should be submitted with the work permit application:\n\n* either \n * an offer of employment number generated by the Employer Portal when the Canadian institution submits the offer, or\n * the Offer of Employment to a Foreign National Exempt from a Labour Market Impact Assessment (LMIA) form [IMM 5802] if authorized by the Client Experience Branch or Immigration Program Guidance Branch to submit the form (see [Alternate submission [IMM 5802]](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/foreign-workers/eligibility/employer-specific-labout-market-impact-assessment-exemptions.html#t4) for details) with proof of payment of the employer compliance fee\n\n* proof of a Medical Doctorate or medical degree and equivalency\n* copy of the letter of eligibility for licensure from the relevant provincial College of Physicians and Surgeons, where applicable\n* proof of completion of an immigration medical examination; proof is the printed “information sheet” from the panel physician who performed the medical exam.\n\n**Note:** In some provinces, fellows, particularly research fellows, have no patient contact. Regardless of whether contact with patients occurs, fellows, like all residents, **are required to pass an immigration medical exam** pursuant to [section R30](https://laws-lois.justice.gc.ca/eng/regulations/SOR-2002-227/section-30.html).\n\nDefinitions\n-----------\n\n### Medical residents\n\nForeign medical residents are holders of a medical degree equivalent to that of a Canadian Medical Doctorate (MD) who are coming to Canada to complete a residency at a Canadian hospital or in a clinical setting as part of their medical training.\n\nIn Canada, a Medical Doctorate is provided to those who have passed their coursework in the field of medicine or surgery from an accredited medical school. In Canada, the MD is technically considered an undergraduate degree.\n\nThe foreign medical degree may be directly equivalent (for example, MD, Doctor of Dental Surgery, Doctor of Dental Medicine) or in some countries, such as the United Kingdom or Ireland, it may be referred to as a Bachelor of Medicine or a Bachelor of Surgery (M.B.B.S).\n\nPositions occupied by these foreign nationals are non-ministry (not publicly) funded positions that have been created by Canadian medical faculties with financial support from the country sponsoring the training of the foreign resident.\n\n### Publicly funded\n\nThe income offered to the foreign workers must not be funded by Canadian tax payers’ money or public means through a national or subnational Canadian government institution, as opposed to private institutions, private universities or foreign governments.\n\nFor example, foreign nationals can get a placement with the University of Ottawa (Canadian publicly funded institution) under C45 as long as their wages are not being paid by the University of Ottawa.\n\nExamples with different types of institutions:\n\n**Examples of publicly funded universities:**\n\n* University of Ottawa\n* Université du Québec à Montréal\n\n**Examples of private Canadian universities:**\n\n* Ambrose University College\n* Canadian Mennonite University\n\nAs another example, certain foreign nationals are coming from the Kingdom of Saudi Arabia (KSA) to work in Canada (University of Toronto) under the medical resident category. In this case, the University of Toronto is the employer, but the government of KSA provides the wages of those workers.\n\nIn situations where the wages may be partially Canadian funded (that is, 50% Canadian funding and 50% foreign institution funding), as long as the Canadian portion is not being paid by a publicly funded Canadian institution, the work permit may be issued if the foreign national meets all other requirements under this category.\n\n### Medical fellowship holders\n\nForeign medical fellows are holders of a medical degree equivalent to that of a Canadian Medical Doctorate (MD) and recognized medical specialists who have completed residency training and accept to continue specializing in some highly specific field of study to advance clinical or medical research. Foreign medical fellows doing clinical work/research are typically performing very specific clinical/research work in a hospital, clinical or research setting. These positions may be publicly or privately funded.\n\nGlobal Case Management System (GCMS) fields to review in the offer of employment\n--------------------------------------------------------------------------------\n\n| Field | Considerations |\n| --- | --- |\n| LMIA Exemption Code | C45 – the employer should have selected this code Ensure that the exemption code matches the description in ‘Requirements Exemptions met’ |\n| Requirements Exemptions Met | Information in this field should outline when and where the foreign national received their MD and the source of funds to support the position. Please note that the information regarding how the employer and applicant meet the LMIA-exemption category requirements may be in an attachment to the offer. |\n| NOC | The [National Occupational Classification (NOC) Code](https://noc.esdc.gc.ca/) used should be for the position being offered, including the area of specialty. |\n| Duration and Expected Start Date | Duration of the work should be for the length of the residency training or fellowship period (number of months). Residents: Typically, terms of 2 to 7 years, or more, depending on the area of medical specialization. Fellowships: Typically for a term of 1 to 2 years. |\n| Wages | The wage should be commensurate with that of a Canadian performing the same duties in the same location of work. |\n| Alternate compensation or Additional information | For medical or dental residents, one of these fields should indicate the source of the income offered to the foreign worker. The income source for Residencies **cannot** be from Canadian public funds. |\n| Duties | These are the activities that the foreign national will be performing. Do they align with the occupation and what is described in the [National Occupational Classification](https://noc.esdc.gc.ca/)? |\n| Job Requirements | It should be indicated if a licence by the provincial College of Physicians and Surgeons is required in order to undergo their residency or fellowship in that province. An indication of whether the position is covered by a collective agreement |\n| Minimum Education Requirements | A Canadian Medical Doctorate (MD) or the foreign equivalent. |\n| Location | The Address list section should provide the physical work location (up to two locations) for the duration of the residency or fellowship. If there are more than two locations, the additional locations will be listed in the Duties field. |\n\nWork permit issuance in GCMS\n----------------------------\n\nUnder the Application screen, officers should enter the following information in the specified fields:\n\n| Field | Considerations |\n| --- | --- |\n| Case type | 52 – Employer-specific LMIA-exempt applications |\n| Province of destination | The province of destination entered by the applicant should match the address of employment in the LMIA-exempt offer of employment. This information is under the **Employment Details – LMIA-exempt** tab. |\n| City of destination | The city of destination entered by the applicant should match the address of employment in the LMIA-exempt offer of employment. This information is under the **Employment Details – LMIA-exempt** tab. |\n| Exemption code | This code is auto-populated from the LMIA-exempt offer of employment. Officers must manually enter the code when the use of the IMM 5802 is authorized. Code entered should match the code on the IMM 5802. This code should only be changed in specific circumstances. For further instruction see the following: [Changes between the offer of employment and the work permit application](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/foreign-workers/eligibility/employer-specific-labout-market-impact-assessment-exemptions.html#t9). |\n| NOC | The NOC code is auto-populated from the LMIA-exempt offer of employment. |\n| Intended occupation | Job title This is auto-populated from the LMIA-exempt offer of employment. |\n| LMIA/LMIA-exempt # | “A” number from the work permit application. This number is auto-populated from the work permit application, and it is what is used to “match” in the Portal. If the work permit application was submitted on paper, the officer must manually enter the number. |\n| Valid to | Should match the duration of the offer of employment or be valid until the travel document expires, whichever is earlier. If the foreign national is exempt from the travel document requirement (for example, they are a United States citizen), the work permit should be issued for the full duration of the offer of employment. Refer to [Validity period for work permits](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/foreign-workers/eligibility/eligibility-admissibility-conditions-including-validity-period.html#validity) |\n\nPrevious updates\n----------------\n\n2023-01-30:\n\n[Operational Bulletin (OB) 230 - September 1, 2010 - New Labour Market Opinion (LMO) Exemption – Foreign Medical Residents and Medical Research Fellows](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/bulletins-2010/230-september-1-2010.html) (expired)\n\nPage details\n------------\n\n 2024-12-24",
  "sections": [
    {
      "heading": "Foreign medical or dental residents and medical research fellows – [R205(c)(ii) – C45]– International Mobility Program",
      "heading_path": [
        "Foreign medical or dental residents and medical research fellows – [R205(c)(ii) – C45]– International Mobility Program"
      ],
      "anchor": "#foreign-medical-or-dental-residents-and-medical-research-fellows-r205-c-ii-c45-international-mobility-program",
      "text": "Published Time: Thu, 12 Feb 2026 00:43:29 GMT\n\nForeign medical or dental residents and medical research fellows – [R205(c)(ii) – C45]– International Mobility Program\n======================================================================================================================\n\nThis section contains policy, procedures and guidance used by IRCC staff. It is posted on the department’s website as a courtesy to stakeholders.\n\nEffective immediately, most foreign nationals in Canada are no longer eligible to apply for a work permit at a port of entry.\n\nThe following work permit applications are exempt from the above restrictions and may still be accepted for processing at a port of entry:\n\n* **applicants who are citizens or permanent residents of the United States of America (USA)**\n* **professionals and technicians under free trade agreements (FTAs)**\n * professionals under the FTA with the USA and Mexico (T36)\n * professionals under the FTA with Chile (F22)\n * contractual service suppliers or independent professionals under the FTA with South Korea (F32)\n * professionals under the FTA with Panama (F42)\n * professionals or technicians under the FTA with Colombia (F12)\n * professionals or technicians under the FTA with Peru (F52)\n\n* **spouses or common-law partners**of applicants under the FTAs with South Korea (F32), Panama (F42) and Colombia (F12)\n* **truck drivers** who are required to depart Canada for the purpose of their employment and, prior to their departure from Canada, held a work permit or maintained status as a result of a pending application for work permit renewal (this does not include truck drivers operating solely within Canada)\n* **applicants with pre-scheduled Canada Border Services Agency (CBSA) appointments**\n\nIn these instructions, “officer” refers to employees of both Immigration, Refugees and Citizenship Canada and the Canada Border Services Agency.\n\nThe instructions on this page should be reviewed in conjunction with the following:\n\n* [Employer-specific work permits — General processing — International Mobility Program](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/foreign-workers/eligibility/employer-specific-labout-market-impact-assessment-exemptions.html)\n* [Conditions and validity period on work permits](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/foreign-workers/eligibility/eligibility-admissibility-conditions-including-validity-period.html)\n* [Public list of Employers who have been non-compliant](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/foreign-workers/eligibility/public-list-employers-who-have-been-non-compliant.html)\n\nThe Minister has designated the work performed by foreign nationals who have been accepted for a medical or dental residency or a medical research fellowship and are not funded by a Canadian public source as necessary for public policy reasons related to the competitiveness of Canada’s academic institutions, or economy under [subparagraph 205(c)(ii) of the Immigration and Refugee Protection Regulations (IRPR)](https://laws-lois.justice.gc.ca/eng/regulations/SOR-2002-227/section-205.html). This designation was implemented on September 1, 2010.\n\nOn this page:\n-------------\n\n* [Eligibility](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/foreign-workers/public-policy-competitiveness-economy/c45.html#eligibility)\n* [Documentary evidence](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/foreign-workers/public-policy-competitiveness-economy/c45.html#documentary-evidence)\n* [Definitions](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/foreign-workers/public-policy-competitiveness-economy/c45.html#definitions)\n * [Medical residents](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/foreign-workers/public-policy-competitiveness-economy/c45.html#medical-residents)\n * [Publicly funded](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/foreign-workers/public-policy-competitiveness-economy/c45.html#publicly-funded)\n * [Medical fellowship holders](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/foreign-workers/public-policy-competitiveness-economy/c45.html#medical-fellowship)\n\n* [Global Case Management System (GCMS) fields to review in the offer of employment](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/foreign-workers/public-policy-competitiveness-economy/c45.html#gcms)\n* [Work permit issuance in GCMS](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/foreign-workers/public-policy-competitiveness-economy/c45.html#gcms-1)\n* [Previous updates](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/foreign-workers/public-policy-competitiveness-economy/c45.html#previous-updates)\n\nForeign medical residents and fellows do not take away employment or training opportunities from Canadians, as these positions are specifically created for and funded entirely by foreign governments, in the case of residents. Foreign fellows support medical faculties with advanced clinical and research training due to ongoing shortages of Canadians available and interested in occupying such positions.\n\nEligibility\n-----------\n\nTo be eligible under the administrative code C45, a foreign national must\n\n* hold a medical degree equivalent to that of a Canadian Medical Doctorate (for example, MD, Doctor of Dental Surgery, Doctor of Dental Medicine) \n * Prospective fellowships must also be recognized medical specialists who have completed residency training.\n\n* be coming to Canada to \n * complete a residency at a Canadian hospital or in a clinical setting as part of their medical training (medical and dental residents)\n * continue specializing in some highly specific field of study to advance clinical or medical research (medical fellowships)\n\n* be offered a residency position that is not publicly funded in Canada \n * Medical research fellows can be publicly funded\n\n* pass an [immigration medical examination](https://www.canada.ca/en/immigration-refugees-citizenship/services/application/medical-police/medical-exams/requirements-temporary-residents.html)\n\nDocumentary evidence\n--------------------\n\nThe following documents should be submitted with the work permit application:\n\n* either \n * an offer of employment number generated by the Employer Portal when the Canadian institution submits the offer, or\n * the Offer of Employment to a Foreign National Exempt from a Labour Market Impact Assessment (LMIA) form [IMM 5802] if authorized by the Client Experience Branch or Immigration Program Guidance Branch to submit the form (see [Alternate submission [IMM 5802]](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/foreign-workers/eligibility/employer-specific-labout-market-impact-assessment-exemptions.html#t4) for details) with proof of payment of the employer compliance fee\n\n* proof of a Medical Doctorate or medical degree and equivalency\n* copy of the letter of eligibility for licensure from the relevant provincial College of Physicians and Surgeons, where applicable\n* proof of completion of an immigration medical examination; proof is the printed “information sheet” from the panel physician who performed the medical exam.\n\n**Note:** In some provinces, fellows, particularly research fellows, have no patient contact. Regardless of whether contact with patients occurs, fellows, like all residents, **are required to pass an immigration medical exam** pursuant to [section R30](https://laws-lois.justice.gc.ca/eng/regulations/SOR-2002-227/section-30.html).\n\nDefinitions\n-----------"
    },
    {
      "heading": "Medical residents",
      "heading_path": [
        "Foreign medical or dental residents and medical research fellows – [R205(c)(ii) – C45]– International Mobility Program",
        "Medical residents"
      ],
      "anchor": "#medical-residents",
      "text": "Foreign medical residents are holders of a medical degree equivalent to that of a Canadian Medical Doctorate (MD) who are coming to Canada to complete a residency at a Canadian hospital or in a clinical setting as part of their medical training.\n\nIn Canada, a Medical Doctorate is provided to those who have passed their coursework in the field of medicine or surgery from an accredited medical school. In Canada, the MD is technically considered an undergraduate degree.\n\nThe foreign medical degree may be directly equivalent (for example, MD, Doctor of Dental Surgery, Doctor of Dental Medicine) or in some countries, such as the United Kingdom or Ireland, it may be referred to as a Bachelor of Medicine or a Bachelor of Surgery (M.B.B.S).\n\nPositions occupied by these foreign nationals are non-ministry (not publicly) funded positions that have been created by Canadian medical faculties with financial support from the country sponsoring the training of the foreign resident."
    },
    {
      "heading": "Publicly funded",
      "heading_path": [
        "Foreign medical or dental residents and medical research fellows – [R205(c)(ii) – C45]– International Mobility Program",
        "Medical residents",
        "Publicly funded"
      ],
      "anchor": "#publicly-funded",
      "text": "The income offered to the foreign workers must not be funded by Canadian tax payers’ money or public means through a national or subnational Canadian government institution, as opposed to private institutions, private universities or foreign governments.\n\nFor example, foreign nationals can get a placement with the University of Ottawa (Canadian publicly funded institution) under C45 as long as their wages are not being paid by the University of Ottawa.\n\nExamples with different types of institutions:\n\n**Examples of publicly funded universities:**\n\n* University of Ottawa\n* Université du Québec à Montréal\n\n**Examples of private Canadian universities:**\n\n* Ambrose University College\n* Canadian Mennonite University\n\nAs another example, certain foreign nationals are coming from the Kingdom of Saudi Arabia (KSA) to work in Canada (University of Toronto) under the medical resident category. In this case, the University of Toronto is the employer, but the government of KSA provides the wages of those workers.\n\nIn situations where the wages may be partially Canadian funded (that is, 50% Canadian funding and 50% foreign institution funding), as long as the Canadian portion is not being paid by a publicly funded Canadian institution, the work permit may be issued if the foreign national meets all other requirements under this category."
    },
    {
      "heading": "Medical fellowship holders",
      "heading_path": [
        "Foreign medical or dental residents and medical research fellows – [R205(c)(ii) – C45]– International Mobility Program",
        "Medical residents",
        "Medical fellowship holders"
      ],
      "anchor": "#medical-fellowship-holders",
      "text": "Foreign medical fellows are holders of a medical degree equivalent to that of a Canadian Medical Doctorate (MD) and recognized medical specialists who have completed residency training and accept to continue specializing in some highly specific field of study to advance clinical or medical research. Foreign medical fellows doing clinical work/research are typically performing very specific clinical/research work in a hospital, clinical or research setting. These positions may be publicly or privately funded.\n\nGlobal Case Management System (GCMS) fields to review in the offer of employment\n--------------------------------------------------------------------------------\n\n| Field | Considerations |\n| --- | --- |\n| LMIA Exemption Code | C45 – the employer should have selected this code Ensure that the exemption code matches the description in ‘Requirements Exemptions met’ |\n| Requirements Exemptions Met | Information in this field should outline when and where the foreign national received their MD and the source of funds to support the position. Please note that the information regarding how the employer and applicant meet the LMIA-exemption category requirements may be in an attachment to the offer. |\n| NOC | The [National Occupational Classification (NOC) Code](https://noc.esdc.gc.ca/) used should be for the position being offered, including the area of specialty. |\n| Duration and Expected Start Date | Duration of the work should be for the length of the residency training or fellowship period (number of months). Residents: Typically, terms of 2 to 7 years, or more, depending on the area of medical specialization. Fellowships: Typically for a term of 1 to 2 years. |\n| Wages | The wage should be commensurate with that of a Canadian performing the same duties in the same location of work. |\n| Alternate compensation or Additional information | For medical or dental residents, one of these fields should indicate the source of the income offered to the foreign worker. The income source for Residencies **cannot** be from Canadian public funds. |\n| Duties | These are the activities that the foreign national will be performing. Do they align with the occupation and what is described in the [National Occupational Classification](https://noc.esdc.gc.ca/)? |\n| Job Requirements | It should be indicated if a licence by the provincial College of Physicians and Surgeons is required in order to undergo their residency or fellowship in that province. An indication of whether the position is covered by a collective agreement |\n| Minimum Education Requirements | A Canadian Medical Doctorate (MD) or the foreign equivalent. |\n| Location | The Address list section should provide the physical work location (up to two locations) for the duration of the residency or fellowship. If there are more than two locations, the additional locations will be listed in the Duties field. |\n\nWork permit issuance in GCMS\n----------------------------\n\nUnder the Application screen, officers should enter the following information in the specified fields:\n\n| Field | Considerations |\n| --- | --- |\n| Case type | 52 – Employer-specific LMIA-exempt applications |\n| Province of destination | The province of destination entered by the applicant should match the address of employment in the LMIA-exempt offer of employment. This information is under the **Employment Details – LMIA-exempt** tab. |\n| City of destination | The city of destination entered by the applicant should match the address of employment in the LMIA-exempt offer of employment. This information is under the **Employment Details – LMIA-exempt** tab. |\n| Exemption code | This code is auto-populated from the LMIA-exempt offer of employment. Officers must manually enter the code when the use of the IMM 5802 is authorized. Code entered should match the code on the IMM 5802. This code should only be changed in specific circumstances. For further instruction see the following: [Changes between the offer of employment and the work permit application](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/foreign-workers/eligibility/employer-specific-labout-market-impact-assessment-exemptions.html#t9). |\n| NOC | The NOC code is auto-populated from the LMIA-exempt offer of employment. |\n| Intended occupation | Job title This is auto-populated from the LMIA-exempt offer of employment. |\n| LMIA/LMIA-exempt # | “A” number from the work permit application. This number is auto-populated from the work permit application, and it is what is used to “match” in the Portal. If the work permit application was submitted on paper, the officer must manually enter the number. |\n| Valid to | Should match the duration of the offer of employment or be valid until the travel document expires, whichever is earlier. If the foreign national is exempt from the travel document requirement (for example, they are a United States citizen), the work permit should be issued for the full duration of the offer of employment. Refer to [Validity period for work permits](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/foreign-workers/eligibility/eligibility-admissibility-conditions-including-validity-period.html#validity) |\n\nPrevious updates\n----------------\n\n2023-01-30:\n\n[Operational Bulletin (OB) 230 - September 1, 2010 - New Labour Market Opinion (LMO) Exemption – Foreign Medical Residents and Medical Research Fellows](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/bulletins-2010/230-september-1-2010.html) (expired)\n\nPage details\n------------\n\n 2024-12-24"
    }
  ],
  "links": {
    "outbound": [
      "https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/foreign-workers/eligibility/employer-specific-labout-market-impact-assessment-exemptions.html",
      "https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/foreign-workers/eligibility/eligibility-admissibility-conditions-including-validity-period.html",
      "https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/foreign-workers/eligibility/public-list-employers-who-have-been-non-compliant.html",
      "https://laws-lois.justice.gc.ca/eng/regulations/SOR-2002-227/section-205.html",
      "https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/foreign-workers/public-policy-competitiveness-economy/c45.html",
      "https://www.canada.ca/en/immigration-refugees-citizenship/services/application/medical-police/medical-exams/requirements-temporary-residents.html",
      "https://laws-lois.justice.gc.ca/eng/regulations/SOR-2002-227/section-30.html",
      "https://noc.esdc.gc.ca/",
      "https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/bulletins-2010/230-september-1-2010.html"
    ],
    "internal_children": []
  },
  "quality": {
    "is_toc_like": false,
    "is_low_text": false,
    "notes": []
  }
}