{
  "source_id": "pdi_142f227cfd34",
  "source_type": "guidance_pdi",
  "source_url": "https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/study-permits/campus-work.html",
  "canonical_url": "https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/study-permits/campus-work.html",
  "title": "Study permits: Off-campus work",
  "language": "en",
  "manual": "Study permits: Off",
  "chapter": "campus work",
  "heading_path": [
    "Study permits: Off-campus work"
  ],
  "last_updated": "2025-04-23",
  "crawl_ts": "2026-02-12T00:00:00Z",
  "http": {
    "status_code": 200,
    "content_type": "text/markdown"
  },
  "content_hash": "08c82c1214800b50c41964981b9c33b9c707d99f1ba56c64a4a756823adba233",
  "raw_html_path": null,
  "markdown_path": "scripts/scraper/ircc_data_clean/campus-work-142f227cfd.md",
  "text": "Published Time: Wed, 11 Feb 2026 22:30:58 GMT\n\nStudy permits: Off-campus work\n==============================\n\nThis section contains policy, procedures and guidance used by IRCC staff. It is posted on the department’s website as a courtesy to stakeholders.\n\nAs of June 1, 2014, certain students can work off campus without a work permit [[paragraph R186(v)](http://laws-lois.justice.gc.ca/eng/regulations/SOR-2002-227/section-186.html)]. Starting November 8, 2024, these students can work part time (up to 24 hours a week) during a regular academic session and full time during regularly scheduled breaks between academic sessions.\n\nOn this page\n------------\n\n* [Off-campus work hours: Temporary public policy](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/study-permits/campus-work.html#temp-policy)\n* [Eligibility requirements](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/study-permits/campus-work.html#eligibility-req)\n* [Definitions](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/study-permits/campus-work.html#definitions)\n* [Ineligible programs of study](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/study-permits/campus-work.html#ineligible-programs)\n* [Full-time status](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/study-permits/campus-work.html#fulltime-status)\n* [Conditions for work](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/study-permits/campus-work.html#conditions-work)\n* [Regularly scheduled breaks](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/study-permits/campus-work.html#scheduled-breaks)\n* [Off-campus work and completion of a program of studies](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/study-permits/campus-work.html#off-campus)\n\nOff-campus work hours: Temporary public policy\n----------------------------------------------\n\n**The temporary public policy has now expired**\n### Applications received on or before October 7, 2022\n\n**New: The Minister announced on December 7, 2023, that this public policy will be extended until April 30, 2024.**\n\nAs per the off-campus work hours public policy announced on October 7, 2022, from November 15, 2022, to April 30, 2024, certain students are permitted to work off campus without a work permit for more than 20 hours per week during a regular academic session if IRCC has received their study permit application on or before October 7, 2022. This public policy exempts eligible full-time international students without a work permit from the requirement that they work no more than 20 hours off campus per week during regular academic sessions.\n\n**Note:** There is a [new public policy](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/study-permits/campus-work.html#s2) for study permit applications received by IRCC between October 8, 2022, and December 7, 2023.\n\nThis applies to eligible international students\n\n* who meet all of the off-campus work[eligibility requirements](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/study-permits/campus-work.html#eligibility-req), as long as they hold a valid study permit and the study permit application associated with their study permit was received by IRCC on or before October 7,2022\n* whose study permit application has already been approved or is eventually approved\n* who are studying full-time at a designated learning institution (DLI) or part-time at a DLI during their final academic session, if their final academic session takes place between November 15,2022, and April 30,2024\n* who are currently in Canada or will be entering Canada at a later date but prior to the expiry of this public policy\n\n### For former study permit holders on maintained status\n\nThose on maintained status for a study permit may qualify for this temporary public policy if they meet the conditions below.\n\nThe foreign national\n\n* previously held a study permit \n* submitted an application under subsection 217(1) of the Immigration and Refugee Protection Regulations (IRPR) to renew their study permit before the previously held study permit expired, and that application for renewal was received by IRCC on or before October 7, 2022\n* is awaiting a decision on the application for renewal\n* is authorized to study without a study permit pursuant to section R189\n* is a full-time student enrolled at a DLI, as defined in section R211.1\n* is enrolled in a program that is a post-secondary academic, vocational or professional training program, or a vocational training program at the secondary school level offered in Quebec, of a duration of 6 months or more in both cases, that leads to a degree, diploma or certificate\n\n### Off-campus work hours public policy and study permit extensions\n\nIf the international student’s application for a study permit extension was received on or before October 7, 2022, and the application is approved, they may work more than 20 hours per week under the public policy until that study permit extension expires, or until April 30, 2024, whichever comes first.\n\n**Note:** There is a [new public policy](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/study-permits/campus-work.html#s2) for study permit extensions received by IRCC between October 8, 2022, and December 7, 2023.\n\n### Off-campus work hours public policy and co-op work permits\n\n**Study permit holders with an upcoming co-op placement**\n\nIf the student is eligible for this public policy for part or all of the period it is in effect (November 15, 2022, to April 30, 2024), they may not need to apply for a co-op work permit.\n\nA student does **not** need to apply for a co-op work permit if they meet both of the following criteria:\n\n* The entire co-op placement takes place between November 15, 2022, and April 30, 2024.\n* The student is eligible for the off-campus work hours public policy for the entire period of the co-op placement.\n\nIf the student does not meet both of the above criteria, they will need to apply for a co-op work permit.\n\n### Applications received between October 8, 2022, and December 7, 2023\n\n**New: On December 7, 2023, the Minister announced a new off-campus work hours public policy.** From January 1, 2024, to April 30, 2024, eligible students are permitted to work off campus without a work permit for more than 20 hours per week during a regular academic session if IRCC received their study permit application **between October 8, 2022, and December 7, 2023**.\n\n**Note:** If IRCC received the study permit application **before October 8, 2022,** see the previous [public policy](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/study-permits/campus-work.html#s1) that is now expiring on April 30, 2024.\n\nThis applies to eligible international students\n\n* who meet all of the off-campus work [eligibility requirements](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/study-permits/campus-work.html#eligibility-req), as long as they hold a valid study permit and the study permit application associated with their study permit was received by IRCC between October 8, 2022, and December 7, 2023,\n* whose study permit application has already been approved or is eventually approved\n* who are studying full-time at a DLI or part-time at a DLI during their final academic session, if their final academic session takes place between January 1, 2024, and April 30, 2024\n* who are currently in Canada or will be entering Canada at a later date but prior to the expiry of this public policy\n\n### For former study permit holders on maintained status\n\nThose on maintained status for a study permit may qualify for this temporary public policy if they meet the conditions below.\n\nThe foreign national\n\n* previously held a study permit\n* submitted an application under subsection R217(1) to renew their study permit before the previously held study permit expired, and that application for renewal was received by IRCC between October 8, 2022, and December 7, 2023,\n* is awaiting a decision on the application for renewal\n* is authorized to study without a study permit pursuant to section R189\n* is a full-time student enrolled at a DLI, as defined in section R211.1\n* is enrolled in a program that is a post-secondary academic, vocational or professional training program, or a vocational training program at the secondary school level offered in Quebec, of a duration of 6 months or more in both cases, that leads to a degree, diploma or certificate\n\n### Off-campus work hours public policy and study permit extensions\n\nIf the international student’s application for a study permit extension was received by IRCC **on or before December 7, 2023**, and the application is approved, they may work more than 20 hours per week under the public policy until the study permit extension expires, or until April 30, 2024, whichever comes first.\n\nIf the international student’s application for a study permit extension was received by IRCC **after December 7, 2023**, they may work more than 20 hours per week under the public policy until the expiry date of the study permit they applied to extend, or until April 30, 2024, whichever comes first.\n\n### Off-campus work hours public policy and co-op work permits\n\n#### Study permit holders with an upcoming co-op placement\n\nIf the student is eligible for this public policy for part or all of the period it is in effect (January 1, 2024, to April 30, 2024), they may not need to apply for a co-op work permit.\n\nA student does **not** need to apply for a co-op work permit if they meet both of the following criteria:\n\n* The entire co-op placement takes place between January 1, 2024, and April 30, 2024.\n* The student is eligible for the off-campus work hours public policy for the entire period of the co-op placement.\n\nIf the student does not meet both of the above criteria, they will need to apply for a co-op work permit.\n\nEligibility requirements\n------------------------\n\nInternational students can work off campus without a work permit, provided that all of the following statements are true:\n\n* They hold a valid study permit.\n* They are full-time students enrolled at a [designated learning institution(DLI)](https://www.canada.ca/en/immigration-refugees-citizenship/services/study-canada/study-permit/prepare/designated-learning-institutions-list.html).\n* The program in which they are enrolled is a post-secondary academic, vocational or professional training program, or a vocational training program at the secondary level offered in Quebec.\n* The program of study is at least 6 months in duration and leads to a degree, diploma or certificate.\n\n**Note:** The eligibility requirements for the Post-Graduation Work Permit Program(PGWPP) differ from off-campus work eligibility requirements. Please see the [PGWPP page](https://ircc.canada.ca/English/helpcentre/results-by-topic.asp?st=15.3.4) for more information.\n\nDefinitions\n-----------\n\n* **Academic program:** A post-secondary program that awards academic credentials to persons for whom the normal entrance requirement is high school completion or higher. This program is often delivered at institutions that award an academic degree, diploma or certificate, such as any of the following:\n * universities\n * colleges\n * CEGEPs\n * seminaries\n * institutes of technology\n\n* **Professional training:** A type of training usually offered to a person who is already a professional in a given field. Professional development is generally “accredited”; that is, it is recognized by an industry, association or profession. Professional training can be offered by learning institutions or professional associations, regulatory bodies or unions (for example, real estate appraisal, production and inventory control, food services management or specialty courses for lawyers, doctors, accountants, business administrators, engineers, dentists, teachers and counsellors).\n* **Vocational training:** A preparation for a specific occupation in an industry or a trade that is generally “accredited”. It may be offered through on-the-job programs, by unions in conjunction with businesses or employers or by learning institutions in conjunction with a specific industry or employer. This training may include any of the following:\n * technical training\n * organizational training\n * basic skills training\n\n* **Regularly scheduled break:** To be considered a regularly scheduled break, the break must be part of the DLI’s academic calendar (for instance, winter and summer holidays, Reading Week). Each regularly scheduled break should not be longer than 150 days. The maximum cumulative duration of scheduled breaks is 180 days per calendar year.\n* **Off campus:** Any location outside the boundaries of the campus of the educational institution at which the student is registered.\n\nIneligible programs of study\n----------------------------\n\nStudents are **not** eligible for the off-campus work permit program if either of the following applies:\n\n* they are registered in a general interest program of study that does not meet the definition of an academic, professional or vocational training program as [defined above](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/study-permits/campus-work.html#definitions) (for instance, ESL/FSL courses for self-improvement)\n* they are undertaking a course or program of study that is a prerequisite to their enrolment at a DLI\n\n**Note:** Students who are enrolled in a program of study that meets the definition of an academic, professional or vocational training program and who are undertaking the ESL/FSL component simultaneously may be eligible to work off campus pursuant to [paragraph R186(v)](http://laws-lois.justice.gc.ca/eng/regulations/SOR-2002-227/section-186.html) of the Immigration and Refugee Protection Regulations(IRPR).\n\nFull-time status\n----------------\n\nDLIs set the number of hours and credits toward a degree, diploma or certificate that are required for a student to hold full-time status. Officers will defer to DLIs on the determination of a student’s status.\n\nStudents must stop working off campus as soon as their full-time status becomes part-time during a regular academic session (for instance, a student may begin a regular academic session on a full-time basis and become part-time during the same session as they drop courses). In this case, they are no longer authorized to undertake off-campus work.\n\n### Co-op students\n\nIf the DLI considers a co-op student with a co-op work permit to have full-time status during the “work experience” portion of their program, **and** if the student continues to comply with the eligibility requirements under the co-op work permit program, the student may be eligible to work off campus, pursuant to [paragraph R186(v)](http://laws-lois.justice.gc.ca/eng/regulations/SOR-2002-227/section-186.html), on top of their co-op work hours.\n\nConditions for work\n-------------------\n\n### Maximum working hours permitted\n\nStudents eligible to work under [paragraph R186(v)](http://laws-lois.justice.gc.ca/eng/regulations/SOR-2002-227/section-186.html) can do the following:\n\n* work up to 24 hours per week during academic sessions once they have commenced their program of study\n* work full time during regularly scheduled breaks between academic sessions regardless of their course load\n\nStudents may not work until they have commenced their program of study. They must actually commence studies in Canada at a DLI before being eligible to work off campus.\n\n### Intensive programs\n\nSome intensive programs may not have regularly scheduled breaks. Students participating in such programs may work a maximum of 24 hours per week during the entire program of study.\n\n### Full-time students with a part-time course load in their final academic session\n\nStudents who have maintained full-time status for the duration of their program of study, and who only require a part-time course load in their final academic session in order to complete their program of study, are allowed to work full-time during the [regularly scheduled break](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/study-permits/campus-work.html#definitions) before their last semester and are allowed to work off campus up to 24 hours per week during their final academic session.\n\n### Working on campus in addition to working off campus\n\nThere are no restrictions on the number of hours students can work [on campus](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/study-permits/working-on-campus.html) [as per R186(f)] in addition to working off campus, provided they continue to meet the applicable eligibility requirements.\n\nRegularly scheduled breaks\n--------------------------\n\nIn order to work off campus without a work permit under paragraph R186(v), students must hold full-time status during the academic session before and after their regularly scheduled break. See the **regularly scheduled break** section under [Definitions](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/study-permits/campus-work.html#definitions).\n\n### Maximum duration of a regularly scheduled break\n\nIf an institution allows for back-to-back scheduled breaks, thus creating a break period longer than 150 consecutive days, students are only eligible to work off campus during the first 150 consecutive days. They cannot work for the entire break if it is longer than 150 consecutive days.\n\nTaking into account all regularly scheduled breaks, students may only work off campus on a full-time basis for a total of 180 days during each calendar year.\n\n### Full-time or part-time course load during a regularly scheduled break\n\nStudents who are enrolled full time during the academic sessions before and after a regularly scheduled break and who decide to undertake a full-time or part-time course load during that regularly scheduled break are eligible to work off campus on a full-time basis. If a program of study does not provide for a regularly scheduled break and a student creates their own break in a program, it is considered a leave from studies, rather than a regularly scheduled break. Students who create their own break in a program are not eligible to work on or off campus during that break.\n\n### Labour actions\n\nInternational students who are unable to fulfil their conditions as temporary residents due to circumstances entirely beyond their control (for instance, a school strike) during a regular academic session can, if they are eligible, still only work part time (up to 24 hours a week) off campus. In the event that a DLI goes on strike during a regularly scheduled break, international students who are eligible to work off campus may work full time **only** during the period that constitutes the regularly scheduled break.\n\nOff-campus work and completion of a program of studies\n------------------------------------------------------\n\n### Students who have not applied for a subsequent study or work permit or a program of study\n\nStudents may work off campus on a [part-time basis](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/study-permits/campus-work.html#definitions) if the following applies:\n\n* they meet the eligibility criteria to work off campus [[R186(v)](http://laws-lois.justice.gc.ca/eng/regulations/SOR-2002-227/section-186.html)]\n* they have completed the final academic requirements for their program of study but have **not yet** received written confirmation of program completion from their institution (for instance, a transcript, an official letter or an email)\n* they have not applied for a work permit (for instance, a post-graduation work permit or a work permit with a valid Labour Market Impact Assessment) or a study permit extension or enrolled in a subsequent program of study\n\nThey may work until the first date they receive written confirmation of program completion from their educational institution (for instance, an email, a letter, a transcript or a diploma), provided their study permit remains valid during this period. If the study permit becomes invalid [as per R222] before the student receives the notification of program completion from their institution, the student must **cease** working the day the study permit becomes invalid.\n\nOnce a student receives written confirmation of program completion from their institution, they are **no longer authorized** to continue to work in Canada, as they no longer meet the eligibility criteria in paragraph R186(v). They should apply to change their status (for instance, [to visitor status](https://www.canada.ca/en/immigration-refugees-citizenship/services/visit-canada/extend-stay.html)) or leave Canada before their study permit becomes invalid as per [section R222](https://laws-lois.justice.gc.ca/eng/regulations/SOR-2002-227/section-222.html).\n\n### Students who have completed a program of study and will be starting a new program of study within 150 days of receiving a written confirmation of program completion from their current institution\n\nStudents may work off campus on a full-time basis until the start of their new program if the following applies:\n\n* they meet the eligibility criteria to work off campus [[R186(v)](http://laws-lois.justice.gc.ca/eng/regulations/SOR-2002-227/section-186.html)]\n* they have received written confirmation of program completion from their current institution (for instance, a transcript or an official letter)\n* they have submitted an [application to change conditions, extend their stay or remain in Canada as a student](https://www.canada.ca/en/immigration-refugees-citizenship/services/study-canada/extend-study-permit/how-to-apply.html) before their current study permit expired, or they still have a valid study permit\n* they have been issued a letter of acceptance to a subsequent program of full-time study at a DLI and will be starting the new program within 150 calendar days of receiving a notification of program completion from their current institution\n\nIf the new program of study starts more than 150 calendar days after the first date they receive written confirmation of program completion from their current institution, the student is eligible to work off campus only during the first 150 consecutive days after the first date they receive written confirmation of program completion. They should then either apply to change their status (for instance, [change it into visitor status](https://www.canada.ca/en/immigration-refugees-citizenship/services/visit-canada/extend-stay.html)) or leave Canada until their new program commences.\n\nStudents who have applied to extend their stay in Canada as a student are required to cease working if their study permit application is refused.\n\n**Reminder:** When students transfer from one DLI to another, they must update their DLI number in their My Account immediately. When students transfer from one program of study to another at the same DLI, they are not required to notify Immigration, Refugees and Citizenship Canada.\n\n### Non-compliance\n\nNon-compliance with study permit conditions or the act of working without authorization may result in enforcement action. It may also negatively affect future applications made under the Immigration and Refugee Protection Act and the IRPR. For example, a subsequent study permit or work permit may not be issued.\n\nPage details\n------------\n\n 2025-04-23",
  "sections": [
    {
      "heading": "Study permits: Off-campus work",
      "heading_path": [
        "Study permits: Off-campus work"
      ],
      "anchor": "#study-permits-off-campus-work",
      "text": "Published Time: Wed, 11 Feb 2026 22:30:58 GMT\n\nStudy permits: Off-campus work\n==============================\n\nThis section contains policy, procedures and guidance used by IRCC staff. It is posted on the department’s website as a courtesy to stakeholders.\n\nAs of June 1, 2014, certain students can work off campus without a work permit [[paragraph R186(v)](http://laws-lois.justice.gc.ca/eng/regulations/SOR-2002-227/section-186.html)]. Starting November 8, 2024, these students can work part time (up to 24 hours a week) during a regular academic session and full time during regularly scheduled breaks between academic sessions.\n\nOn this page\n------------\n\n* [Off-campus work hours: Temporary public policy](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/study-permits/campus-work.html#temp-policy)\n* [Eligibility requirements](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/study-permits/campus-work.html#eligibility-req)\n* [Definitions](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/study-permits/campus-work.html#definitions)\n* [Ineligible programs of study](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/study-permits/campus-work.html#ineligible-programs)\n* [Full-time status](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/study-permits/campus-work.html#fulltime-status)\n* [Conditions for work](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/study-permits/campus-work.html#conditions-work)\n* [Regularly scheduled breaks](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/study-permits/campus-work.html#scheduled-breaks)\n* [Off-campus work and completion of a program of studies](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/study-permits/campus-work.html#off-campus)\n\nOff-campus work hours: Temporary public policy\n----------------------------------------------\n\n**The temporary public policy has now expired**"
    },
    {
      "heading": "Applications received on or before October 7, 2022",
      "heading_path": [
        "Study permits: Off-campus work",
        "Applications received on or before October 7, 2022"
      ],
      "anchor": "#applications-received-on-or-before-october-7-2022",
      "text": "**New: The Minister announced on December 7, 2023, that this public policy will be extended until April 30, 2024.**\n\nAs per the off-campus work hours public policy announced on October 7, 2022, from November 15, 2022, to April 30, 2024, certain students are permitted to work off campus without a work permit for more than 20 hours per week during a regular academic session if IRCC has received their study permit application on or before October 7, 2022. This public policy exempts eligible full-time international students without a work permit from the requirement that they work no more than 20 hours off campus per week during regular academic sessions.\n\n**Note:** There is a [new public policy](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/study-permits/campus-work.html#s2) for study permit applications received by IRCC between October 8, 2022, and December 7, 2023.\n\nThis applies to eligible international students\n\n* who meet all of the off-campus work[eligibility requirements](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/study-permits/campus-work.html#eligibility-req), as long as they hold a valid study permit and the study permit application associated with their study permit was received by IRCC on or before October 7,2022\n* whose study permit application has already been approved or is eventually approved\n* who are studying full-time at a designated learning institution (DLI) or part-time at a DLI during their final academic session, if their final academic session takes place between November 15,2022, and April 30,2024\n* who are currently in Canada or will be entering Canada at a later date but prior to the expiry of this public policy"
    },
    {
      "heading": "For former study permit holders on maintained status",
      "heading_path": [
        "Study permits: Off-campus work",
        "Applications received on or before October 7, 2022",
        "For former study permit holders on maintained status"
      ],
      "anchor": "#for-former-study-permit-holders-on-maintained-status",
      "text": "Those on maintained status for a study permit may qualify for this temporary public policy if they meet the conditions below.\n\nThe foreign national\n\n* previously held a study permit \n* submitted an application under subsection 217(1) of the Immigration and Refugee Protection Regulations (IRPR) to renew their study permit before the previously held study permit expired, and that application for renewal was received by IRCC on or before October 7, 2022\n* is awaiting a decision on the application for renewal\n* is authorized to study without a study permit pursuant to section R189\n* is a full-time student enrolled at a DLI, as defined in section R211.1\n* is enrolled in a program that is a post-secondary academic, vocational or professional training program, or a vocational training program at the secondary school level offered in Quebec, of a duration of 6 months or more in both cases, that leads to a degree, diploma or certificate"
    },
    {
      "heading": "Off-campus work hours public policy and study permit extensions",
      "heading_path": [
        "Study permits: Off-campus work",
        "Applications received on or before October 7, 2022",
        "Off-campus work hours public policy and study permit extensions"
      ],
      "anchor": "#off-campus-work-hours-public-policy-and-study-permit-extensions",
      "text": "If the international student’s application for a study permit extension was received on or before October 7, 2022, and the application is approved, they may work more than 20 hours per week under the public policy until that study permit extension expires, or until April 30, 2024, whichever comes first.\n\n**Note:** There is a [new public policy](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/study-permits/campus-work.html#s2) for study permit extensions received by IRCC between October 8, 2022, and December 7, 2023."
    },
    {
      "heading": "Off-campus work hours public policy and co-op work permits",
      "heading_path": [
        "Study permits: Off-campus work",
        "Applications received on or before October 7, 2022",
        "Off-campus work hours public policy and co-op work permits"
      ],
      "anchor": "#off-campus-work-hours-public-policy-and-co-op-work-permits",
      "text": "**Study permit holders with an upcoming co-op placement**\n\nIf the student is eligible for this public policy for part or all of the period it is in effect (November 15, 2022, to April 30, 2024), they may not need to apply for a co-op work permit.\n\nA student does **not** need to apply for a co-op work permit if they meet both of the following criteria:\n\n* The entire co-op placement takes place between November 15, 2022, and April 30, 2024.\n* The student is eligible for the off-campus work hours public policy for the entire period of the co-op placement.\n\nIf the student does not meet both of the above criteria, they will need to apply for a co-op work permit."
    },
    {
      "heading": "Applications received between October 8, 2022, and December 7, 2023",
      "heading_path": [
        "Study permits: Off-campus work",
        "Applications received on or before October 7, 2022",
        "Applications received between October 8, 2022, and December 7, 2023"
      ],
      "anchor": "#applications-received-between-october-8-2022-and-december-7-2023",
      "text": "**New: On December 7, 2023, the Minister announced a new off-campus work hours public policy.** From January 1, 2024, to April 30, 2024, eligible students are permitted to work off campus without a work permit for more than 20 hours per week during a regular academic session if IRCC received their study permit application **between October 8, 2022, and December 7, 2023**.\n\n**Note:** If IRCC received the study permit application **before October 8, 2022,** see the previous [public policy](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/study-permits/campus-work.html#s1) that is now expiring on April 30, 2024.\n\nThis applies to eligible international students\n\n* who meet all of the off-campus work [eligibility requirements](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/study-permits/campus-work.html#eligibility-req), as long as they hold a valid study permit and the study permit application associated with their study permit was received by IRCC between October 8, 2022, and December 7, 2023,\n* whose study permit application has already been approved or is eventually approved\n* who are studying full-time at a DLI or part-time at a DLI during their final academic session, if their final academic session takes place between January 1, 2024, and April 30, 2024\n* who are currently in Canada or will be entering Canada at a later date but prior to the expiry of this public policy"
    },
    {
      "heading": "For former study permit holders on maintained status",
      "heading_path": [
        "Study permits: Off-campus work",
        "Applications received on or before October 7, 2022",
        "For former study permit holders on maintained status"
      ],
      "anchor": "#for-former-study-permit-holders-on-maintained-status",
      "text": "Those on maintained status for a study permit may qualify for this temporary public policy if they meet the conditions below.\n\nThe foreign national\n\n* previously held a study permit\n* submitted an application under subsection R217(1) to renew their study permit before the previously held study permit expired, and that application for renewal was received by IRCC between October 8, 2022, and December 7, 2023,\n* is awaiting a decision on the application for renewal\n* is authorized to study without a study permit pursuant to section R189\n* is a full-time student enrolled at a DLI, as defined in section R211.1\n* is enrolled in a program that is a post-secondary academic, vocational or professional training program, or a vocational training program at the secondary school level offered in Quebec, of a duration of 6 months or more in both cases, that leads to a degree, diploma or certificate"
    },
    {
      "heading": "Off-campus work hours public policy and study permit extensions",
      "heading_path": [
        "Study permits: Off-campus work",
        "Applications received on or before October 7, 2022",
        "Off-campus work hours public policy and study permit extensions"
      ],
      "anchor": "#off-campus-work-hours-public-policy-and-study-permit-extensions",
      "text": "If the international student’s application for a study permit extension was received by IRCC **on or before December 7, 2023**, and the application is approved, they may work more than 20 hours per week under the public policy until the study permit extension expires, or until April 30, 2024, whichever comes first.\n\nIf the international student’s application for a study permit extension was received by IRCC **after December 7, 2023**, they may work more than 20 hours per week under the public policy until the expiry date of the study permit they applied to extend, or until April 30, 2024, whichever comes first."
    },
    {
      "heading": "Study permit holders with an upcoming co-op placement",
      "heading_path": [
        "Study permits: Off-campus work",
        "Applications received on or before October 7, 2022",
        "Off-campus work hours public policy and co-op work permits",
        "Study permit holders with an upcoming co-op placement"
      ],
      "anchor": "#study-permit-holders-with-an-upcoming-co-op-placement",
      "text": "If the student is eligible for this public policy for part or all of the period it is in effect (January 1, 2024, to April 30, 2024), they may not need to apply for a co-op work permit.\n\nA student does **not** need to apply for a co-op work permit if they meet both of the following criteria:\n\n* The entire co-op placement takes place between January 1, 2024, and April 30, 2024.\n* The student is eligible for the off-campus work hours public policy for the entire period of the co-op placement.\n\nIf the student does not meet both of the above criteria, they will need to apply for a co-op work permit.\n\nEligibility requirements\n------------------------\n\nInternational students can work off campus without a work permit, provided that all of the following statements are true:\n\n* They hold a valid study permit.\n* They are full-time students enrolled at a [designated learning institution(DLI)](https://www.canada.ca/en/immigration-refugees-citizenship/services/study-canada/study-permit/prepare/designated-learning-institutions-list.html).\n* The program in which they are enrolled is a post-secondary academic, vocational or professional training program, or a vocational training program at the secondary level offered in Quebec.\n* The program of study is at least 6 months in duration and leads to a degree, diploma or certificate.\n\n**Note:** The eligibility requirements for the Post-Graduation Work Permit Program(PGWPP) differ from off-campus work eligibility requirements. Please see the [PGWPP page](https://ircc.canada.ca/English/helpcentre/results-by-topic.asp?st=15.3.4) for more information.\n\nDefinitions\n-----------\n\n* **Academic program:** A post-secondary program that awards academic credentials to persons for whom the normal entrance requirement is high school completion or higher. This program is often delivered at institutions that award an academic degree, diploma or certificate, such as any of the following:\n * universities\n * colleges\n * CEGEPs\n * seminaries\n * institutes of technology\n\n* **Professional training:** A type of training usually offered to a person who is already a professional in a given field. Professional development is generally “accredited”; that is, it is recognized by an industry, association or profession. Professional training can be offered by learning institutions or professional associations, regulatory bodies or unions (for example, real estate appraisal, production and inventory control, food services management or specialty courses for lawyers, doctors, accountants, business administrators, engineers, dentists, teachers and counsellors).\n* **Vocational training:** A preparation for a specific occupation in an industry or a trade that is generally “accredited”. It may be offered through on-the-job programs, by unions in conjunction with businesses or employers or by learning institutions in conjunction with a specific industry or employer. This training may include any of the following:\n * technical training\n * organizational training\n * basic skills training\n\n* **Regularly scheduled break:** To be considered a regularly scheduled break, the break must be part of the DLI’s academic calendar (for instance, winter and summer holidays, Reading Week). Each regularly scheduled break should not be longer than 150 days. The maximum cumulative duration of scheduled breaks is 180 days per calendar year.\n* **Off campus:** Any location outside the boundaries of the campus of the educational institution at which the student is registered.\n\nIneligible programs of study\n----------------------------\n\nStudents are **not** eligible for the off-campus work permit program if either of the following applies:\n\n* they are registered in a general interest program of study that does not meet the definition of an academic, professional or vocational training program as [defined above](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/study-permits/campus-work.html#definitions) (for instance, ESL/FSL courses for self-improvement)\n* they are undertaking a course or program of study that is a prerequisite to their enrolment at a DLI\n\n**Note:** Students who are enrolled in a program of study that meets the definition of an academic, professional or vocational training program and who are undertaking the ESL/FSL component simultaneously may be eligible to work off campus pursuant to [paragraph R186(v)](http://laws-lois.justice.gc.ca/eng/regulations/SOR-2002-227/section-186.html) of the Immigration and Refugee Protection Regulations(IRPR).\n\nFull-time status\n----------------\n\nDLIs set the number of hours and credits toward a degree, diploma or certificate that are required for a student to hold full-time status. Officers will defer to DLIs on the determination of a student’s status.\n\nStudents must stop working off campus as soon as their full-time status becomes part-time during a regular academic session (for instance, a student may begin a regular academic session on a full-time basis and become part-time during the same session as they drop courses). In this case, they are no longer authorized to undertake off-campus work."
    },
    {
      "heading": "Co-op students",
      "heading_path": [
        "Study permits: Off-campus work",
        "Applications received on or before October 7, 2022",
        "Co-op students"
      ],
      "anchor": "#co-op-students",
      "text": "If the DLI considers a co-op student with a co-op work permit to have full-time status during the “work experience” portion of their program, **and** if the student continues to comply with the eligibility requirements under the co-op work permit program, the student may be eligible to work off campus, pursuant to [paragraph R186(v)](http://laws-lois.justice.gc.ca/eng/regulations/SOR-2002-227/section-186.html), on top of their co-op work hours.\n\nConditions for work\n-------------------"
    },
    {
      "heading": "Maximum working hours permitted",
      "heading_path": [
        "Study permits: Off-campus work",
        "Applications received on or before October 7, 2022",
        "Maximum working hours permitted"
      ],
      "anchor": "#maximum-working-hours-permitted",
      "text": "Students eligible to work under [paragraph R186(v)](http://laws-lois.justice.gc.ca/eng/regulations/SOR-2002-227/section-186.html) can do the following:\n\n* work up to 24 hours per week during academic sessions once they have commenced their program of study\n* work full time during regularly scheduled breaks between academic sessions regardless of their course load\n\nStudents may not work until they have commenced their program of study. They must actually commence studies in Canada at a DLI before being eligible to work off campus."
    },
    {
      "heading": "Intensive programs",
      "heading_path": [
        "Study permits: Off-campus work",
        "Applications received on or before October 7, 2022",
        "Intensive programs"
      ],
      "anchor": "#intensive-programs",
      "text": "Some intensive programs may not have regularly scheduled breaks. Students participating in such programs may work a maximum of 24 hours per week during the entire program of study."
    },
    {
      "heading": "Full-time students with a part-time course load in their final academic session",
      "heading_path": [
        "Study permits: Off-campus work",
        "Applications received on or before October 7, 2022",
        "Full-time students with a part-time course load in their final academic session"
      ],
      "anchor": "#full-time-students-with-a-part-time-course-load-in-their-final-academic-session",
      "text": "Students who have maintained full-time status for the duration of their program of study, and who only require a part-time course load in their final academic session in order to complete their program of study, are allowed to work full-time during the [regularly scheduled break](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/study-permits/campus-work.html#definitions) before their last semester and are allowed to work off campus up to 24 hours per week during their final academic session."
    },
    {
      "heading": "Working on campus in addition to working off campus",
      "heading_path": [
        "Study permits: Off-campus work",
        "Applications received on or before October 7, 2022",
        "Working on campus in addition to working off campus"
      ],
      "anchor": "#working-on-campus-in-addition-to-working-off-campus",
      "text": "There are no restrictions on the number of hours students can work [on campus](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/study-permits/working-on-campus.html) [as per R186(f)] in addition to working off campus, provided they continue to meet the applicable eligibility requirements.\n\nRegularly scheduled breaks\n--------------------------\n\nIn order to work off campus without a work permit under paragraph R186(v), students must hold full-time status during the academic session before and after their regularly scheduled break. See the **regularly scheduled break** section under [Definitions](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/study-permits/campus-work.html#definitions)."
    },
    {
      "heading": "Maximum duration of a regularly scheduled break",
      "heading_path": [
        "Study permits: Off-campus work",
        "Applications received on or before October 7, 2022",
        "Maximum duration of a regularly scheduled break"
      ],
      "anchor": "#maximum-duration-of-a-regularly-scheduled-break",
      "text": "If an institution allows for back-to-back scheduled breaks, thus creating a break period longer than 150 consecutive days, students are only eligible to work off campus during the first 150 consecutive days. They cannot work for the entire break if it is longer than 150 consecutive days.\n\nTaking into account all regularly scheduled breaks, students may only work off campus on a full-time basis for a total of 180 days during each calendar year."
    },
    {
      "heading": "Full-time or part-time course load during a regularly scheduled break",
      "heading_path": [
        "Study permits: Off-campus work",
        "Applications received on or before October 7, 2022",
        "Full-time or part-time course load during a regularly scheduled break"
      ],
      "anchor": "#full-time-or-part-time-course-load-during-a-regularly-scheduled-break",
      "text": "Students who are enrolled full time during the academic sessions before and after a regularly scheduled break and who decide to undertake a full-time or part-time course load during that regularly scheduled break are eligible to work off campus on a full-time basis. If a program of study does not provide for a regularly scheduled break and a student creates their own break in a program, it is considered a leave from studies, rather than a regularly scheduled break. Students who create their own break in a program are not eligible to work on or off campus during that break."
    },
    {
      "heading": "Labour actions",
      "heading_path": [
        "Study permits: Off-campus work",
        "Applications received on or before October 7, 2022",
        "Labour actions"
      ],
      "anchor": "#labour-actions",
      "text": "International students who are unable to fulfil their conditions as temporary residents due to circumstances entirely beyond their control (for instance, a school strike) during a regular academic session can, if they are eligible, still only work part time (up to 24 hours a week) off campus. In the event that a DLI goes on strike during a regularly scheduled break, international students who are eligible to work off campus may work full time **only** during the period that constitutes the regularly scheduled break.\n\nOff-campus work and completion of a program of studies\n------------------------------------------------------"
    },
    {
      "heading": "Students who have not applied for a subsequent study or work permit or a program of study",
      "heading_path": [
        "Study permits: Off-campus work",
        "Applications received on or before October 7, 2022",
        "Students who have not applied for a subsequent study or work permit or a program of study"
      ],
      "anchor": "#students-who-have-not-applied-for-a-subsequent-study-or-work-permit-or-a-program-of-study",
      "text": "Students may work off campus on a [part-time basis](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/study-permits/campus-work.html#definitions) if the following applies:\n\n* they meet the eligibility criteria to work off campus [[R186(v)](http://laws-lois.justice.gc.ca/eng/regulations/SOR-2002-227/section-186.html)]\n* they have completed the final academic requirements for their program of study but have **not yet** received written confirmation of program completion from their institution (for instance, a transcript, an official letter or an email)\n* they have not applied for a work permit (for instance, a post-graduation work permit or a work permit with a valid Labour Market Impact Assessment) or a study permit extension or enrolled in a subsequent program of study\n\nThey may work until the first date they receive written confirmation of program completion from their educational institution (for instance, an email, a letter, a transcript or a diploma), provided their study permit remains valid during this period. If the study permit becomes invalid [as per R222] before the student receives the notification of program completion from their institution, the student must **cease** working the day the study permit becomes invalid.\n\nOnce a student receives written confirmation of program completion from their institution, they are **no longer authorized** to continue to work in Canada, as they no longer meet the eligibility criteria in paragraph R186(v). They should apply to change their status (for instance, [to visitor status](https://www.canada.ca/en/immigration-refugees-citizenship/services/visit-canada/extend-stay.html)) or leave Canada before their study permit becomes invalid as per [section R222](https://laws-lois.justice.gc.ca/eng/regulations/SOR-2002-227/section-222.html)."
    },
    {
      "heading": "Students who have completed a program of study and will be starting a new program of study within 150 days of receiving a written confirmation of program completion from their current institution",
      "heading_path": [
        "Study permits: Off-campus work",
        "Applications received on or before October 7, 2022",
        "Students who have completed a program of study and will be starting a new program of study within 150 days of receiving a written confirmation of program completion from their current institution"
      ],
      "anchor": "#students-who-have-completed-a-program-of-study-and-will-be-starting-a-new-program-of-study-within-150-days-of-receiving-a-written-confirmation-of-program-completion-from-their-current-institution",
      "text": "Students may work off campus on a full-time basis until the start of their new program if the following applies:\n\n* they meet the eligibility criteria to work off campus [[R186(v)](http://laws-lois.justice.gc.ca/eng/regulations/SOR-2002-227/section-186.html)]\n* they have received written confirmation of program completion from their current institution (for instance, a transcript or an official letter)\n* they have submitted an [application to change conditions, extend their stay or remain in Canada as a student](https://www.canada.ca/en/immigration-refugees-citizenship/services/study-canada/extend-study-permit/how-to-apply.html) before their current study permit expired, or they still have a valid study permit\n* they have been issued a letter of acceptance to a subsequent program of full-time study at a DLI and will be starting the new program within 150 calendar days of receiving a notification of program completion from their current institution\n\nIf the new program of study starts more than 150 calendar days after the first date they receive written confirmation of program completion from their current institution, the student is eligible to work off campus only during the first 150 consecutive days after the first date they receive written confirmation of program completion. They should then either apply to change their status (for instance, [change it into visitor status](https://www.canada.ca/en/immigration-refugees-citizenship/services/visit-canada/extend-stay.html)) or leave Canada until their new program commences.\n\nStudents who have applied to extend their stay in Canada as a student are required to cease working if their study permit application is refused.\n\n**Reminder:** When students transfer from one DLI to another, they must update their DLI number in their My Account immediately. When students transfer from one program of study to another at the same DLI, they are not required to notify Immigration, Refugees and Citizenship Canada."
    },
    {
      "heading": "Non-compliance",
      "heading_path": [
        "Study permits: Off-campus work",
        "Applications received on or before October 7, 2022",
        "Non-compliance"
      ],
      "anchor": "#non-compliance",
      "text": "Non-compliance with study permit conditions or the act of working without authorization may result in enforcement action. It may also negatively affect future applications made under the Immigration and Refugee Protection Act and the IRPR. For example, a subsequent study permit or work permit may not be issued.\n\nPage details\n------------\n\n 2025-04-23"
    }
  ],
  "links": {
    "outbound": [
      "http://laws-lois.justice.gc.ca/eng/regulations/SOR-2002-227/section-186.html",
      "https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/study-permits/campus-work.html",
      "https://www.canada.ca/en/immigration-refugees-citizenship/services/study-canada/study-permit/prepare/designated-learning-institutions-list.html",
      "https://ircc.canada.ca/English/helpcentre/results-by-topic.asp?st=15.3.4",
      "https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/study-permits/working-on-campus.html",
      "https://www.canada.ca/en/immigration-refugees-citizenship/services/visit-canada/extend-stay.html",
      "https://laws-lois.justice.gc.ca/eng/regulations/SOR-2002-227/section-222.html",
      "https://www.canada.ca/en/immigration-refugees-citizenship/services/study-canada/extend-study-permit/how-to-apply.html"
    ],
    "internal_children": []
  },
  "quality": {
    "is_toc_like": false,
    "is_low_text": false,
    "notes": []
  }
}