{
  "source_id": "pdi_e6295e1e8386",
  "source_type": "guidance_pdi",
  "source_url": "https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/permits/considerations-specific-victims-human-trafficking.html",
  "canonical_url": "https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/permits/considerations-specific-victims-human-trafficking.html",
  "title": "Temporary resident permits (TRPs): Considerations specific to victims of trafficking in persons",
  "language": "en",
  "manual": "Temporary resident permits (TRPs): Considerations specific to victims of trafficking in persons",
  "chapter": null,
  "heading_path": [
    "Temporary resident permits (TRPs): Considerations specific to victims of trafficking in persons"
  ],
  "last_updated": "2025-04-04",
  "crawl_ts": "2026-02-12T00:00:00Z",
  "http": {
    "status_code": 200,
    "content_type": "text/markdown"
  },
  "content_hash": "c22534326813a76ff6dfc0b1e4c13bde989557937c988dcb58035e5abafb2cb2",
  "raw_html_path": null,
  "markdown_path": "scripts/scraper/ircc_data_clean/considerations-specific-victims-human-trafficking-e6295e1e83.md",
  "text": "Published Time: Thu, 12 Feb 2026 00:33:59 GMT\n\nTemporary resident permits (TRPs): Considerations specific to victims of trafficking in persons\n===============================================================================================\n\nThis section contains policy, procedures and guidance used by IRCC staff. It is posted on the department’s website as a courtesy to stakeholders.\n\nTo enhance existing in-Canada mechanisms for protecting foreign nationals who may be victims of human trafficking (also known as “victims of trafficking in persons”), the Minister of Immigration, Refugees and Citizenship issued[Ministerial Instructions](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/mandate/policies-operational-instructions-agreements/ministerial-instructions/other-goals/mi81.html)(MIs) regarding the issuance of temporary resident permits (TRPs) to out-of-status foreign national victims of human trafficking and their dependants that are in Canada. IRCC has further developed guidance to be used in assessing TRP applications from these potential victims.\n\nThe objective of the MIs and the following guidance is to provide protection to vulnerable out-of-status foreign nationals who are victims of human trafficking and their dependants in Canada, by regularizing their temporary status in Canada through the issuance of a temporary resident permit, when the officer is of the opinion that it is justified in the circumstances. Protection measures also relate to their eligibility to apply for a work and/or study permit, and their access to healthcare coverage through the Interim Federal Health Program for the duration of their temporary resident permit, when the victims are not already covered under another healthcare program or insurance.\n\nThe issuance of TRPs for victims of human trafficking falls under IRCC’s activities under the protection pillar of the Government of Canada’s[National Strategy to Combat Human Trafficking](https://www.publicsafety.gc.ca/cnt/rsrcs/pblctns/2019-ntnl-strtgy-hmnn-trffc/index-en.aspx).\n\nOn this page\n------------\n\n* [Criteria to assess whether an applicant is a victim of human trafficking](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/permits/considerations-specific-victims-human-trafficking.html#a1)\n* [Initial TRP (based on an in-depth assessment)](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/permits/considerations-specific-victims-human-trafficking.html#a2)\n* [Initial TRP (based on a preliminary assessment)](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/permits/considerations-specific-victims-human-trafficking.html#a3)\n* [Subsequent TRP](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/permits/considerations-specific-victims-human-trafficking.html#a4)\n* [Considerations](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/permits/considerations-specific-victims-human-trafficking.html#a5)\n* [Dependants](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/permits/considerations-specific-victims-human-trafficking.html#a6)\n* [Work and study permits](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/permits/considerations-specific-victims-human-trafficking.html#a7)\n* [Background information](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/permits/considerations-specific-victims-human-trafficking.html#sec4)\n\nCriteria to assess whether an applicant is a victim of human trafficking\n------------------------------------------------------------------------\n\nThe criteria used to assess whether the applicant is a victim of human trafficking should include indications that the recruitment, transfer or transport of the foreign national was fraudulent, deceptive or coerced (for example, intimidation, extortion, kidnapping), and meets either of the following criteria:\n\n1. The foreign national’s freedom was restricted; for instance: \n 1. by the exercise of control (for example, receipt, harbouring, holding, concealing, directing, influencing over their movements or debt bondage)\n 2. the use of force (for example, abduction, physical assault, sexual assault, confinement, restraint) \n 3. the threat of the use of force\n\n2. The foreign national was coerced into exploitative employment or other exploitative activities (for example, sexual exploitation, forced labour or services, slavery, organ removal).\n\n**Note:**The 1-year bar to access a TRP under[subsection A24(4)](https://laws-lois.justice.gc.ca/eng/acts/I-2.5/page-6.html#h-274473)does not prevent an officer from considering and issuing or refusing a TRP for a potential victim of human trafficking on their own initiative.\n\nInitial TRP (based on an in-depth assessment)\n---------------------------------------------\n\nWhen a foreign national first comes to the attention of IRCC, officers should attempt to conduct an in-depth analysis of the applicant’s situation. When an officer is able to do so, they should consider issuing a temporary resident permit for **at least 12 months**, if they have reasonable grounds to believe that the applicant **is** a victim of human trafficking.\n\nOfficers should adopt a 2-step decision-making process when assessing and considering whether to issue an initial TRP for victims of human trafficking. The 2-step decision-making process is as follows:\n\n1. Are there reasonable grounds to believe the individual **is** a victim of human trafficking?\n2. Is the issuance of a TRP for victims of human trafficking justified in the circumstances?\n\n### Step 1\n\nThe first step is to verify through an**in-depth assessment** of the circumstances that an individual **is** a victim of human trafficking, which includes an assessment of credibility. This determination is based on the [criteria](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/permits/considerations-specific-victims-human-trafficking.html#a1) listed above.\n\nShould the officer determine that there are **reasonable grounds to believe** that the foreign national **is** a victim of human trafficking, they should move to the second step of the decision-making process.\n\nFollowing the in-depth assessment, should the officer find no reasonable grounds to believe that the foreign national **is**a victim of human trafficking, they should refuse the application. If the application is refused, an officer may consider other available options, but should not proceed further with the application for a TRP for victims of human trafficking, as described in this PDI.\n\n### Step 2\n\nIf an officer finds reasonable grounds to believe that the individual **is** a victim of human trafficking, the second step is for the officer to determine, at their discretion, whether a TRP for victims of human trafficking is warranted given the circumstances. Officers are justified in issuing an initial TRP for any of the following purposes:\n\n* to allow them to escape the influence of the traffickers\n* to provide them with a period of time to consider their options and help them make an informed decision on a future course of action \n* to allow them to recover from physical and/or mental trauma resulting from the exploitation and abuse they were exposed to (for example, counselling and/or medical treatment may be necessary)\n* for any other purpose an officer may find relevant to facilitate the protection of vulnerable foreign nationals who are victims of human trafficking in Canada\n\nInitial TRP (based on a preliminary assessment)\n-----------------------------------------------\n\nWhen a foreign national first comes to the attention of IRCC, it is not always possible for an officer to conduct an in-depth analysis to determine if an applicant is a victim of human trafficking, due to numerous factors, such as:\n\n* the complexity and urgency of the case\n* the trauma that a victim may have experienced or continues to experience\n* the victim is part of a group of individuals identified at the same time and interviewing each individual may not be operationally feasible.\n\nFor these reasons, officers may only be able to conduct a **preliminary assessment** that, based on the circumstances presented, there are reasonable grounds to believe that the individual **may****be** a victim of human trafficking. The temporary resident permit issued following such a preliminary assessment should be valid for a period of **up to 12 months.**\n\nOfficers should follow the 2-step decision-making process when assessing and considering whether to issue a short-term initial temporary resident permit for victims of human trafficking.\n\n### Step 1\n\nThe first step is to verify through a**preliminary assessment** of the circumstances that there are reasonable grounds to believe that an individual **may be** a victim of human trafficking, which includes an assessment of credibility. This determination is based on the [criteria](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/permits/considerations-specific-victims-human-trafficking.html#a1) listed above.\n\nShould the officer determine that there are **reasonable grounds to believe** that the foreign national **may be** a victim of human trafficking, they should move to the second step of the decision-making process.\n\nShould the officer determine that there aren’t reasonable grounds to believe that the foreign national**may****be**a victim of human trafficking, they should refuse the application. If the application is refused, an officer may consider other available options and refer to the relevant PDIs for guidance on those options.\n\n### Step 2\n\nOfficers are justified in issuing a short-term initial TRP, of **up to 12 months,** for any of the following purposes:\n\n* to allow them to escape the influence of the traffickers\n* to provide them with a period of time to consider their options and help them make an informed decision on a future course of action \n* to allow them to recover from physical and/or mental trauma resulting from the exploitation and abuse they were exposed to (for example, counselling and/or medical treatment may be necessary)\n* for any other purpose an officer may find relevant to facilitate the protection of vulnerable foreign nationals who are victims of human trafficking in Canada\n\nSubsequent TRP\n--------------\n\nUpon the submission of an application for a subsequent TRP for victims of human trafficking, an officer may issue a subsequent TRP for a duration of **up to 3 years** to an individual if they have determined, **based on an in-depth assessment**, that there are **reasonable grounds to believe** that the individual **is** a victim of human trafficking in persons, and that a subsequent TRP for victims of human trafficking should be issued.\n\nTo facilitate the decision-making process when assessing a subsequent TRP application, officers should adopt the following 2-step process.\n\n### Step 1\n\nEstablish whether there are **reasonable grounds to believe** that the suspected victim **is** a victim of human trafficking (refer to the [criteria](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/permits/considerations-specific-victims-human-trafficking.html#a1)). A more complete verification of the facts, established through an interview with the applicant and in consultation with law enforcement, may be needed where appropriate.\n\nAgain, should the officer determine that there are **reasonable grounds to believe** that the foreign national **is** a victim of human trafficking, they should move to the second step of the decision-making process.\n\nIf an officer does not find reasonable grounds to believe that an individual is a victim of human trafficking, then a subsequent TRP should not be issued. If the application is refused, an officer may consider other available options, but should not proceed further with this PDI.\n\n### Step 2\n\nOfficers will need to determine, at their discretion, whether a subsequent TRP should be issued given the circumstances, taking into consideration the purposes listed above.\n\nConsiderations\n--------------\n\nIt is important to note that the issuance of an initial TRP does not guarantee that the applicant will be issued a subsequent TRP.\n\n**Note:** Applicants are not required to provide a law enforcement endorsement or report to substantiate their application and may self-identify to IRCC as a victim of human trafficking. The absence of a law enforcement endorsement or report is **not** a valid reason to refuse an application.\n\nOfficers should take into account apparent risks when considering the circumstances of the victim; however, the goal of the assessment is not to duplicate the[pre-removal risk assessment (PRRA) process](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/refugee-protection/removal-risk-assessment.html).\n\n**Note:**Persons who have been trafficked to and inside Canada may have been kept in isolation from Canadian society, may be illiterate or unskilled, and may not have formed support networks that they want or are able to depend on to help them integrate into Canadian society. These circumstances should not weigh against affording them legal status.\n\n**Note:**It is important to note that the issuance of a TRP for victims of human trafficking is not intended to be a pathway to permanent residence, but to respond to the precarious situation of the vulnerable temporary resident.\n\nIf the person is suspected or determined to be a victim of human trafficking, officers may assist them in contacting organizations that provide assistance to trafficked persons, their foreign representative in Canada, non-governmental organizations (NGOs), or provincial and municipal agencies.\n\nIn certain instances, the individual may want to return to their country of citizenship or legal permanent residence. If the person is in the enforcement stream, Canada Border Services Agency (CBSA) is responsible for sending the person home; therefore, IRCC officers should contact the local CBSA office. If not in the enforcement stream, a referral should be made to the [United Nations High Commissioner for Refugees (UNHCR)](https://www.unhcr.ca/) or the victim’s foreign representative and/or embassy (if specifically requested).\n\nEnforcement cases involving potential victims of human trafficking should be referred to The Family and Social Immigration Branch (FSIB) for guidance. This includes potential victims who have an active warrant.\n\nFollowing the issuance of an initial TRP, if the applicant is from a visa-exempt country, their[electronic travel authorization (eTA) should be cancelled in the Global Case Management System (GCMS)](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/eta/manually-processing-electronic-travel-authorization-applications.html). If the applicant is from a visa-required country, and their visa was issued as a result of fraud or misrepresentation, please refer to the following procedures to cancel their visa:[Temporary residents: Cancellation of a temporary resident visa](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/visitors/cancellation-visa.html). FSIB should be contacted if there are questions or concerns about cancelling travel documents.\n\nIf the person chooses to file a refugee claim, refer to[In-Canada claims for refugee protection](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/refugee-protection/canada.html).\n\nDependants\n----------\n\nDependants of victims of human trafficking who are in Canada without status are eligible for a TRP for victims of human trafficking (for dependants), an open work permit and study permit that are fee-exempt, and IFHP coverage .\n\nWork and study permits\n----------------------\n\nA TRP valid for a minimum of 180 days makes the holder eligible to apply for a work and study permit. A TRP does not exempt the permit holder from the requirement to apply for a work and/or study permit if they wish to work and/or study in Canada. If the victim of human trafficking wants to apply for a work and/or study permit, the application should be processed by the IRCC processing office at the same time as the TRP application for victims of human trafficking, and not be directed to the Case Processing Centre in Edmonton (CPC-E).\n\nAny applications received at CPC-E and submitted by TRP for victims of human trafficking holders should be referred to the processing office that issued the TRP. They should not be processed by CPC-E.\n\nTRP for victims of human trafficking holders are also not eligible to apply for a temporary resident visa (TRV) from within Canada if their TRP is not authorized for re-entry.\n\n### Interviewing\n\nOfficers must be sensitive to the personal situation of a suspected victim of human trafficking as they may be experiencing psychological and/or physical trauma. They may also require the assistance of an interpreter.\n\nThe objectives of conducting an interview are to\n\n* establish the facts of the case\n* verify that the individual may be, is or was a victim of human trafficking, and establish credibility\n* use the facts to determine the best course of action for developing an immediate or long term response\n\nFor the purpose of assessing a TRP for victims of human trafficking application, IRCC has the sole authority to determine if\n\n* there are reasonable grounds to believe that the applicant is or may be a victim of human trafficking\n* a TRP for victims of human trafficking is justified given the circumstances\n\nIf the victim is referred to IRCC by a law enforcement agency, that agency can assist with the preliminary assessment of the circumstances to verify whether an individual may be a victim of human trafficking. However, the final decision as to whether or not a TRP should be issued rests with IRCC.\n\nIf the potential victim is referred by an NGO, and if CBSA or the Royal Canadian Mounted Police (RCMP) have not already been consulted, consultations may occur provided the disclosure of information is permitted by the potential victim.\n\nIf a removal order has been issued against a potential victim of human trafficking by the CBSA, FSIB should be contacted immediately regardless of whether the client has a TRP for victims of human trafficking application in the system or not.\n\nIn reaching a decision, officers should keep in mind that the objective of these guidelines is to respond to the vulnerable situation of victims of human trafficking by providing them with a means of regularizing their temporary resident status in Canada, when the officer is of the opinion that it is justified in the circumstances.\n\nFor information on dealing with trafficked children, consult[ENF 21 – Recovering Missing, Abducted and Exploited Children (PDF, 285 KB)](https://www.canada.ca/content/dam/ircc/migration/ircc/english/resources/manuals/enf/enf21-eng.pdf). Officers should be mindful of the rights of the child, and should contact provincial services for assistance.\n\nFor more detailed information regarding the interview, see[Interview guidelines](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/permits/considerations-specific-victims-human-trafficking.html#int-guide).\n\n### Where an application is processed\n\nDue to the urgent nature of these cases and the vulnerability of the clients, TRP for victims of human trafficking applications are processed as a priority by Humanitarian and Identity Operations Branch (HIOB’s) Vulnerable Persons Unit (VPU). These individuals may, for instance:\n\n* be in Canada without status\n* lack travel and identity documents\n* be living in a shelter or with their trafficker\n\nThese applications must**not**be directed to CPC-E. If these cases are identified at a case processing centre, efforts should be made to transfer the application to the VPU as expeditiously as possible.\n\nApplications for subsequent TRPs for victims of human trafficking must also be submitted to and processed by the VPU.\n\nThe VPU can be contacted by mail at:\n\nIRCC – Vulnerable Persons Unit\n\n5343 Dundas Street West, Suite 105\n\nToronto ON M9B 6K5\n\n### Public policy – Fees\n\nA public policy is in effect to exempt the payment of application fees for the initial and subsequent TRPs for victims of human trafficking, open work permit, study permit and biometrics fees.\n\n### Cost recovery\n\nThe open work permit privilege fee does not apply to work permits issued with a TRP under paragraph R208(b) and should not be charged.\n\nFor fee purposes, the TRP should be coded as M26 in[GCMS](https://gcms-smgc.apps.ci.gc.ca/), the work permit should be coded as E12 and the study permit coded as 999.\n\n### Other measures available\n\nForeign nationals who are victims of human trafficking may avail themselves of a number of other legislative and administrative measures in order to remain in Canada temporarily or permanently. These include refugee protection claims, applications for permanent residence under humanitarian and compassionate (H&C) considerations, and pre-removal risk assessments. The individual should be made aware of these options by the officer responsible for processing their case.\n\n**Note: Requesting consideration of a regular TRP**\n\nShould an applicant request that an officer consider the issuance of a regular TRP if the TRP for victims of human trafficking is going to be refused, the officer should\n\n* request payment of the TRP fee from the applicant\n* refer the application to the general TRP queue (and placed in the queue based on the original date received) \n\n### Collection of biometrics\n\nAs outlined in the public policy concerning the payment of application fees for victims of human trafficking, applicants and their dependents are fee-exempt for the provision of services in relation to the collection of biometrics information.\n\nUpon receipt of an application under these MIs, an officer will verify if valid biometrics results exist for the applicant and, if not, they will send a BIL letter to the applicant. Fee exemption code B12 should be used for the biometrics (if no valid biometrics results already exist).\n\nBackground information\n----------------------\n\n### Methods used by traffickers\n\nTraffickers use a variety of methods to control their victims, which include but are not limited to\n\n* confiscation of their identification documents (including passports and travel documents)\n* monitoring and surveillance\n* restraint\n* sexual assault\n* violence or threats of violence against them or their family members\n\nHuman trafficking may occur across or within borders, often involves extensive organized criminal networks, and violates the basic human rights of its victims.\n\nVictims of human trafficking may enter Canada illegally or legally. For example, victims may\n\n* be smuggled into Canada in a clandestine manner\n* enter legitimately, with an approved electronic travel authorization (eTA) or temporary resident visa (TRV)\n* enter legally but let their status expire\n\nTraffickers may use deception or false documents to fraudulently obtain visas or assist victims to be admitted at a port of entry. Victims of human trafficking may or may not be aware that they have entered Canada illegally. In certain cases, persons who enter Canada as legitimate visitors are subsequently exploited by traffickers.\n\nIdentifying victims of human trafficking who are in transit can be difficult. Exploitation may not yet have occurred, and potential victims would be unaware of the traffickers’ true intent. At this stage, victims may view traffickers as assisting, rather than exploiting them.\n\n### Impact of trafficking on victims\n\nHuman trafficking results in a number of direct and indirect harmful consequences to its victims. Victims of human trafficking may be physically and/or sexually assaulted, confined, restrained and/or subjected to psychological abuse. Fear for their own personal safety, and for the safety of their loved ones, can cause additional emotional trauma and stress. Victims of human trafficking may also experience shame, low self-esteem and a sense of powerlessness. Many victims of human trafficking suffer from post-traumatic stress disorder, and they may fear or mistrust authorities.\n\n### Smuggling versus trafficking\n\nHuman trafficking is often confused with migrant smuggling; however, it is important to be able to distinguish between the two.\n\n#### Migrant smuggling\n\n* Occurs with the consent of the smuggled person.\n* Smuggled persons are generally free to go once they arrive in the country of final destination, where they usually have no further contact with the smuggler.\n\n#### Human trafficking\n\n* Involves the use of threats, force, fraud or other forms of coercion.\n* Victims of human trafficking are not at liberty in their final destination. They are exploited for the labour or services they can provide.\n\n#### Similarities between the two\n\nBoth migrant smuggling and human trafficking may present similarities and are often only distinguished after further investigation. Smuggled persons may become victims of human trafficking at any point in the smuggling process. Some may consent, for example, to being smuggled across a border, but find on arrival in the country of destination that debt bondage, or other forms of coercion, have been imposed. If this occurs, they become victims of human trafficking, regardless of whether they consented to being smuggled in the first place.\n\n### Interview guidelines\n\nThese interview guidelines and suggestions have been developed by the International Organization for Migration (IOM). While the intention is to be as facilitative as possible, it is at the discretion of the officer administering the interview to allow the suspected victim’s legal representative or any NGO representative to sit in on the interview with the suspected victim. Should an officer refuse a request from a representative to attend the interview, they should document in detail as to the reason why in GCMS.\n\n#### Duty of the interviewer\n\n* inform the victim that the purpose of the interview is to assist the person\n* treat the victim-witness sensitively, with empathy and with full respect of their human rights\n* adhere to the “Do no harm” principle\n* create optimum conditions to minimize the stress of the interview\n* put no undue pressure on the victim to make a statement\n* provide the victim with a fair opportunity to tell the story\n* be sensitive to any gender issues, such as the victim and interviewer being the same gender.\n\n#### Interview style\n\nCourteous, respectful, sensitive and aware of the issues.\n\n* avoid an authoritarian approach\n* avoid over-familiarity, through eye contact or body language\n* ask simple questions\n* be encouraging\n* listen actively\n* allow free speech and avoid interruption\n* be aware that some questions may seek to recall painful events\n* the victim may need to take a break at any time.\n\nThe critical concepts to be detected in the interview are those of exploitation and loss of or limitations on liberty.\n\nTypical interview questions might include, but are not limited to the following.\n\n#### Recruitment and documentation\n\n* How did you get to Canada?\n* Did anyone help you enter Canada?\n* What did you think you were coming to Canada to do?\n* How did you obtain the documentation used to enter Canada (if person entered Canada with documentation)?\n\n#### Employment and coercion\n\n* What did you come to Canada to do?\n* What sort of work did you actually perform, once you arrived in Canada?\n* Were you paid for your services? How much?\n* Did your employer(s) say that you owed them anything? What for?\n* Did you have to pay any of your earnings toward a debt?\n* Were you allowed to keep any/all of your earnings?\n* Do you believe that you still owe your employers anything?\n\n#### Working conditions (exploitation)\n\n* Did you and your employer have a written document setting out your respective entitlements and obligations? Do you have it?\n* How many hours a day did you work?\n* Were you allowed any time off?\n* Were you permitted time off if you were sick?\n\n#### Restriction on liberty and the use of force\n\n* Were you allowed to communicate with family members?\n* Did you live and work at the same place? If so, were you permitted to leave the premises as you wished?\n* Did anyone accompany you if you did leave?\n* Were threats made to you, your family members or others close to you?\n* What happened to your identification documents after you arrived?\n* Were you able to leave your job and seek another one, if you so wished?\n* What did you believe would happen if you attempted to leave?\n\n### Trafficking provisions under IRPA and the Criminal Code\n\nSections[A118](https://laws-lois.justice.gc.ca/eng/acts/i-2.5/section-118.html),[A120](https://laws-lois.justice.gc.ca/eng/acts/i-2.5/section-120.html)and[A121](https://laws-lois.justice.gc.ca/eng/acts/i-2.5/section-121.html)establish a specific human trafficking offence and provide for stiff penalties for trafficking persons into Canada.\n\n[Sections 279.01, 279.02, 279.03 and 279.04](https://laws-lois.justice.gc.ca/eng/acts/C-46/page-63.html#docCont)of the Criminal Code set out human trafficking offence and punishments.\n\nSeveral other Criminal Code offences have also been used to address human trafficking cases, including\n\n* kidnapping,[subsections 279(1) and (1.1)](https://laws-lois.justice.gc.ca/eng/acts/C-46/section-279.html)\n* forcible confinement,[subsection 279(2)](https://laws-lois.justice.gc.ca/eng/acts/C-46/section-279.html)\n* extortion,[subsection 346(1)](https://laws-lois.justice.gc.ca/eng/acts/C-46/section-346.html)\n* intimidation,[section 423](https://laws-lois.justice.gc.ca/eng/acts/C-46/section-423.html)\n* assault,[section 265](https://laws-lois.justice.gc.ca/eng/acts/C-46/section-265.html)to[section 268](https://laws-lois.justice.gc.ca/eng/acts/C-46/section-268.html)\n* causing death or bodily harm by criminal negligence,[section 220](https://laws-lois.justice.gc.ca/eng/acts/C-46/section-220.html)and[section 221](https://laws-lois.justice.gc.ca/eng/acts/C-46/section-221.html)\n* homicide,[section 222](https://laws-lois.justice.gc.ca/eng/acts/C-46/section-222.html)to[section 228](https://laws-lois.justice.gc.ca/eng/acts/C-46/section-228.html)\n* sexual assault,[section 271](https://laws-lois.justice.gc.ca/eng/acts/C-46/section-271.html)to[section 273](https://laws-lois.justice.gc.ca/eng/acts/C-46/section-273.html)\n* uttering threats,[subsection 264.1(1)](https://laws-lois.justice.gc.ca/eng/acts/C-46/section-264.1.html)\n* conspiracy,[section 465](https://laws-lois.justice.gc.ca/eng/acts/C-46/section-465.html)\n* child abduction (non-parental),[section 280](https://laws-lois.justice.gc.ca/eng/acts/C-46/section-280.html)and[section 281](https://laws-lois.justice.gc.ca/eng/acts/C-46/section-281.html)\n* child pornography,[section 163.1](https://laws-lois.justice.gc.ca/eng/acts/C-46/section-163.1.html#docCont)\n* organized crime provisions,[section 467.1](https://laws-lois.justice.gc.ca/eng/acts/C-46/page-100.html#docCont)to[section 467.13](https://laws-lois.justice.gc.ca/eng/acts/C-46/page-101.html#docCont)\n\nPage details\n------------\n\n 2025-04-04",
  "sections": [
    {
      "heading": "Temporary resident permits (TRPs): Considerations specific to victims of trafficking in persons",
      "heading_path": [
        "Temporary resident permits (TRPs): Considerations specific to victims of trafficking in persons"
      ],
      "anchor": "#temporary-resident-permits-trps-considerations-specific-to-victims-of-trafficking-in-persons",
      "text": "Published Time: Thu, 12 Feb 2026 00:33:59 GMT\n\nTemporary resident permits (TRPs): Considerations specific to victims of trafficking in persons\n===============================================================================================\n\nThis section contains policy, procedures and guidance used by IRCC staff. It is posted on the department’s website as a courtesy to stakeholders.\n\nTo enhance existing in-Canada mechanisms for protecting foreign nationals who may be victims of human trafficking (also known as “victims of trafficking in persons”), the Minister of Immigration, Refugees and Citizenship issued[Ministerial Instructions](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/mandate/policies-operational-instructions-agreements/ministerial-instructions/other-goals/mi81.html)(MIs) regarding the issuance of temporary resident permits (TRPs) to out-of-status foreign national victims of human trafficking and their dependants that are in Canada. IRCC has further developed guidance to be used in assessing TRP applications from these potential victims.\n\nThe objective of the MIs and the following guidance is to provide protection to vulnerable out-of-status foreign nationals who are victims of human trafficking and their dependants in Canada, by regularizing their temporary status in Canada through the issuance of a temporary resident permit, when the officer is of the opinion that it is justified in the circumstances. Protection measures also relate to their eligibility to apply for a work and/or study permit, and their access to healthcare coverage through the Interim Federal Health Program for the duration of their temporary resident permit, when the victims are not already covered under another healthcare program or insurance.\n\nThe issuance of TRPs for victims of human trafficking falls under IRCC’s activities under the protection pillar of the Government of Canada’s[National Strategy to Combat Human Trafficking](https://www.publicsafety.gc.ca/cnt/rsrcs/pblctns/2019-ntnl-strtgy-hmnn-trffc/index-en.aspx).\n\nOn this page\n------------\n\n* [Criteria to assess whether an applicant is a victim of human trafficking](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/permits/considerations-specific-victims-human-trafficking.html#a1)\n* [Initial TRP (based on an in-depth assessment)](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/permits/considerations-specific-victims-human-trafficking.html#a2)\n* [Initial TRP (based on a preliminary assessment)](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/permits/considerations-specific-victims-human-trafficking.html#a3)\n* [Subsequent TRP](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/permits/considerations-specific-victims-human-trafficking.html#a4)\n* [Considerations](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/permits/considerations-specific-victims-human-trafficking.html#a5)\n* [Dependants](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/permits/considerations-specific-victims-human-trafficking.html#a6)\n* [Work and study permits](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/permits/considerations-specific-victims-human-trafficking.html#a7)\n* [Background information](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/permits/considerations-specific-victims-human-trafficking.html#sec4)\n\nCriteria to assess whether an applicant is a victim of human trafficking\n------------------------------------------------------------------------\n\nThe criteria used to assess whether the applicant is a victim of human trafficking should include indications that the recruitment, transfer or transport of the foreign national was fraudulent, deceptive or coerced (for example, intimidation, extortion, kidnapping), and meets either of the following criteria:\n\n1. The foreign national’s freedom was restricted; for instance: \n 1. by the exercise of control (for example, receipt, harbouring, holding, concealing, directing, influencing over their movements or debt bondage)\n 2. the use of force (for example, abduction, physical assault, sexual assault, confinement, restraint) \n 3. the threat of the use of force\n\n2. The foreign national was coerced into exploitative employment or other exploitative activities (for example, sexual exploitation, forced labour or services, slavery, organ removal).\n\n**Note:**The 1-year bar to access a TRP under[subsection A24(4)](https://laws-lois.justice.gc.ca/eng/acts/I-2.5/page-6.html#h-274473)does not prevent an officer from considering and issuing or refusing a TRP for a potential victim of human trafficking on their own initiative.\n\nInitial TRP (based on an in-depth assessment)\n---------------------------------------------\n\nWhen a foreign national first comes to the attention of IRCC, officers should attempt to conduct an in-depth analysis of the applicant’s situation. When an officer is able to do so, they should consider issuing a temporary resident permit for **at least 12 months**, if they have reasonable grounds to believe that the applicant **is** a victim of human trafficking.\n\nOfficers should adopt a 2-step decision-making process when assessing and considering whether to issue an initial TRP for victims of human trafficking. The 2-step decision-making process is as follows:\n\n1. Are there reasonable grounds to believe the individual **is** a victim of human trafficking?\n2. Is the issuance of a TRP for victims of human trafficking justified in the circumstances?"
    },
    {
      "heading": "Step 1",
      "heading_path": [
        "Temporary resident permits (TRPs): Considerations specific to victims of trafficking in persons",
        "Step 1"
      ],
      "anchor": "#step-1",
      "text": "The first step is to verify through an**in-depth assessment** of the circumstances that an individual **is** a victim of human trafficking, which includes an assessment of credibility. This determination is based on the [criteria](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/permits/considerations-specific-victims-human-trafficking.html#a1) listed above.\n\nShould the officer determine that there are **reasonable grounds to believe** that the foreign national **is** a victim of human trafficking, they should move to the second step of the decision-making process.\n\nFollowing the in-depth assessment, should the officer find no reasonable grounds to believe that the foreign national **is**a victim of human trafficking, they should refuse the application. If the application is refused, an officer may consider other available options, but should not proceed further with the application for a TRP for victims of human trafficking, as described in this PDI."
    },
    {
      "heading": "Step 2",
      "heading_path": [
        "Temporary resident permits (TRPs): Considerations specific to victims of trafficking in persons",
        "Step 1",
        "Step 2"
      ],
      "anchor": "#step-2",
      "text": "If an officer finds reasonable grounds to believe that the individual **is** a victim of human trafficking, the second step is for the officer to determine, at their discretion, whether a TRP for victims of human trafficking is warranted given the circumstances. Officers are justified in issuing an initial TRP for any of the following purposes:\n\n* to allow them to escape the influence of the traffickers\n* to provide them with a period of time to consider their options and help them make an informed decision on a future course of action \n* to allow them to recover from physical and/or mental trauma resulting from the exploitation and abuse they were exposed to (for example, counselling and/or medical treatment may be necessary)\n* for any other purpose an officer may find relevant to facilitate the protection of vulnerable foreign nationals who are victims of human trafficking in Canada\n\nInitial TRP (based on a preliminary assessment)\n-----------------------------------------------\n\nWhen a foreign national first comes to the attention of IRCC, it is not always possible for an officer to conduct an in-depth analysis to determine if an applicant is a victim of human trafficking, due to numerous factors, such as:\n\n* the complexity and urgency of the case\n* the trauma that a victim may have experienced or continues to experience\n* the victim is part of a group of individuals identified at the same time and interviewing each individual may not be operationally feasible.\n\nFor these reasons, officers may only be able to conduct a **preliminary assessment** that, based on the circumstances presented, there are reasonable grounds to believe that the individual **may****be** a victim of human trafficking. The temporary resident permit issued following such a preliminary assessment should be valid for a period of **up to 12 months.**\n\nOfficers should follow the 2-step decision-making process when assessing and considering whether to issue a short-term initial temporary resident permit for victims of human trafficking."
    },
    {
      "heading": "Step 1",
      "heading_path": [
        "Temporary resident permits (TRPs): Considerations specific to victims of trafficking in persons",
        "Step 1",
        "Step 1"
      ],
      "anchor": "#step-1",
      "text": "The first step is to verify through a**preliminary assessment** of the circumstances that there are reasonable grounds to believe that an individual **may be** a victim of human trafficking, which includes an assessment of credibility. This determination is based on the [criteria](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/permits/considerations-specific-victims-human-trafficking.html#a1) listed above.\n\nShould the officer determine that there are **reasonable grounds to believe** that the foreign national **may be** a victim of human trafficking, they should move to the second step of the decision-making process.\n\nShould the officer determine that there aren’t reasonable grounds to believe that the foreign national**may****be**a victim of human trafficking, they should refuse the application. If the application is refused, an officer may consider other available options and refer to the relevant PDIs for guidance on those options."
    },
    {
      "heading": "Step 2",
      "heading_path": [
        "Temporary resident permits (TRPs): Considerations specific to victims of trafficking in persons",
        "Step 1",
        "Step 2"
      ],
      "anchor": "#step-2",
      "text": "Officers are justified in issuing a short-term initial TRP, of **up to 12 months,** for any of the following purposes:\n\n* to allow them to escape the influence of the traffickers\n* to provide them with a period of time to consider their options and help them make an informed decision on a future course of action \n* to allow them to recover from physical and/or mental trauma resulting from the exploitation and abuse they were exposed to (for example, counselling and/or medical treatment may be necessary)\n* for any other purpose an officer may find relevant to facilitate the protection of vulnerable foreign nationals who are victims of human trafficking in Canada\n\nSubsequent TRP\n--------------\n\nUpon the submission of an application for a subsequent TRP for victims of human trafficking, an officer may issue a subsequent TRP for a duration of **up to 3 years** to an individual if they have determined, **based on an in-depth assessment**, that there are **reasonable grounds to believe** that the individual **is** a victim of human trafficking in persons, and that a subsequent TRP for victims of human trafficking should be issued.\n\nTo facilitate the decision-making process when assessing a subsequent TRP application, officers should adopt the following 2-step process."
    },
    {
      "heading": "Step 1",
      "heading_path": [
        "Temporary resident permits (TRPs): Considerations specific to victims of trafficking in persons",
        "Step 1",
        "Step 1"
      ],
      "anchor": "#step-1",
      "text": "Establish whether there are **reasonable grounds to believe** that the suspected victim **is** a victim of human trafficking (refer to the [criteria](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/permits/considerations-specific-victims-human-trafficking.html#a1)). A more complete verification of the facts, established through an interview with the applicant and in consultation with law enforcement, may be needed where appropriate.\n\nAgain, should the officer determine that there are **reasonable grounds to believe** that the foreign national **is** a victim of human trafficking, they should move to the second step of the decision-making process.\n\nIf an officer does not find reasonable grounds to believe that an individual is a victim of human trafficking, then a subsequent TRP should not be issued. If the application is refused, an officer may consider other available options, but should not proceed further with this PDI."
    },
    {
      "heading": "Step 2",
      "heading_path": [
        "Temporary resident permits (TRPs): Considerations specific to victims of trafficking in persons",
        "Step 1",
        "Step 2"
      ],
      "anchor": "#step-2",
      "text": "Officers will need to determine, at their discretion, whether a subsequent TRP should be issued given the circumstances, taking into consideration the purposes listed above.\n\nConsiderations\n--------------\n\nIt is important to note that the issuance of an initial TRP does not guarantee that the applicant will be issued a subsequent TRP.\n\n**Note:** Applicants are not required to provide a law enforcement endorsement or report to substantiate their application and may self-identify to IRCC as a victim of human trafficking. The absence of a law enforcement endorsement or report is **not** a valid reason to refuse an application.\n\nOfficers should take into account apparent risks when considering the circumstances of the victim; however, the goal of the assessment is not to duplicate the[pre-removal risk assessment (PRRA) process](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/refugee-protection/removal-risk-assessment.html).\n\n**Note:**Persons who have been trafficked to and inside Canada may have been kept in isolation from Canadian society, may be illiterate or unskilled, and may not have formed support networks that they want or are able to depend on to help them integrate into Canadian society. These circumstances should not weigh against affording them legal status.\n\n**Note:**It is important to note that the issuance of a TRP for victims of human trafficking is not intended to be a pathway to permanent residence, but to respond to the precarious situation of the vulnerable temporary resident.\n\nIf the person is suspected or determined to be a victim of human trafficking, officers may assist them in contacting organizations that provide assistance to trafficked persons, their foreign representative in Canada, non-governmental organizations (NGOs), or provincial and municipal agencies.\n\nIn certain instances, the individual may want to return to their country of citizenship or legal permanent residence. If the person is in the enforcement stream, Canada Border Services Agency (CBSA) is responsible for sending the person home; therefore, IRCC officers should contact the local CBSA office. If not in the enforcement stream, a referral should be made to the [United Nations High Commissioner for Refugees (UNHCR)](https://www.unhcr.ca/) or the victim’s foreign representative and/or embassy (if specifically requested).\n\nEnforcement cases involving potential victims of human trafficking should be referred to The Family and Social Immigration Branch (FSIB) for guidance. This includes potential victims who have an active warrant.\n\nFollowing the issuance of an initial TRP, if the applicant is from a visa-exempt country, their[electronic travel authorization (eTA) should be cancelled in the Global Case Management System (GCMS)](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/eta/manually-processing-electronic-travel-authorization-applications.html). If the applicant is from a visa-required country, and their visa was issued as a result of fraud or misrepresentation, please refer to the following procedures to cancel their visa:[Temporary residents: Cancellation of a temporary resident visa](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/visitors/cancellation-visa.html). FSIB should be contacted if there are questions or concerns about cancelling travel documents.\n\nIf the person chooses to file a refugee claim, refer to[In-Canada claims for refugee protection](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/refugee-protection/canada.html).\n\nDependants\n----------\n\nDependants of victims of human trafficking who are in Canada without status are eligible for a TRP for victims of human trafficking (for dependants), an open work permit and study permit that are fee-exempt, and IFHP coverage .\n\nWork and study permits\n----------------------\n\nA TRP valid for a minimum of 180 days makes the holder eligible to apply for a work and study permit. A TRP does not exempt the permit holder from the requirement to apply for a work and/or study permit if they wish to work and/or study in Canada. If the victim of human trafficking wants to apply for a work and/or study permit, the application should be processed by the IRCC processing office at the same time as the TRP application for victims of human trafficking, and not be directed to the Case Processing Centre in Edmonton (CPC-E).\n\nAny applications received at CPC-E and submitted by TRP for victims of human trafficking holders should be referred to the processing office that issued the TRP. They should not be processed by CPC-E.\n\nTRP for victims of human trafficking holders are also not eligible to apply for a temporary resident visa (TRV) from within Canada if their TRP is not authorized for re-entry."
    },
    {
      "heading": "Interviewing",
      "heading_path": [
        "Temporary resident permits (TRPs): Considerations specific to victims of trafficking in persons",
        "Step 1",
        "Interviewing"
      ],
      "anchor": "#interviewing",
      "text": "Officers must be sensitive to the personal situation of a suspected victim of human trafficking as they may be experiencing psychological and/or physical trauma. They may also require the assistance of an interpreter.\n\nThe objectives of conducting an interview are to\n\n* establish the facts of the case\n* verify that the individual may be, is or was a victim of human trafficking, and establish credibility\n* use the facts to determine the best course of action for developing an immediate or long term response\n\nFor the purpose of assessing a TRP for victims of human trafficking application, IRCC has the sole authority to determine if\n\n* there are reasonable grounds to believe that the applicant is or may be a victim of human trafficking\n* a TRP for victims of human trafficking is justified given the circumstances\n\nIf the victim is referred to IRCC by a law enforcement agency, that agency can assist with the preliminary assessment of the circumstances to verify whether an individual may be a victim of human trafficking. However, the final decision as to whether or not a TRP should be issued rests with IRCC.\n\nIf the potential victim is referred by an NGO, and if CBSA or the Royal Canadian Mounted Police (RCMP) have not already been consulted, consultations may occur provided the disclosure of information is permitted by the potential victim.\n\nIf a removal order has been issued against a potential victim of human trafficking by the CBSA, FSIB should be contacted immediately regardless of whether the client has a TRP for victims of human trafficking application in the system or not.\n\nIn reaching a decision, officers should keep in mind that the objective of these guidelines is to respond to the vulnerable situation of victims of human trafficking by providing them with a means of regularizing their temporary resident status in Canada, when the officer is of the opinion that it is justified in the circumstances.\n\nFor information on dealing with trafficked children, consult[ENF 21 – Recovering Missing, Abducted and Exploited Children (PDF, 285 KB)](https://www.canada.ca/content/dam/ircc/migration/ircc/english/resources/manuals/enf/enf21-eng.pdf). Officers should be mindful of the rights of the child, and should contact provincial services for assistance.\n\nFor more detailed information regarding the interview, see[Interview guidelines](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/permits/considerations-specific-victims-human-trafficking.html#int-guide)."
    },
    {
      "heading": "Where an application is processed",
      "heading_path": [
        "Temporary resident permits (TRPs): Considerations specific to victims of trafficking in persons",
        "Step 1",
        "Where an application is processed"
      ],
      "anchor": "#where-an-application-is-processed",
      "text": "Due to the urgent nature of these cases and the vulnerability of the clients, TRP for victims of human trafficking applications are processed as a priority by Humanitarian and Identity Operations Branch (HIOB’s) Vulnerable Persons Unit (VPU). These individuals may, for instance:\n\n* be in Canada without status\n* lack travel and identity documents\n* be living in a shelter or with their trafficker\n\nThese applications must**not**be directed to CPC-E. If these cases are identified at a case processing centre, efforts should be made to transfer the application to the VPU as expeditiously as possible.\n\nApplications for subsequent TRPs for victims of human trafficking must also be submitted to and processed by the VPU.\n\nThe VPU can be contacted by mail at:\n\nIRCC – Vulnerable Persons Unit\n\n5343 Dundas Street West, Suite 105\n\nToronto ON M9B 6K5"
    },
    {
      "heading": "Public policy – Fees",
      "heading_path": [
        "Temporary resident permits (TRPs): Considerations specific to victims of trafficking in persons",
        "Step 1",
        "Public policy – Fees"
      ],
      "anchor": "#public-policy-fees",
      "text": "A public policy is in effect to exempt the payment of application fees for the initial and subsequent TRPs for victims of human trafficking, open work permit, study permit and biometrics fees."
    },
    {
      "heading": "Cost recovery",
      "heading_path": [
        "Temporary resident permits (TRPs): Considerations specific to victims of trafficking in persons",
        "Step 1",
        "Cost recovery"
      ],
      "anchor": "#cost-recovery",
      "text": "The open work permit privilege fee does not apply to work permits issued with a TRP under paragraph R208(b) and should not be charged.\n\nFor fee purposes, the TRP should be coded as M26 in[GCMS](https://gcms-smgc.apps.ci.gc.ca/), the work permit should be coded as E12 and the study permit coded as 999."
    },
    {
      "heading": "Other measures available",
      "heading_path": [
        "Temporary resident permits (TRPs): Considerations specific to victims of trafficking in persons",
        "Step 1",
        "Other measures available"
      ],
      "anchor": "#other-measures-available",
      "text": "Foreign nationals who are victims of human trafficking may avail themselves of a number of other legislative and administrative measures in order to remain in Canada temporarily or permanently. These include refugee protection claims, applications for permanent residence under humanitarian and compassionate (H&C) considerations, and pre-removal risk assessments. The individual should be made aware of these options by the officer responsible for processing their case.\n\n**Note: Requesting consideration of a regular TRP**\n\nShould an applicant request that an officer consider the issuance of a regular TRP if the TRP for victims of human trafficking is going to be refused, the officer should\n\n* request payment of the TRP fee from the applicant\n* refer the application to the general TRP queue (and placed in the queue based on the original date received)"
    },
    {
      "heading": "Collection of biometrics",
      "heading_path": [
        "Temporary resident permits (TRPs): Considerations specific to victims of trafficking in persons",
        "Step 1",
        "Collection of biometrics"
      ],
      "anchor": "#collection-of-biometrics",
      "text": "As outlined in the public policy concerning the payment of application fees for victims of human trafficking, applicants and their dependents are fee-exempt for the provision of services in relation to the collection of biometrics information.\n\nUpon receipt of an application under these MIs, an officer will verify if valid biometrics results exist for the applicant and, if not, they will send a BIL letter to the applicant. Fee exemption code B12 should be used for the biometrics (if no valid biometrics results already exist).\n\nBackground information\n----------------------"
    },
    {
      "heading": "Methods used by traffickers",
      "heading_path": [
        "Temporary resident permits (TRPs): Considerations specific to victims of trafficking in persons",
        "Step 1",
        "Methods used by traffickers"
      ],
      "anchor": "#methods-used-by-traffickers",
      "text": "Traffickers use a variety of methods to control their victims, which include but are not limited to\n\n* confiscation of their identification documents (including passports and travel documents)\n* monitoring and surveillance\n* restraint\n* sexual assault\n* violence or threats of violence against them or their family members\n\nHuman trafficking may occur across or within borders, often involves extensive organized criminal networks, and violates the basic human rights of its victims.\n\nVictims of human trafficking may enter Canada illegally or legally. For example, victims may\n\n* be smuggled into Canada in a clandestine manner\n* enter legitimately, with an approved electronic travel authorization (eTA) or temporary resident visa (TRV)\n* enter legally but let their status expire\n\nTraffickers may use deception or false documents to fraudulently obtain visas or assist victims to be admitted at a port of entry. Victims of human trafficking may or may not be aware that they have entered Canada illegally. In certain cases, persons who enter Canada as legitimate visitors are subsequently exploited by traffickers.\n\nIdentifying victims of human trafficking who are in transit can be difficult. Exploitation may not yet have occurred, and potential victims would be unaware of the traffickers’ true intent. At this stage, victims may view traffickers as assisting, rather than exploiting them."
    },
    {
      "heading": "Impact of trafficking on victims",
      "heading_path": [
        "Temporary resident permits (TRPs): Considerations specific to victims of trafficking in persons",
        "Step 1",
        "Impact of trafficking on victims"
      ],
      "anchor": "#impact-of-trafficking-on-victims",
      "text": "Human trafficking results in a number of direct and indirect harmful consequences to its victims. Victims of human trafficking may be physically and/or sexually assaulted, confined, restrained and/or subjected to psychological abuse. Fear for their own personal safety, and for the safety of their loved ones, can cause additional emotional trauma and stress. Victims of human trafficking may also experience shame, low self-esteem and a sense of powerlessness. Many victims of human trafficking suffer from post-traumatic stress disorder, and they may fear or mistrust authorities."
    },
    {
      "heading": "Smuggling versus trafficking",
      "heading_path": [
        "Temporary resident permits (TRPs): Considerations specific to victims of trafficking in persons",
        "Step 1",
        "Smuggling versus trafficking"
      ],
      "anchor": "#smuggling-versus-trafficking",
      "text": "Human trafficking is often confused with migrant smuggling; however, it is important to be able to distinguish between the two."
    },
    {
      "heading": "Migrant smuggling",
      "heading_path": [
        "Temporary resident permits (TRPs): Considerations specific to victims of trafficking in persons",
        "Step 1",
        "Smuggling versus trafficking",
        "Migrant smuggling"
      ],
      "anchor": "#migrant-smuggling",
      "text": "* Occurs with the consent of the smuggled person.\n* Smuggled persons are generally free to go once they arrive in the country of final destination, where they usually have no further contact with the smuggler."
    },
    {
      "heading": "Human trafficking",
      "heading_path": [
        "Temporary resident permits (TRPs): Considerations specific to victims of trafficking in persons",
        "Step 1",
        "Smuggling versus trafficking",
        "Human trafficking"
      ],
      "anchor": "#human-trafficking",
      "text": "* Involves the use of threats, force, fraud or other forms of coercion.\n* Victims of human trafficking are not at liberty in their final destination. They are exploited for the labour or services they can provide."
    },
    {
      "heading": "Similarities between the two",
      "heading_path": [
        "Temporary resident permits (TRPs): Considerations specific to victims of trafficking in persons",
        "Step 1",
        "Smuggling versus trafficking",
        "Similarities between the two"
      ],
      "anchor": "#similarities-between-the-two",
      "text": "Both migrant smuggling and human trafficking may present similarities and are often only distinguished after further investigation. Smuggled persons may become victims of human trafficking at any point in the smuggling process. Some may consent, for example, to being smuggled across a border, but find on arrival in the country of destination that debt bondage, or other forms of coercion, have been imposed. If this occurs, they become victims of human trafficking, regardless of whether they consented to being smuggled in the first place."
    },
    {
      "heading": "Interview guidelines",
      "heading_path": [
        "Temporary resident permits (TRPs): Considerations specific to victims of trafficking in persons",
        "Step 1",
        "Interview guidelines"
      ],
      "anchor": "#interview-guidelines",
      "text": "These interview guidelines and suggestions have been developed by the International Organization for Migration (IOM). While the intention is to be as facilitative as possible, it is at the discretion of the officer administering the interview to allow the suspected victim’s legal representative or any NGO representative to sit in on the interview with the suspected victim. Should an officer refuse a request from a representative to attend the interview, they should document in detail as to the reason why in GCMS."
    },
    {
      "heading": "Duty of the interviewer",
      "heading_path": [
        "Temporary resident permits (TRPs): Considerations specific to victims of trafficking in persons",
        "Step 1",
        "Interview guidelines",
        "Duty of the interviewer"
      ],
      "anchor": "#duty-of-the-interviewer",
      "text": "* inform the victim that the purpose of the interview is to assist the person\n* treat the victim-witness sensitively, with empathy and with full respect of their human rights\n* adhere to the “Do no harm” principle\n* create optimum conditions to minimize the stress of the interview\n* put no undue pressure on the victim to make a statement\n* provide the victim with a fair opportunity to tell the story\n* be sensitive to any gender issues, such as the victim and interviewer being the same gender."
    },
    {
      "heading": "Interview style",
      "heading_path": [
        "Temporary resident permits (TRPs): Considerations specific to victims of trafficking in persons",
        "Step 1",
        "Interview guidelines",
        "Interview style"
      ],
      "anchor": "#interview-style",
      "text": "Courteous, respectful, sensitive and aware of the issues.\n\n* avoid an authoritarian approach\n* avoid over-familiarity, through eye contact or body language\n* ask simple questions\n* be encouraging\n* listen actively\n* allow free speech and avoid interruption\n* be aware that some questions may seek to recall painful events\n* the victim may need to take a break at any time.\n\nThe critical concepts to be detected in the interview are those of exploitation and loss of or limitations on liberty.\n\nTypical interview questions might include, but are not limited to the following."
    },
    {
      "heading": "Recruitment and documentation",
      "heading_path": [
        "Temporary resident permits (TRPs): Considerations specific to victims of trafficking in persons",
        "Step 1",
        "Interview guidelines",
        "Recruitment and documentation"
      ],
      "anchor": "#recruitment-and-documentation",
      "text": "* How did you get to Canada?\n* Did anyone help you enter Canada?\n* What did you think you were coming to Canada to do?\n* How did you obtain the documentation used to enter Canada (if person entered Canada with documentation)?"
    },
    {
      "heading": "Employment and coercion",
      "heading_path": [
        "Temporary resident permits (TRPs): Considerations specific to victims of trafficking in persons",
        "Step 1",
        "Interview guidelines",
        "Employment and coercion"
      ],
      "anchor": "#employment-and-coercion",
      "text": "* What did you come to Canada to do?\n* What sort of work did you actually perform, once you arrived in Canada?\n* Were you paid for your services? How much?\n* Did your employer(s) say that you owed them anything? What for?\n* Did you have to pay any of your earnings toward a debt?\n* Were you allowed to keep any/all of your earnings?\n* Do you believe that you still owe your employers anything?"
    },
    {
      "heading": "Working conditions (exploitation)",
      "heading_path": [
        "Temporary resident permits (TRPs): Considerations specific to victims of trafficking in persons",
        "Step 1",
        "Interview guidelines",
        "Working conditions (exploitation)"
      ],
      "anchor": "#working-conditions-exploitation",
      "text": "* Did you and your employer have a written document setting out your respective entitlements and obligations? Do you have it?\n* How many hours a day did you work?\n* Were you allowed any time off?\n* Were you permitted time off if you were sick?"
    },
    {
      "heading": "Restriction on liberty and the use of force",
      "heading_path": [
        "Temporary resident permits (TRPs): Considerations specific to victims of trafficking in persons",
        "Step 1",
        "Interview guidelines",
        "Restriction on liberty and the use of force"
      ],
      "anchor": "#restriction-on-liberty-and-the-use-of-force",
      "text": "* Were you allowed to communicate with family members?\n* Did you live and work at the same place? If so, were you permitted to leave the premises as you wished?\n* Did anyone accompany you if you did leave?\n* Were threats made to you, your family members or others close to you?\n* What happened to your identification documents after you arrived?\n* Were you able to leave your job and seek another one, if you so wished?\n* What did you believe would happen if you attempted to leave?"
    },
    {
      "heading": "Trafficking provisions under IRPA and the Criminal Code",
      "heading_path": [
        "Temporary resident permits (TRPs): Considerations specific to victims of trafficking in persons",
        "Step 1",
        "Trafficking provisions under IRPA and the Criminal Code"
      ],
      "anchor": "#trafficking-provisions-under-irpa-and-the-criminal-code",
      "text": "Sections[A118](https://laws-lois.justice.gc.ca/eng/acts/i-2.5/section-118.html),[A120](https://laws-lois.justice.gc.ca/eng/acts/i-2.5/section-120.html)and[A121](https://laws-lois.justice.gc.ca/eng/acts/i-2.5/section-121.html)establish a specific human trafficking offence and provide for stiff penalties for trafficking persons into Canada.\n\n[Sections 279.01, 279.02, 279.03 and 279.04](https://laws-lois.justice.gc.ca/eng/acts/C-46/page-63.html#docCont)of the Criminal Code set out human trafficking offence and punishments.\n\nSeveral other Criminal Code offences have also been used to address human trafficking cases, including\n\n* kidnapping,[subsections 279(1) and (1.1)](https://laws-lois.justice.gc.ca/eng/acts/C-46/section-279.html)\n* forcible confinement,[subsection 279(2)](https://laws-lois.justice.gc.ca/eng/acts/C-46/section-279.html)\n* extortion,[subsection 346(1)](https://laws-lois.justice.gc.ca/eng/acts/C-46/section-346.html)\n* intimidation,[section 423](https://laws-lois.justice.gc.ca/eng/acts/C-46/section-423.html)\n* assault,[section 265](https://laws-lois.justice.gc.ca/eng/acts/C-46/section-265.html)to[section 268](https://laws-lois.justice.gc.ca/eng/acts/C-46/section-268.html)\n* causing death or bodily harm by criminal negligence,[section 220](https://laws-lois.justice.gc.ca/eng/acts/C-46/section-220.html)and[section 221](https://laws-lois.justice.gc.ca/eng/acts/C-46/section-221.html)\n* homicide,[section 222](https://laws-lois.justice.gc.ca/eng/acts/C-46/section-222.html)to[section 228](https://laws-lois.justice.gc.ca/eng/acts/C-46/section-228.html)\n* sexual assault,[section 271](https://laws-lois.justice.gc.ca/eng/acts/C-46/section-271.html)to[section 273](https://laws-lois.justice.gc.ca/eng/acts/C-46/section-273.html)\n* uttering threats,[subsection 264.1(1)](https://laws-lois.justice.gc.ca/eng/acts/C-46/section-264.1.html)\n* conspiracy,[section 465](https://laws-lois.justice.gc.ca/eng/acts/C-46/section-465.html)\n* child abduction (non-parental),[section 280](https://laws-lois.justice.gc.ca/eng/acts/C-46/section-280.html)and[section 281](https://laws-lois.justice.gc.ca/eng/acts/C-46/section-281.html)\n* child pornography,[section 163.1](https://laws-lois.justice.gc.ca/eng/acts/C-46/section-163.1.html#docCont)\n* organized crime provisions,[section 467.1](https://laws-lois.justice.gc.ca/eng/acts/C-46/page-100.html#docCont)to[section 467.13](https://laws-lois.justice.gc.ca/eng/acts/C-46/page-101.html#docCont)\n\nPage details\n------------\n\n 2025-04-04"
    }
  ],
  "links": {
    "outbound": [
      "https://www.canada.ca/en/immigration-refugees-citizenship/corporate/mandate/policies-operational-instructions-agreements/ministerial-instructions/other-goals/mi81.html",
      "https://www.publicsafety.gc.ca/cnt/rsrcs/pblctns/2019-ntnl-strtgy-hmnn-trffc/index-en.aspx",
      "https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/permits/considerations-specific-victims-human-trafficking.html",
      "https://laws-lois.justice.gc.ca/eng/acts/I-2.5/page-6.html",
      "https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/refugee-protection/removal-risk-assessment.html",
      "https://www.unhcr.ca/",
      "https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/eta/manually-processing-electronic-travel-authorization-applications.html",
      "https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/visitors/cancellation-visa.html",
      "https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/refugee-protection/canada.html",
      "https://www.canada.ca/content/dam/ircc/migration/ircc/english/resources/manuals/enf/enf21-eng.pdf",
      "https://gcms-smgc.apps.ci.gc.ca/",
      "https://laws-lois.justice.gc.ca/eng/acts/i-2.5/section-118.html",
      "https://laws-lois.justice.gc.ca/eng/acts/i-2.5/section-120.html",
      "https://laws-lois.justice.gc.ca/eng/acts/i-2.5/section-121.html",
      "https://laws-lois.justice.gc.ca/eng/acts/C-46/page-63.html",
      "https://laws-lois.justice.gc.ca/eng/acts/C-46/section-279.html",
      "https://laws-lois.justice.gc.ca/eng/acts/C-46/section-346.html",
      "https://laws-lois.justice.gc.ca/eng/acts/C-46/section-423.html",
      "https://laws-lois.justice.gc.ca/eng/acts/C-46/section-265.html",
      "https://laws-lois.justice.gc.ca/eng/acts/C-46/section-268.html",
      "https://laws-lois.justice.gc.ca/eng/acts/C-46/section-220.html",
      "https://laws-lois.justice.gc.ca/eng/acts/C-46/section-221.html",
      "https://laws-lois.justice.gc.ca/eng/acts/C-46/section-222.html",
      "https://laws-lois.justice.gc.ca/eng/acts/C-46/section-228.html",
      "https://laws-lois.justice.gc.ca/eng/acts/C-46/section-271.html",
      "https://laws-lois.justice.gc.ca/eng/acts/C-46/section-273.html",
      "https://laws-lois.justice.gc.ca/eng/acts/C-46/section-264.1.html",
      "https://laws-lois.justice.gc.ca/eng/acts/C-46/section-465.html",
      "https://laws-lois.justice.gc.ca/eng/acts/C-46/section-280.html",
      "https://laws-lois.justice.gc.ca/eng/acts/C-46/section-281.html",
      "https://laws-lois.justice.gc.ca/eng/acts/C-46/section-163.1.html",
      "https://laws-lois.justice.gc.ca/eng/acts/C-46/page-100.html",
      "https://laws-lois.justice.gc.ca/eng/acts/C-46/page-101.html"
    ],
    "internal_children": []
  },
  "quality": {
    "is_toc_like": false,
    "is_low_text": false,
    "notes": []
  }
}