{
  "source_id": "pdi_3123f54f8a64",
  "source_type": "guidance_pdi",
  "source_url": "https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/foreign-workers/quebec-cases/csq-outside-quebec.html",
  "canonical_url": "https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/foreign-workers/quebec-cases/csq-outside-quebec.html",
  "title": "Quebec Selection Certificate (CSQ) holders currently outside Quebec [R205(a) – A76] – International Mobility Program",
  "language": "en",
  "manual": "Quebec Selection Certificate (CSQ) holders currently outside Quebec [R205(a) – A76] – International Mobility Program",
  "chapter": null,
  "heading_path": [
    "Quebec Selection Certificate (CSQ) holders currently outside Quebec [R205(a) – A76] – International Mobility Program"
  ],
  "last_updated": "2025-07-16",
  "crawl_ts": "2026-02-12T00:00:00Z",
  "http": {
    "status_code": 200,
    "content_type": "text/markdown"
  },
  "content_hash": "a3b78ae760d7d4bac9a97474d5a096640c69d787a3f669bd40dd0192de979c59",
  "raw_html_path": null,
  "markdown_path": "scripts/scraper/ircc_data_clean/csq-outside-quebec-3123f54f8a.md",
  "text": "Published Time: Thu, 12 Feb 2026 00:03:40 GMT\n\nQuebec Selection Certificate (CSQ) holders currently outside Quebec [R205(a) – A76] – International Mobility Program\n====================================================================================================================\n\nEffective January 16, 2025, the Ministère de l’Immigration, de la Francisation et de l’Intégration (MIFI) ceased sending a letter of invitation to CSQ holders currently outside Quebec in order to apply for a work permit under the administrative code A76.\n\nOfficers will continue to process all work permit applications submitted under this category where the letters of invitation issued by MIFI are dated up to January 15, 2025. Clients have 90 days to submit the work permit application after receiving a letter from MIFI.\n\nThe relevant [client instructions](https://www.canada.ca/en/immigration-refugees-citizenship/services/immigrate-canada/quebec-skilled-workers/international-mobility-program-plus-csq.html) have been updated accordingly.\n\nThese instructions apply to IRCC employees. Since applicants cannot submit their applications at a port of entry, the instructions do not apply to border services officers.\n\nThe instructions on this page should be reviewed in conjunction with\n\n* [Open work permit – General processing and issuance](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/foreign-workers/eligibility/open.html)\n* [Conditions and validity period on work permits](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/foreign-workers/eligibility/eligibility-admissibility-conditions-including-validity-period.html)\n\nUnder the International Mobility Program (IMP), administrative codes are used to identify different work that the department has determined may create significant social, cultural or economic benefits, or opportunities for Canadian citizens or permanent residents, as described in [subsection 205(a)](https://laws-lois.justice.gc.ca/eng/regulations/SOR-2002-227/section-205.html) of the Immigration and Refugee Protection Regulations (IRPR). IRCC establishes eligibility criteria and a specific administrative code for these situations under subsection R205(a). Officers must also always be satisfied that all requirements of [section R200](https://laws-lois.justice.gc.ca/eng/regulations/SOR-2002-227/section-200.html) are met before a work permit may be issued.\n\nAdministrative code A76 is the code for the IMP work permit category that describes the work of certain foreign nationals who are **currently residing outside Quebec** and hold a valid Quebec Selection Certificate (CSQ), and who may create significant social and cultural benefit for Quebec and Canada. This category was created through an agreement between the Minister of IRCC and Quebec’s ministère de l’Immigration, de la Francisation et de l’Intégration (MIFI).\n\n**Note:** The applicant must have obtained a CSQ as a skilled worker. They can apply for this work permit before or after submitting an application for permanent residence to IRCC.\n\nThis IMP work permit category was announced as part of IMP+.\n\nOn this page\n------------\n\n* [Background](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/foreign-workers/quebec-cases/csq-outside-quebec.html#background)\n* [Eligibility requirements](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/foreign-workers/quebec-cases/csq-outside-quebec.html#eligibility)\n* [Documentary evidence](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/foreign-workers/quebec-cases/csq-outside-quebec.html#evidence)\n* [Application assessment](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/foreign-workers/quebec-cases/csq-outside-quebec.html#assessment)\n * [Processing cap](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/foreign-workers/quebec-cases/csq-outside-quebec.html#cap)\n * [Cancellation of applications exceeding the cap](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/foreign-workers/quebec-cases/csq-outside-quebec.html#cancellation)\n * [Receipt of open work permit applications](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/foreign-workers/quebec-cases/csq-outside-quebec.html#owp)\n\n* [Final decision](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/foreign-workers/quebec-cases/csq-outside-quebec.html#decision)\n * [Approval](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/foreign-workers/quebec-cases/csq-outside-quebec.html#approval)\n * [Refusal](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/foreign-workers/quebec-cases/csq-outside-quebec.html#refusal)\n\n* [Extensions](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/foreign-workers/quebec-cases/csq-outside-quebec.html#extensions)\n* [Open work permits for family members](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/foreign-workers/quebec-cases/csq-outside-quebec.html#permits)\n* [Previous updates](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/foreign-workers/quebec-cases/csq-outside-quebec.html#updates)\n\nBackground\n----------\n\nOn May 24, 2022, [ministerial instructions regarding the processing of applications under the Quebec International Mobility Program Plus](https://canadagazette.gc.ca/rp-pr/p1/2022/2022-05-21/html/notice-avis-eng.html#n11) (Quebec IMP+) were issued. Foreign nationals selected by Quebec who **are currently overseas or reside in a province other than Quebec**, but intend to reside and work in Quebec, may be eligible for an open work permit.\n\nEligibility requirements\n------------------------\n\n* To be eligible for a labour market impact assessment–exempt (LMIA-exempt) work permit issued under subsection R205(a) and administrative code A76 as the holder of a CSQ, a foreign national must\n* have submitted their open work permit application online through an IRCC Secure Account (MyCIC account) \n * for outside of Canada applicants – refer to the [ministerial instructions](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/mandate/policies-operational-instructions-agreements/ministerial-instructions/other-goals/mi62.html) on the submission of online applications for temporary resident visas and other documents due to reduced processing capacity during the COVID–19 (coronavirus) pandemic for overseas applicants\n * for in-Canada applicants – refer to [programs exempt from the in-Canada mandatory electronic application (e-application) requirement for temporary residents](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/visitors/place-application-visa-electronic-travel-authorization-study-permit-work-permit/exempt-electronic-applications.html)\n * Applicants who can use the paper option must write **“International Mobility Program Plus – A76 cap”** on the envelope.\n\n* at the time their application under this category is received, be residing either \n * outside Canada or\n * in Canada and in any province or territory other than Quebec \n\n* intend to work and reside in Quebec\n* have a **CSQ** at the time of submission of their work permit application under this exemption and be in 1 of the following situations: \n * the CSQ is valid **if they have not yet submitted their permanent residence application or**\n * if an application for permanent residence has been submitted, it must have been submitted before the expiry of the CSQ and still be in progress \n * CSQs are valid for a 24-month period or until IRCC renders a decision on the permanent residence application.\n * Since August 2, 2018, MIFI no longer renews CSQs, as they are issued for 24 months and are **valid for the duration** of the permanent residence application, even if the 24-month period has passed.\n\n* have a letter of invitation to submit a work permit application under IMP administrative code A76 (the letter is available internally and in French only) from the province of Quebec\n\nApplicants who are in Canada and residing in a province or territory other than Quebec at the time of submission must\n\n* have valid temporary resident status, or be eligible for restoration of status as a temporary resident\n* be eligible to apply for a work permit from within Canada ([section R199](https://laws-lois.justice.gc.ca/eng/regulations/SOR-2002-227/section-199.html) or an active public policy)\n\nThe following foreign nationals are **not** eligible under this exemption category:\n\n* CSQ holders who reside in Quebec at the time of submission of the work permit application \n * Consult the Comparison table of categories that are available under the International Mobility Program for Quebec Selection Certificate (CSQ) holders (PDF).\n\n* foreign nationals who make their application at the port of entry\n* foreign nationals who have an open work permit as a [refugee claimant or under an enforceable removal order](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/foreign-workers/applicants-no-other-means-support-r206.html)\n * The work permit under R206 **does not confer temporary resident status as per section 202 of the IRPR**.\n\nDocumentary evidence\n--------------------\n\nThe following documents are required from all applicants:\n\n* a CSQ as described under [Eligibility requirements](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/foreign-workers/quebec-cases/csq-outside-quebec.html#eligibility)\n* a letter of invitation to submit a work permit application from the Government of Quebec\n* documents demonstrating their intent to reside in Quebec\n\nAlthough the submission of the application for permanent residence is not mandatory, if the applicant has submitted an application for permanent residence to IRCC under 1 of Quebec’s economic immigration streams they must provide 1 of the following documents:\n\n* proof of the application submission such as an email confirmation (with an X number)\n* an acknowledgment of receipt letter (with an E number) or\n* an approval in principle letter\n\nThe following documents are required from in-Canada applicants:\n\n* proof of residency outside Quebec \n * This may include copies of lease agreements or the most recent notice of assessment from the Canada Revenue Agency.\n\nThe applicant must submit this proof using the “Client Information” slot in the electronic application.\n\nApplication assessment\n----------------------\n\n### Significant benefit assessment\n\nTo determine if the applicant has met the eligibility requirements of this category under paragraph R205(a), the applicant must fall within the processing cap and meet all other eligibility requirements under category A76.\n\n### Processing cap\n\nAs set out in the [ministerial instructions](https://canadagazette.gc.ca/rp-pr/p1/2022/2022-05-21/html/notice-avis-eng.html) for this work permit category, a maximum of 7,350 work permit applications are to be accepted for intake each year beginning in 2023 (calendar year).\n\nFor clarity, all applications submitted under this LMIA-exemption administrative code A76 will be counted against the cap, regardless of whether approved, refused or withdrawn.\n\n* The Operations Planning and Performance Branch (OPPB) is responsible for reporting to the Immigration Program Guidance Branch (IPG) on a weekly basis on the number of work permit applications submitted, approved, refused or withdrawn under LMIA-exemption code A76. All complete applications received within the intake cap will be processed.\n* Online applications received outside the intake cap will be disposed (cancelled) and paper applications received outside the intake cap will be returned for not meeting the requirement of the stream. The work permit processing fee and the open work permit holder fee will be refunded.\n* MIFI is responsible for monitoring the number of letters of invitation that are issued to CSQ holders outside Quebec.\n* MIFI will share reports on the number of letters of invitation issued, and IRCC will share the number of work permit applications received, approved, issued, refused or withdrawn on a quarterly basis.\n\n### Cancellation of applications exceeding the cap\n\nOnce the cap of 7,350 work permit applications is reached, IPG will inform the integrated networks and a public notice will be issued on IRCC’s website.\n\nFor online applications, where the biometric fee is paid with the application, the biometric instruction letter (BIL) is issued automatically 24 hours from the date of receipt of the application. The Centralized Network will query for over-the-cap applications on a daily basis and take the following steps:\n\n* **Cancel** the BIL in bulk for applications received over the cap before they are automatically sent.\n* Assign an ORG ID to the application based on the office responsible for processing the application.\n\nThe following steps should be taken by the processing office for applications received over the cap:\n\n* Monitor the ORG ID for new associated applications.\n* Add the exemption code A76.\n* Administratively cancel open applications under this category.\n* Issue a refund for the processing **and** open work permit holder fees.\n\n### Receipt of open work permit applications\n\nApplications submitted by applicants who used the [Application For Work Permit Made Outside of Canada [IMM 1295] (PDF, 589 KB)](https://www.canada.ca/content/dam/ircc/migration/ircc/english/pdf/kits/forms/imm1295e.pdf) application form will be processed by the relevant migration office.\n\nApplications submitted by applicants who used the [Application to Change Conditions or Extend Your Stay in Canada [IMM 5710] (PDF, 600 KB)](https://www.canada.ca/content/dam/ircc/migration/ircc/english/pdf/kits/forms/imm5710e.pdf) application form, and who are residing in Canada but outside Quebec at the time of submission, will be processed by the Centralized Network.\n\n**Important:** Not all mandatory documents are requested in the online document checklist. Applicants are given instructions on the IRCC website on how to identify themselves under the IMP+ stream and where to upload the supporting documentation when they apply online.\n\nOfficers should note that applicants are given specific instructions on how to complete the IMM 1295 and IMM 5710 application forms. These instructions can be found at [International Mobility Program Plus: Open work permits for Quebec Selection Certificate holders outside Quebec](https://www.canada.ca/en/immigration-refugees-citizenship/services/immigrate-canada/quebec-skilled-workers/international-mobility-program-plus-csq.html).\n\nApplicants are instructed to input the following in the “Details of intended work in Canada” section:\n\nBox 1: What type of work permit are you applying for?\n\nSelect “Open Work Permit”.\n\nBox 4: “Job title” and “Brief description of duties”\n\nEnter “**CSQ holder outside Quebec – OWP**” in the “Job title” box.\n\nEnter **A76: International Mobility Program Plus** in the “Brief description of duties” box.\n\nOfficers should be aware that\n\n* the “Job title” box on the IMM 1295 and IMM 5710 forms maps to the “Intended occupation” field in GCMS\n* the “Brief description of duties” box maps to a case note in GCMS\n\nFinal decision\n--------------\n\n### Approval\n\nThe work permit will be issued under the authority of paragraph R205(a).\n\nIn the Global Case Management System (GCMS), on the Application screen, officers should enter the information below in the specified fields:\n\n| Field | Selection or Input |\n| --- | --- |\n| Case Type | 27 |\n| Exemption Code | A76 |\n| Province of Destination | Quebec |\n| City of Destination | Quebec NES (not elsewhere stated) |\n| NOC | 99999 |\n| Intended Occupation | Open |\n| Employer | Open |\n| Valid to | 36 months from the date of issue or until the applicant’s passport expires, whichever comes first. |\n| Conditions – Medical | If no medical examination was completed, see [Medical conditions to be imposed for open employer but occupation-restricted work permits](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/foreign-workers/eligibility/open.html#conditions-restricted) |\n| Conditions | Officers should ensure that the instructions provided in [Work permit issuance in GCMS: Occupation or location restricted](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/foreign-workers/eligibility/open.html#issuance-restricted) are followed. The following location condition **must be** imposed: Not authorized to work in any location other than stated. |\n| User note (**mandatory**) | CSQ holders – A76 |\n\n### Refusal\n\nWhen officers are not satisfied that the specific eligibility factors for this administrative code are met, they need to clearly document their reasons in the refusal note.\n\nA decision is reasonable when the reviewing court is able to trace the decision maker’s rationale, without encountering fatal flaws in the overarching logic, and is satisfied that there is a line of analysis within the given reasons that could lead the tribunal from the evidence before it to the decision maker’s conclusion.\n\nThe officer needs to engage with the documentary evidence that was provided by the applicant. Simply stating “I have reviewed the submissions and I am not satisfied that section R205 is met” is not sufficient for another reasonable person to understand the logic of the decision without reviewing all of the evidence again.\n\nIf an officer has determined that the applicant does not meet the eligibility requirements, the work permit application should be refused. To reduce the possibility of litigation on the refusal, officers should follow the steps in [Decision making: Standard of review and process for making a reasonable decision](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/service-delivery/decision-standard-review.html) when finalizing their refusal notes.\n\nThe grounds in the refusal letter should reflect what the officer has stated in their notes.\n\nWork permits shall be issued if all of the requirements stated in [section R200](https://laws-lois.justice.gc.ca/eng/regulations/SOR-2002-227/section-200.html) are met. Therefore, refusal grounds should be linked to one of those requirements. Below are a few examples of some of the requirements:\n\n**paragraph R200(1)(b)** – The officer must be satisfied that the applicant will leave Canada at the end of their period of authorized stay, including any assessment of [dual intent](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/visitors/dual-intent-applicants.html). This IMP work permit category is the precursor to the applicant obtaining permanent residence. However, if an officer is not satisfied that the applicant will leave Canada at the end of their period of authorized stay, they must explain why.\n\n* For example: As the applicant was refused under paragraph R200(1)(b) for remaining beyond their authorized period of stay, I am not satisfied that the applicant will leave Canada at the end of their authorized stay if their application for permanent residence is refused.\n\n**subparagraph R200(1)(c)(ii)** – The applicant has not met the eligibility requirements of the International Mobility Program work permit category. Officers need to explain clearly what eligibility requirements were not met.\n\n* For example: The applicant is refused under R200(1)(c)(ii), as their work is not described in section R205. They have not provided the letter of invitation from Quebec, as required by this International Mobility Program work permit category to demonstrate that their work would provide significant social or economic benefits under section R205.\n\n* or\n\n* For example: The applicant is refused under subparagraph R200(1)(c)(ii), as their work is not described in section R205. They have not satisfied me that they intend to reside in Quebec, as they have renewed their residential lease outside Quebec for 2 years after receiving the CSQ. They do not meet the eligibility requirements for the work described in section R205.\n\n* or\n\n* For example: The applicant is refused under subparagraph R200(1)(c)(ii), as their work is not described in section R205. The applicant does not have a CSQ in the Quebec Skilled Worker category. They do not meet the eligibility requirements for the work described in section R205.\n\nExtensions\n----------\n\nIf a permanent residence application is still in processing, a work permit extension may be considered on a case-by-case basis. The duration of an extension is 1 year. However, officers may use their discretion, depending on current [processing times](https://www.canada.ca/en/immigration-refugees-citizenship/services/application/check-processing-times.html) for Quebec skilled worker permanent residence applications.\n\nThe applicant must provide proof that they have submitted a permanent residence application and received an acknowledgment of receipt letter from IRCC. Another letter of invitation from Quebec is not required.\n\nOpen work permits for family members\n------------------------------------\n\nThe work permit of family members of the principal applicant must be restricted only to Quebec in general (**not to a specific city**).\n\n**Important:** For applications of family members of the principal applicant, the province of destination should be “Quebec,” and not left as “unknown.”\n\nPrincipal foreign nationals who hold or are approved for an open work permit under the administrative code A76 (CSQ holders outside Quebec) are not required to be employed. Officers should use the code C41 (spouses or common-law partners) or C46 (dependent children) for family member applications.\n\nConsult:\n\n* [Principal foreign national is open work permit holder or work permit exempt](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/foreign-workers/public-policy-competitiveness-economy/c41-c46.html)\n\nIf the principal foreign national has submitted an application for permanent residence, the officer should use the code C49.\n\nConsult\n\n* [Family members of work permit holders who are Economic Class permanent resident applicants [R205(c)(ii) - C49] -Canadian interest - International Mobility Program](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/foreign-workers/public-policy-competitiveness-economy/c49.html)\n\nPrevious updates\n----------------\n\nThe instructions were updated on the following dates:\n\n* [December 7, 2022](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/updates/2022-international-mobility-program.html)\n* [July 27, 2022](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/updates/2022-csq-outside-que.html)\n* [May 24, 2022](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/updates/2022-csq-outside-quebec-imp.html) (implementation date)\n\nPage details\n------------\n\n 2025-07-16",
  "sections": [
    {
      "heading": "Quebec Selection Certificate (CSQ) holders currently outside Quebec [R205(a) – A76] – International Mobility Program",
      "heading_path": [
        "Quebec Selection Certificate (CSQ) holders currently outside Quebec [R205(a) – A76] – International Mobility Program"
      ],
      "anchor": "#quebec-selection-certificate-csq-holders-currently-outside-quebec-r205-a-a76-international-mobility-program",
      "text": "Published Time: Thu, 12 Feb 2026 00:03:40 GMT\n\nQuebec Selection Certificate (CSQ) holders currently outside Quebec [R205(a) – A76] – International Mobility Program\n====================================================================================================================\n\nEffective January 16, 2025, the Ministère de l’Immigration, de la Francisation et de l’Intégration (MIFI) ceased sending a letter of invitation to CSQ holders currently outside Quebec in order to apply for a work permit under the administrative code A76.\n\nOfficers will continue to process all work permit applications submitted under this category where the letters of invitation issued by MIFI are dated up to January 15, 2025. Clients have 90 days to submit the work permit application after receiving a letter from MIFI.\n\nThe relevant [client instructions](https://www.canada.ca/en/immigration-refugees-citizenship/services/immigrate-canada/quebec-skilled-workers/international-mobility-program-plus-csq.html) have been updated accordingly.\n\nThese instructions apply to IRCC employees. Since applicants cannot submit their applications at a port of entry, the instructions do not apply to border services officers.\n\nThe instructions on this page should be reviewed in conjunction with\n\n* [Open work permit – General processing and issuance](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/foreign-workers/eligibility/open.html)\n* [Conditions and validity period on work permits](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/foreign-workers/eligibility/eligibility-admissibility-conditions-including-validity-period.html)\n\nUnder the International Mobility Program (IMP), administrative codes are used to identify different work that the department has determined may create significant social, cultural or economic benefits, or opportunities for Canadian citizens or permanent residents, as described in [subsection 205(a)](https://laws-lois.justice.gc.ca/eng/regulations/SOR-2002-227/section-205.html) of the Immigration and Refugee Protection Regulations (IRPR). IRCC establishes eligibility criteria and a specific administrative code for these situations under subsection R205(a). Officers must also always be satisfied that all requirements of [section R200](https://laws-lois.justice.gc.ca/eng/regulations/SOR-2002-227/section-200.html) are met before a work permit may be issued.\n\nAdministrative code A76 is the code for the IMP work permit category that describes the work of certain foreign nationals who are **currently residing outside Quebec** and hold a valid Quebec Selection Certificate (CSQ), and who may create significant social and cultural benefit for Quebec and Canada. This category was created through an agreement between the Minister of IRCC and Quebec’s ministère de l’Immigration, de la Francisation et de l’Intégration (MIFI).\n\n**Note:** The applicant must have obtained a CSQ as a skilled worker. They can apply for this work permit before or after submitting an application for permanent residence to IRCC.\n\nThis IMP work permit category was announced as part of IMP+.\n\nOn this page\n------------\n\n* [Background](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/foreign-workers/quebec-cases/csq-outside-quebec.html#background)\n* [Eligibility requirements](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/foreign-workers/quebec-cases/csq-outside-quebec.html#eligibility)\n* [Documentary evidence](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/foreign-workers/quebec-cases/csq-outside-quebec.html#evidence)\n* [Application assessment](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/foreign-workers/quebec-cases/csq-outside-quebec.html#assessment)\n * [Processing cap](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/foreign-workers/quebec-cases/csq-outside-quebec.html#cap)\n * [Cancellation of applications exceeding the cap](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/foreign-workers/quebec-cases/csq-outside-quebec.html#cancellation)\n * [Receipt of open work permit applications](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/foreign-workers/quebec-cases/csq-outside-quebec.html#owp)\n\n* [Final decision](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/foreign-workers/quebec-cases/csq-outside-quebec.html#decision)\n * [Approval](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/foreign-workers/quebec-cases/csq-outside-quebec.html#approval)\n * [Refusal](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/foreign-workers/quebec-cases/csq-outside-quebec.html#refusal)\n\n* [Extensions](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/foreign-workers/quebec-cases/csq-outside-quebec.html#extensions)\n* [Open work permits for family members](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/foreign-workers/quebec-cases/csq-outside-quebec.html#permits)\n* [Previous updates](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/foreign-workers/quebec-cases/csq-outside-quebec.html#updates)\n\nBackground\n----------\n\nOn May 24, 2022, [ministerial instructions regarding the processing of applications under the Quebec International Mobility Program Plus](https://canadagazette.gc.ca/rp-pr/p1/2022/2022-05-21/html/notice-avis-eng.html#n11) (Quebec IMP+) were issued. Foreign nationals selected by Quebec who **are currently overseas or reside in a province other than Quebec**, but intend to reside and work in Quebec, may be eligible for an open work permit.\n\nEligibility requirements\n------------------------\n\n* To be eligible for a labour market impact assessment–exempt (LMIA-exempt) work permit issued under subsection R205(a) and administrative code A76 as the holder of a CSQ, a foreign national must\n* have submitted their open work permit application online through an IRCC Secure Account (MyCIC account) \n * for outside of Canada applicants – refer to the [ministerial instructions](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/mandate/policies-operational-instructions-agreements/ministerial-instructions/other-goals/mi62.html) on the submission of online applications for temporary resident visas and other documents due to reduced processing capacity during the COVID–19 (coronavirus) pandemic for overseas applicants\n * for in-Canada applicants – refer to [programs exempt from the in-Canada mandatory electronic application (e-application) requirement for temporary residents](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/visitors/place-application-visa-electronic-travel-authorization-study-permit-work-permit/exempt-electronic-applications.html)\n * Applicants who can use the paper option must write **“International Mobility Program Plus – A76 cap”** on the envelope.\n\n* at the time their application under this category is received, be residing either \n * outside Canada or\n * in Canada and in any province or territory other than Quebec \n\n* intend to work and reside in Quebec\n* have a **CSQ** at the time of submission of their work permit application under this exemption and be in 1 of the following situations: \n * the CSQ is valid **if they have not yet submitted their permanent residence application or**\n * if an application for permanent residence has been submitted, it must have been submitted before the expiry of the CSQ and still be in progress \n * CSQs are valid for a 24-month period or until IRCC renders a decision on the permanent residence application.\n * Since August 2, 2018, MIFI no longer renews CSQs, as they are issued for 24 months and are **valid for the duration** of the permanent residence application, even if the 24-month period has passed.\n\n* have a letter of invitation to submit a work permit application under IMP administrative code A76 (the letter is available internally and in French only) from the province of Quebec\n\nApplicants who are in Canada and residing in a province or territory other than Quebec at the time of submission must\n\n* have valid temporary resident status, or be eligible for restoration of status as a temporary resident\n* be eligible to apply for a work permit from within Canada ([section R199](https://laws-lois.justice.gc.ca/eng/regulations/SOR-2002-227/section-199.html) or an active public policy)\n\nThe following foreign nationals are **not** eligible under this exemption category:\n\n* CSQ holders who reside in Quebec at the time of submission of the work permit application \n * Consult the Comparison table of categories that are available under the International Mobility Program for Quebec Selection Certificate (CSQ) holders (PDF).\n\n* foreign nationals who make their application at the port of entry\n* foreign nationals who have an open work permit as a [refugee claimant or under an enforceable removal order](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/foreign-workers/applicants-no-other-means-support-r206.html)\n * The work permit under R206 **does not confer temporary resident status as per section 202 of the IRPR**.\n\nDocumentary evidence\n--------------------\n\nThe following documents are required from all applicants:\n\n* a CSQ as described under [Eligibility requirements](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/foreign-workers/quebec-cases/csq-outside-quebec.html#eligibility)\n* a letter of invitation to submit a work permit application from the Government of Quebec\n* documents demonstrating their intent to reside in Quebec\n\nAlthough the submission of the application for permanent residence is not mandatory, if the applicant has submitted an application for permanent residence to IRCC under 1 of Quebec’s economic immigration streams they must provide 1 of the following documents:\n\n* proof of the application submission such as an email confirmation (with an X number)\n* an acknowledgment of receipt letter (with an E number) or\n* an approval in principle letter\n\nThe following documents are required from in-Canada applicants:\n\n* proof of residency outside Quebec \n * This may include copies of lease agreements or the most recent notice of assessment from the Canada Revenue Agency.\n\nThe applicant must submit this proof using the “Client Information” slot in the electronic application.\n\nApplication assessment\n----------------------"
    },
    {
      "heading": "Significant benefit assessment",
      "heading_path": [
        "Quebec Selection Certificate (CSQ) holders currently outside Quebec [R205(a) – A76] – International Mobility Program",
        "Significant benefit assessment"
      ],
      "anchor": "#significant-benefit-assessment",
      "text": "To determine if the applicant has met the eligibility requirements of this category under paragraph R205(a), the applicant must fall within the processing cap and meet all other eligibility requirements under category A76."
    },
    {
      "heading": "Processing cap",
      "heading_path": [
        "Quebec Selection Certificate (CSQ) holders currently outside Quebec [R205(a) – A76] – International Mobility Program",
        "Significant benefit assessment",
        "Processing cap"
      ],
      "anchor": "#processing-cap",
      "text": "As set out in the [ministerial instructions](https://canadagazette.gc.ca/rp-pr/p1/2022/2022-05-21/html/notice-avis-eng.html) for this work permit category, a maximum of 7,350 work permit applications are to be accepted for intake each year beginning in 2023 (calendar year).\n\nFor clarity, all applications submitted under this LMIA-exemption administrative code A76 will be counted against the cap, regardless of whether approved, refused or withdrawn.\n\n* The Operations Planning and Performance Branch (OPPB) is responsible for reporting to the Immigration Program Guidance Branch (IPG) on a weekly basis on the number of work permit applications submitted, approved, refused or withdrawn under LMIA-exemption code A76. All complete applications received within the intake cap will be processed.\n* Online applications received outside the intake cap will be disposed (cancelled) and paper applications received outside the intake cap will be returned for not meeting the requirement of the stream. The work permit processing fee and the open work permit holder fee will be refunded.\n* MIFI is responsible for monitoring the number of letters of invitation that are issued to CSQ holders outside Quebec.\n* MIFI will share reports on the number of letters of invitation issued, and IRCC will share the number of work permit applications received, approved, issued, refused or withdrawn on a quarterly basis."
    },
    {
      "heading": "Cancellation of applications exceeding the cap",
      "heading_path": [
        "Quebec Selection Certificate (CSQ) holders currently outside Quebec [R205(a) – A76] – International Mobility Program",
        "Significant benefit assessment",
        "Cancellation of applications exceeding the cap"
      ],
      "anchor": "#cancellation-of-applications-exceeding-the-cap",
      "text": "Once the cap of 7,350 work permit applications is reached, IPG will inform the integrated networks and a public notice will be issued on IRCC’s website.\n\nFor online applications, where the biometric fee is paid with the application, the biometric instruction letter (BIL) is issued automatically 24 hours from the date of receipt of the application. The Centralized Network will query for over-the-cap applications on a daily basis and take the following steps:\n\n* **Cancel** the BIL in bulk for applications received over the cap before they are automatically sent.\n* Assign an ORG ID to the application based on the office responsible for processing the application.\n\nThe following steps should be taken by the processing office for applications received over the cap:\n\n* Monitor the ORG ID for new associated applications.\n* Add the exemption code A76.\n* Administratively cancel open applications under this category.\n* Issue a refund for the processing **and** open work permit holder fees."
    },
    {
      "heading": "Receipt of open work permit applications",
      "heading_path": [
        "Quebec Selection Certificate (CSQ) holders currently outside Quebec [R205(a) – A76] – International Mobility Program",
        "Significant benefit assessment",
        "Receipt of open work permit applications"
      ],
      "anchor": "#receipt-of-open-work-permit-applications",
      "text": "Applications submitted by applicants who used the [Application For Work Permit Made Outside of Canada [IMM 1295] (PDF, 589 KB)](https://www.canada.ca/content/dam/ircc/migration/ircc/english/pdf/kits/forms/imm1295e.pdf) application form will be processed by the relevant migration office.\n\nApplications submitted by applicants who used the [Application to Change Conditions or Extend Your Stay in Canada [IMM 5710] (PDF, 600 KB)](https://www.canada.ca/content/dam/ircc/migration/ircc/english/pdf/kits/forms/imm5710e.pdf) application form, and who are residing in Canada but outside Quebec at the time of submission, will be processed by the Centralized Network.\n\n**Important:** Not all mandatory documents are requested in the online document checklist. Applicants are given instructions on the IRCC website on how to identify themselves under the IMP+ stream and where to upload the supporting documentation when they apply online.\n\nOfficers should note that applicants are given specific instructions on how to complete the IMM 1295 and IMM 5710 application forms. These instructions can be found at [International Mobility Program Plus: Open work permits for Quebec Selection Certificate holders outside Quebec](https://www.canada.ca/en/immigration-refugees-citizenship/services/immigrate-canada/quebec-skilled-workers/international-mobility-program-plus-csq.html).\n\nApplicants are instructed to input the following in the “Details of intended work in Canada” section:\n\nBox 1: What type of work permit are you applying for?\n\nSelect “Open Work Permit”.\n\nBox 4: “Job title” and “Brief description of duties”\n\nEnter “**CSQ holder outside Quebec – OWP**” in the “Job title” box.\n\nEnter **A76: International Mobility Program Plus** in the “Brief description of duties” box.\n\nOfficers should be aware that\n\n* the “Job title” box on the IMM 1295 and IMM 5710 forms maps to the “Intended occupation” field in GCMS\n* the “Brief description of duties” box maps to a case note in GCMS\n\nFinal decision\n--------------"
    },
    {
      "heading": "Approval",
      "heading_path": [
        "Quebec Selection Certificate (CSQ) holders currently outside Quebec [R205(a) – A76] – International Mobility Program",
        "Significant benefit assessment",
        "Approval"
      ],
      "anchor": "#approval",
      "text": "The work permit will be issued under the authority of paragraph R205(a).\n\nIn the Global Case Management System (GCMS), on the Application screen, officers should enter the information below in the specified fields:\n\n| Field | Selection or Input |\n| --- | --- |\n| Case Type | 27 |\n| Exemption Code | A76 |\n| Province of Destination | Quebec |\n| City of Destination | Quebec NES (not elsewhere stated) |\n| NOC | 99999 |\n| Intended Occupation | Open |\n| Employer | Open |\n| Valid to | 36 months from the date of issue or until the applicant’s passport expires, whichever comes first. |\n| Conditions – Medical | If no medical examination was completed, see [Medical conditions to be imposed for open employer but occupation-restricted work permits](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/foreign-workers/eligibility/open.html#conditions-restricted) |\n| Conditions | Officers should ensure that the instructions provided in [Work permit issuance in GCMS: Occupation or location restricted](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/foreign-workers/eligibility/open.html#issuance-restricted) are followed. The following location condition **must be** imposed: Not authorized to work in any location other than stated. |\n| User note (**mandatory**) | CSQ holders – A76 |"
    },
    {
      "heading": "Refusal",
      "heading_path": [
        "Quebec Selection Certificate (CSQ) holders currently outside Quebec [R205(a) – A76] – International Mobility Program",
        "Significant benefit assessment",
        "Refusal"
      ],
      "anchor": "#refusal",
      "text": "When officers are not satisfied that the specific eligibility factors for this administrative code are met, they need to clearly document their reasons in the refusal note.\n\nA decision is reasonable when the reviewing court is able to trace the decision maker’s rationale, without encountering fatal flaws in the overarching logic, and is satisfied that there is a line of analysis within the given reasons that could lead the tribunal from the evidence before it to the decision maker’s conclusion.\n\nThe officer needs to engage with the documentary evidence that was provided by the applicant. Simply stating “I have reviewed the submissions and I am not satisfied that section R205 is met” is not sufficient for another reasonable person to understand the logic of the decision without reviewing all of the evidence again.\n\nIf an officer has determined that the applicant does not meet the eligibility requirements, the work permit application should be refused. To reduce the possibility of litigation on the refusal, officers should follow the steps in [Decision making: Standard of review and process for making a reasonable decision](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/service-delivery/decision-standard-review.html) when finalizing their refusal notes.\n\nThe grounds in the refusal letter should reflect what the officer has stated in their notes.\n\nWork permits shall be issued if all of the requirements stated in [section R200](https://laws-lois.justice.gc.ca/eng/regulations/SOR-2002-227/section-200.html) are met. Therefore, refusal grounds should be linked to one of those requirements. Below are a few examples of some of the requirements:\n\n**paragraph R200(1)(b)** – The officer must be satisfied that the applicant will leave Canada at the end of their period of authorized stay, including any assessment of [dual intent](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/visitors/dual-intent-applicants.html). This IMP work permit category is the precursor to the applicant obtaining permanent residence. However, if an officer is not satisfied that the applicant will leave Canada at the end of their period of authorized stay, they must explain why.\n\n* For example: As the applicant was refused under paragraph R200(1)(b) for remaining beyond their authorized period of stay, I am not satisfied that the applicant will leave Canada at the end of their authorized stay if their application for permanent residence is refused.\n\n**subparagraph R200(1)(c)(ii)** – The applicant has not met the eligibility requirements of the International Mobility Program work permit category. Officers need to explain clearly what eligibility requirements were not met.\n\n* For example: The applicant is refused under R200(1)(c)(ii), as their work is not described in section R205. They have not provided the letter of invitation from Quebec, as required by this International Mobility Program work permit category to demonstrate that their work would provide significant social or economic benefits under section R205.\n\n* or\n\n* For example: The applicant is refused under subparagraph R200(1)(c)(ii), as their work is not described in section R205. They have not satisfied me that they intend to reside in Quebec, as they have renewed their residential lease outside Quebec for 2 years after receiving the CSQ. They do not meet the eligibility requirements for the work described in section R205.\n\n* or\n\n* For example: The applicant is refused under subparagraph R200(1)(c)(ii), as their work is not described in section R205. The applicant does not have a CSQ in the Quebec Skilled Worker category. They do not meet the eligibility requirements for the work described in section R205.\n\nExtensions\n----------\n\nIf a permanent residence application is still in processing, a work permit extension may be considered on a case-by-case basis. The duration of an extension is 1 year. However, officers may use their discretion, depending on current [processing times](https://www.canada.ca/en/immigration-refugees-citizenship/services/application/check-processing-times.html) for Quebec skilled worker permanent residence applications.\n\nThe applicant must provide proof that they have submitted a permanent residence application and received an acknowledgment of receipt letter from IRCC. Another letter of invitation from Quebec is not required.\n\nOpen work permits for family members\n------------------------------------\n\nThe work permit of family members of the principal applicant must be restricted only to Quebec in general (**not to a specific city**).\n\n**Important:** For applications of family members of the principal applicant, the province of destination should be “Quebec,” and not left as “unknown.”\n\nPrincipal foreign nationals who hold or are approved for an open work permit under the administrative code A76 (CSQ holders outside Quebec) are not required to be employed. Officers should use the code C41 (spouses or common-law partners) or C46 (dependent children) for family member applications.\n\nConsult:\n\n* [Principal foreign national is open work permit holder or work permit exempt](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/foreign-workers/public-policy-competitiveness-economy/c41-c46.html)\n\nIf the principal foreign national has submitted an application for permanent residence, the officer should use the code C49.\n\nConsult\n\n* [Family members of work permit holders who are Economic Class permanent resident applicants [R205(c)(ii) - C49] -Canadian interest - International Mobility Program](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/foreign-workers/public-policy-competitiveness-economy/c49.html)\n\nPrevious updates\n----------------\n\nThe instructions were updated on the following dates:\n\n* [December 7, 2022](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/updates/2022-international-mobility-program.html)\n* [July 27, 2022](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/updates/2022-csq-outside-que.html)\n* [May 24, 2022](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/updates/2022-csq-outside-quebec-imp.html) (implementation date)\n\nPage details\n------------\n\n 2025-07-16"
    }
  ],
  "links": {
    "outbound": [
      "https://www.canada.ca/en/immigration-refugees-citizenship/services/immigrate-canada/quebec-skilled-workers/international-mobility-program-plus-csq.html",
      "https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/foreign-workers/eligibility/open.html",
      "https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/foreign-workers/eligibility/eligibility-admissibility-conditions-including-validity-period.html",
      "https://laws-lois.justice.gc.ca/eng/regulations/SOR-2002-227/section-205.html",
      "https://laws-lois.justice.gc.ca/eng/regulations/SOR-2002-227/section-200.html",
      "https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/foreign-workers/quebec-cases/csq-outside-quebec.html",
      "https://canadagazette.gc.ca/rp-pr/p1/2022/2022-05-21/html/notice-avis-eng.html",
      "https://www.canada.ca/en/immigration-refugees-citizenship/corporate/mandate/policies-operational-instructions-agreements/ministerial-instructions/other-goals/mi62.html",
      "https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/visitors/place-application-visa-electronic-travel-authorization-study-permit-work-permit/exempt-electronic-applications.html",
      "https://laws-lois.justice.gc.ca/eng/regulations/SOR-2002-227/section-199.html",
      "https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/foreign-workers/applicants-no-other-means-support-r206.html",
      "https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/service-delivery/decision-standard-review.html",
      "https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/visitors/dual-intent-applicants.html",
      "https://www.canada.ca/en/immigration-refugees-citizenship/services/application/check-processing-times.html",
      "https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/foreign-workers/public-policy-competitiveness-economy/c41-c46.html",
      "https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/updates/2022-international-mobility-program.html",
      "https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/updates/2022-csq-outside-que.html",
      "https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/updates/2022-csq-outside-quebec-imp.html"
    ],
    "internal_children": []
  },
  "quality": {
    "is_toc_like": false,
    "is_low_text": false,
    "notes": []
  }
}