{
  "source_id": "pdi_dcd2c11b1ed0",
  "source_type": "guidance_pdi",
  "source_url": "https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/visitors/diplomatic-official-visas.html",
  "canonical_url": "https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/visitors/diplomatic-official-visas.html",
  "title": "Temporary residents: Diplomatic and official visas",
  "language": "en",
  "manual": "Temporary residents: Diplomatic and official visas",
  "chapter": null,
  "heading_path": [
    "Temporary residents: Diplomatic and official visas"
  ],
  "last_updated": "2019-06-10",
  "crawl_ts": "2026-02-12T00:00:00Z",
  "http": {
    "status_code": 200,
    "content_type": "text/markdown"
  },
  "content_hash": "fa29bfa3ce7bfd9344fc8536e5b44cb18ce37ecb6f38ddfb512b34e478d3f119",
  "raw_html_path": null,
  "markdown_path": "scripts/scraper/ircc_data_clean/diplomatic-official-visas-dcd2c11b1e.md",
  "text": "Published Time: Thu, 12 Feb 2026 00:33:06 GMT\n\nTemporary residents: Diplomatic and official visas\n==================================================\n\nThis section contains policy, procedures and guidance used by IRCC staff. It is posted on the department’s website as a courtesy to stakeholders.\n\nDiplomatic, official and courtesy visas, although not equivalent to the right of entry into Canada, are nonetheless the only evidence of Canada’s consent to official visits by foreign officials. That consent, under international and domestic law, is a condition of granting diplomatic, consular or official (functional) privileges and immunities (or courtesies), as soon as the holder sets foot on Canadian soil or during transit. Although holders of diplomatic visas are, in principle, exempt from immigration and customs inspection on entry into Canada, they are subject to mandatory security checks at Canadian airports.\n\nDiplomatic, official and similar passports issued by the country of which the foreign national is a citizen or national are only travel documents and do not in themselves determine the type of visa that should be granted.\n\nOn this page\n------------\n\n* [When diplomatic and official travellers do not require a temporary resident visa (TRV) or electronic travel authorization (eTA) and are not required to provide biometrics](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/visitors/diplomatic-official-visas.html#trv-req-when)\n* [People travelling to Canada to assume a diplomatic posting (accreditation in Canada)](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/visitors/diplomatic-official-visas.html#accreditation)\n* [Who is entitled to diplomatic, official and courtesy visas?](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/visitors/diplomatic-official-visas.html#visa-who)\n* [Criteria for diplomatic and official visas](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/visitors/diplomatic-official-visas.html#visa-crit)\n* [Documents to be submitted](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/visitors/diplomatic-official-visas.html#docs-tbs)\n* [Authority for issuance](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/visitors/diplomatic-official-visas.html#issuance-auth)\n* [Issuance of visas](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/visitors/diplomatic-official-visas.html#visa-issuance)\n* [Summary of procedures for diplomatic and official visas](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/visitors/diplomatic-official-visas.html#visa-procedure-summary)\n\nWhen diplomatic and official travellers do not require a temporary resident visa (TRV) or electronic travel authorization (eTA) and are not required to provide biometrics\n--------------------------------------------------------------------------------------------------------------------------------------------------------------------------\n\nPersons travelling with diplomatic, official or similar passports do not require temporary resident visas, biometric information collection or an electronic travel authorization if they:\n\n* hold a passport that contains a diplomatic Acceptance, a consular Acceptance or an official Acceptance issued by the Chief of Protocol for Global Affairs Canada(GAC) on behalf of the Government of Canada; and\n* are properly accredited diplomats, consular officers, representatives or officials of a country other than Canada, of the United Nations or an agency thereof, or of any international organization of which Canada is a member [R190(2)(a)].\n\nDiplomats from visa-required, biometric and electronic travel authorization (eTA)-required countries holding a passport that contains a diplomatic acceptance, a consular acceptance or an official acceptance issued by the Chief of Protocol for GAC will be exempt from temporary resident visa, biometric information collection and eTA requirements.\n\nPeople travelling to Canada to assume a diplomatic posting (accreditation in Canada):\n-------------------------------------------------------------------------------------\n\nAll foreign officials travelling to Canada to assume diplomatic positions for which an acceptance **has not yet been issued** should apply for a temporary resident visa(TRV) before travelling to Canada, whether they are from an eTA-required country or a visa-required country. Holders of a diplomatic or official visa wishing to take up their diplomatic/consular functions in Canada (i.e. at the time of first installation) will normally benefit from a multiple-entry visa, for up to three (3) months. Some exceptions may apply. Such multiple-entry diplomatic or official visas must not be issued without specific authorization from the Office of Protocol of GAC.\n\nNotwithstanding the above, diplomatic visas can be issued to facilitate travel for eligible visa- and eTA-required foreign officials, as they offer evidence of Canada’s consent to official visits by foreign officials. There is no processing fee for diplomatic visas.\n\nTRVs are the only indication to Border Services Officers in Canada that the passport holder, in Canada's view, may be entitled to diplomatic, consular or official privileges and immunities and recognized under the Foreign Missions and International Organizations Act (FMIOA).\n\nWho is entitled to diplomatic, official and courtesy visas?\n-----------------------------------------------------------\n\n### Diplomatic visas\n\nDiplomatic visas may be granted to persons entitled, under international and domestic law, to diplomatic or consular (and similar) privileges and immunities, who intend to travel to Canada for an official purpose or to pass through Canada on the way to an assignment in another state and who come within one of the following categories:\n\n* Heads of state or members of organizations entrusted with head-of-state duties and their accompanying family members;\n* Heads of government and their accompanying family members, and cabinet ministers of foreign governments;\n* Diplomatic agents travelling to or from their diplomatic missions or on a temporary mission to Canada;\n* Career consular officers travelling to or from their consular posts or on a temporary mission to Canada;\n* Delegates to the international organizations listed in the Temporary Foreign Worker Guidelines including delegates to conferences convened by the latter, with the exception of clerical staff;\n* Senior officials (Secretary General, Assistant Secretaries General, and holders of equivalent positions, such as President of the Council of the International Civil Aviation Organization) of the international organizations listed in the Temporary Foreign Worker Guidelines;\n* Senior officers (appointed at the P-4 level and above) of the Secretariat of the I.C.A.O.;\n* Persons (spouse, father, mother, children) who are recognized as members of the family forming part of the household of either diplomatic agents travelling to or from their diplomatic missions or on a temporary mission to Canada, or of senior officers of the Secretariat of the International Civil Aviation Organization;\n* Foreign diplomatic couriers; and\n* Special cases, on authorization from Headquarters (Diplomatic Corps Services (XDC)).\n\n### U.S. government officials\n\nThe following official U.S. government personnel assigned to temporary postings in Canada are not issued diplomatic or official acceptances in Canada and are therefore not eligible for diplomatic visas:\n\n* Department of Homeland Security officers;\n* U.S. Customs officers;\n* International Joint Commission employees; and\n* Inspectors with the Federal Grain Inspection Service of the United States Department of Agriculture and other U.S. government officials in possession of official U.S. government passports and assigned to temporary postings in Canada.\n\nU.S. government employees will be issued work permits under R204 and as such are HRSDC/SC LMO exempt (T10). For more information on the documentation of U.S. government employees, refer to the Temporary Foreign Worker Guidelines.\n\n### Official visas\n\nOfficial visas may be granted to persons entitled, under international and domestic law, to official (functional) privileges and immunities, who intend to travel to, or to pass through, Canada for an official purpose and who come within one of the following categories:\n\n* Members of the administrative and technical staff of diplomatic missions or international organizations; consular staff of consular posts; and service staff of diplomatic missions and consular posts in Canada;\n* Officials who hold a diplomatic, official or similar passport, invited by the Government of Canada or a provincial or territorial government for meetings in Canada;\n* Other officials or experts on mission, acting on behalf of the international organizations listed in the Temporary Foreign Worker Guidelines, or contractual employees such as translators hired by the United Nations Organization or the International Civil Aviation Organization for their assemblies;\n* Persons (spouse, father, mother, children) who are recognized as members of the family forming part of the household of persons listed in section (1) above and of \"other officials\" indicated in section (2) above;\n* Private servants of a member of a diplomatic mission or a consular post, but only after a Household Domestic Worker Employment Agreement (refer to the Temporary Foreign Worker Guidelines) has been submitted by the employer to the diplomatic mission or the consular post or GAC Protocol (XDC); and\n* Special cases, on authorization from GAC, Protocol (XDC).\n\n### Courtesy visas\n\nUnder Canadian law, no person other than those listed above under diplomatic visas or official visas is entitled to diplomatic, consular, or official privileges and immunities. Therefore, all other persons travelling to Canada for the purpose of an official visit, for an international organization or on behalf of a foreign government, other than those situations listed above, may be issued courtesy visas.\n\nOfficers may issue a courtesy visa in the interest of bilateral relations.\n\nCourtesy visas may be issued as multiple-entry visas, with a validity period of up to 3 years.\n\nCriteria for diplomatic or official visas\n-----------------------------------------\n\n### Purpose of a visit\n\nDiplomatic and official visas are not automatically granted to holders of diplomatic, official or similar passports. The purpose of the visit is the primary factor to be considered in determining whether a diplomatic or official visa should be issued. For that reason, it is essential that a written request in the form of a note be received from the Ministry of Foreign Affairs, a diplomatic mission, or a consular post, bearing a signature or initial(s) and an official stamp and clearly defining the purpose of the visit to Canada.\n\n### Official visit\n\nAmbiguous statements, such as \"special mission\" or \"official visit,\" are not sufficient to justify the issuance of a diplomatic or official visa. The purpose of the visit, as stated in the written request, must clearly be of such an official nature that, insofar as Canada is concerned, it would justify the granting of appropriate privileges and immunities in Canada under domestic law in accordance with the relevant international conventions, headquarters agreements with international organizations, or international customary law.\n\nThe following working definition of \"special mission\" or \"official visit\" should be used in considering a request for a diplomatic or official visa: such a visa is of a temporary nature by a representative of a state, sent by the latter and consented to by Canada for the purpose of dealing with:\n\n* questions of mutual interest,\n* questions pertaining to a diplomatic mission or a consular post of the sending state in Canada, and,\n* questions regarding bilateral or multilateral relations with third states or international organizations, including international conferences hosted by Canada.\n\n### Examples where diplomatic visas are justified\n\nExamples of situations justifying the issuance of diplomatic visas include:\n\n* a diplomatic agent being assigned to a diplomatic mission in Canada or travelling through Canada on the way to a diplomatic assignment elsewhere;\n* an official visit of a head of state or chief administrative officer (Secretary General, Director, or their Assistants) of the international organizations listed in Temporary Foreign Worker Guidelines.\n\n### Examples where official visas are justified\n\nExamples of situations justifying the issuance of official visas include:\n\n* support staff assigned to a diplomatic mission or a consular post in Canada or travelling through Canada on the way to a diplomatic mission or a consular post elsewhere;\n* officials or experts of the United Nations Organization travelling to Canada on United Nations business. Some purposes that may be \"official\" to a sending state will not be regarded necessarily as such by Canada, like buying or selling a diplomatic mission on behalf of a governmental agency, or a fund-raising or electioneering visit to an expatriate community in Canada.\n* government officials travelling to Canada to conduct business with representatives of the Government of Canada or provincial or territorial governments.\n\n### Personal status\n\nAn individual's personal status is not normally a primary consideration for the issuance of a diplomatic or official visa (except for heads of state and other relatively rare instances). For instance, a senior official of a foreign government, travelling on a diplomatic passport, should not be issued a diplomatic visa if the individual intends to enter Canada for commercial negotiations with private enterprises, or on a private visit. In that case, the individual would be issued a regular temporary resident visa, if required, or a courtesy visa, if deemed appropriate. Another instance would be a student who is the child of a diplomatic agent serving outside Canada and who enters Canada solely to pursue their studies. If not exempt from a temporary resident visa, that person would need a regular temporary resident visa before entering Canada and may require a study permit as well. This individual would not be entitled to a diplomatic or official visa although they may hold a diplomatic or special passport.\n\n### Diplomatic or official visas on an ordinary passport\n\nA diplomatic or official visa may be inserted in an ordinary passport if the purpose of the visit warrants it, such as when a member of a foreign government, travelling on an ordinary passport, enters Canada as a member on an official mission, or when a private citizen (for example, an academic) is included in a state's delegation to a meeting of the International Civil Aviation Organization or a diplomatic conference in Canada.\n\nDocuments to be submitted\n-------------------------\n\nAn officer may issue a diplomatic or official visa only on receipt of one of the following:\n\n* a written request, as above, from the Ministry of Foreign Affairs of the state to which the head of mission or post is accredited, or for which the diplomatic mission or consular post has jurisdiction in visa matters;\n* a written request, as above, from a diplomatic mission or a consular post of the state of the applicant's citizenship;\n* a written request, as above, by an international organization listed in Temporary Foreign Worker Guidelines in respect of its officials travelling to Canada to carry out official duties; or,\n* in the case of persons entering Canada to take employment as officers of the Secretariat of the International Civil Aviation Organization, a letter to the individual concerned constituting an \"offer of employment,\" indicating their official level at the I.C.A.O. and signed by or on behalf of the Secretary General.\n\nAuthority for issuance\n----------------------\n\n### Policy\n\nWith the exception of those cases described below, diplomatic agents, consular officers, or immigration officers may issue diplomatic and official visas without reference to Headquarters. However, if they have the slightest doubt regarding the bona fides of an applicant or their entitlement to a diplomatic or official visa, they should refer the request to the appropriate Immigration, Refugees and Citizenship Canada(IRCC) Geographic division and to GAC Protocol.\n\n### Categories requiring consultation with IRCC Geographic and GAC Protocol (XDC)\n\n* Diplomatic agents, consular officers, and immigration officers may not issue diplomatic or official visas to officials of \"special category\" states without prior consultation.\n* Officers should consult whenever there is some doubt or question regarding the issuance of a visa to a person assigned to Canada.\n* Officers should consult on all requests for visas for members of diplomatic missions, consular posts, or other offices in Canada not listed in the latest edition of [Foreign representatives in Canada](http://www.international.gc.ca/protocol-protocole/reps.aspx). There may be other categories of persons or states where, for a temporary period, authority from headquarters will be required before diplomatic or official visas are granted. When such circumstances arise, Protocol (XDC) or IRCC Geographic will provide specific guidance to diplomatic missions and consular posts on request.\n\nIssuance of visas\n-----------------\n\n### Usefulness of diplomatic, official and courtesy visas\n\nPersons listed in “Who is entitled to diplomatic, official and courtesy visas?” above, who are within the jurisdiction of the diplomatic mission or consular post and who intend to travel to Canada, should be advised to apply for the appropriate visa or eTA, as applicable.\n\nDiplomatic, official, and courtesy visas, although not equivalent to the right of entry into Canada, are nonetheless the only evidence of Canada's consent to official visits by foreign officials. That consent, under international and domestic law, is a condition of the granting of diplomatic, consular, or official (functional) privileges and immunities (or courtesies) as soon as the holder sets foot on Canadian soil or during transit.\n\nDiplomatic, official and courtesy visas are the only indication to Border Services Officers in Canada that the holder, in Canada's view, may be entitled to diplomatic, consular, or official (functional) privileges and immunities (or courtesies). In that connection, the visa coding and the statement made in \"purpose of stay\" are the essential elements for the issuance of the visas. The possession of an appropriate visa, not the holding of a diplomatic, official or similar passport, is the sole way of ensuring the right processing on arrival in Canada and thereby avoiding unpleasant incidents.\n\n### Security checks\n\nAlthough holders of diplomatic visas are, in principle, exempt from immigration and customs inspection on entry into Canada, they are subject to mandatory security checks at Canadian airports. Officers should apprise holders of diplomatic visas of that requirement whenever possible. If necessary, the persons concerned can obtain more details about that requirement from their own diplomatic missions accredited to Canada.\n\n### Multiple-entry visas\n\nThe period during which a visa is valid is left to the discretion of the officer. That leeway should not be confused with the requirement on the former visa to show the intended duration of stay.\n\nGenerally speaking, diplomats and officials may be issued a multiple-entry visa that is valid for up to **3 years**. Some exceptions may apply. This does **not** apply to foreign officials travelling to Canada to obtain their accreditation in Canada (to assume their diplomatic posting in Canada).\n\nForeign officials travelling to Canada to obtain their accreditation (to assume their diplomatic posting) are issued a multiple-entry TRV that is valid for **3 months**. These applicants should be advised that the duration of the initial entry into Canada is determined by the Canadian official at the border and that the diplomatic mission in Canada should send their passports, along with the required documents, to the Department of Global Affairs, Protocol(XDC), requesting accreditation or recognition. During the validity of the diplomatic or official acceptance, the applicants do not require any other visa to enter Canada.\n\nMultiple-entry diplomatic or official visas must not be issued to persons who are on assignment to Canada without specific authorization from GAC.\n\n### Notification to IRCC Geographic Desk and GAC, Protocol\n\nWhenever an officer issues a diplomatic, official, or courtesy visa without prior authorization from Headquarters, but pursuant to standing instructions, and believes the visit would be of interest to Headquarters, they should notify Headquarters of the name and the occupation of the person concerned and the nature and the date of the proposed visit. Notification should be addressed to GAC Protocol and to the appropriate IRCC geographic division and should be marked for distribution to other interested functional divisions or departments. Moreover, the Canadian port of entry should be alerted if that is deemed appropriate.\n\nSummary of procedures for diplomatic and official visas\n-------------------------------------------------------\n\n### Areas of concern\n\n### Who is entitled to diplomatic or official visas?\n\n* For details refer to [Diplomatic or official temporary resident visas](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/visitors/diplomatic-official-visas.html).\n* In addition, consult the Office of Protocol at GAC. In urgent cases, contact the Immigration Advisor and Liaison Officer\n\n### Ports of entry procedures\n\nThe Border Service Officer (BSO) will stamp diplomatic or official passports, thereby authorizing entry for a period of six months. Officers will not refer diplomats or officials to secondary examination.\n\n### Role of Office of Protocol\n\n* During the six-month period, the person’s foreign mission will forward the passport to the Diplomatic Corps Services Division, Office of Protocol, GAC.\n* The Office of Protocol will issue a diplomatic (D), consular (C), official (J) or international (I) acceptance, which indicates that the person is accredited to Canada and entitled to remain in Canada for the duration of their status.\n\n### Visa exemption for accredited persons\n\nOnce accredited, these persons do not require a temporary resident visa or an eTA to enter Canada.\n\n### Spouses, parents and dependent children of diplomats\n\n* People (spouses, fathers, mothers and children) who are recognized as members of the family, forming part of the household, may be granted official visas.\n* Diplomats’, consular officers’, representatives’ and officials’ dependent children who are under 19 years of age and considered to be members of the family, forming part of the household, are issued acceptances.\n* Children over 19 years of age are issued acceptances only if they are registered as full-time students.\n* After turning 25 years of age, dependent children are no longer eligible to receive official acceptance (even if they are still studying) and must change their official status to regular immigration status.\n\n### Servants of diplomats\n\n**Note:** Members of the official service staff are exempt from the same requirements as foreign representatives (diplomats).\n\nCan be one of the following two types:\n\n* Private servants: are issued official (O-1) visas; will receive an official (J) acceptance from the Office of Protocol; will not require a temporary resident visa if they wish to re-enter; do not require a work permit; must undergo a medical examination, and must provide biometric information if from a country or territory whose nationals are required to do so, but are exempt from the biometric fee.\n* For guidance on employment requirements for diplomatic servants, refer to Temporary Foreign Worker Guidelines.\n* Live-in Caregivers: must meet requirements to be live-in caregivers in Canada; must undergo a medical examination; must provide biometric information if from a country or territory whose nationals are required to do so and must pay the biometric fee; are issued a work permit; do not enjoy any privileges or immunities; require a temporary resident visa to re-enter Canada.\n\nLearn more about the Live-in Caregiver Program in OP14.\n\n### Processing fees\n\nThere is no [processing fee for diplomatic visas](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/fees/immigration/temporary-resident-visa-electronic-travel-authorization-applications-fees.html).\n\n### Medical examinations (exemptions)\n\nThe following people are exempt from having to undergo a medical examination, even if they are from countries where one would normally be required:\n\n* diplomatic and consular officials entering for official duties only\n* spouses and dependent children of diplomatic and consular officials, unless they intend to work\n* members of the armed forces of a country designated under the Visiting Forces Act who are entering for official duties only (see [Countries designated for the purposes of the Visiting Forces Act](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/visitors/countries-designated-purposes-visiting-forces-act.html))\n\n### Biometric information (exemptions)\n\n* Diplomats and officials and their family members who have been issued a D-1 or O-1 visa are exempt from providing biometric information, even if they are from a country or territory whose nationals are normally required to do so.\n* Those issued a courtesy visa are required to provide their biometrics; however, the biometric requirement may be exempted only at the discretion of the Migration Program Manager, in the interest of bilateral relations.\n* Holders of diplomatic or official passports who are nationals of a biometric-required country or territory, and who have been issued a regular TRV, are required to provide their biometric information but are exempt from the biometric fee.\n* Private servants of diplomats and officials must provide their biometric information if they are nationals of a biometric-required country or territory, but are exempt from the biometric fee if their employer is travelling to Canada on official business.\n* Live-in caregivers of diplomats and officials must provide their biometric information when applying for a Temporary resident visa or work permit if they are nationals of a biometric-required country or territory and must pay the biometric fee.\n\nFor further information on the biometric requirement, see [Biometrics collection and screening](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/identity-management/biometrics.html).\n\nPage details\n------------\n\n 2019-06-10",
  "sections": [
    {
      "heading": "Temporary residents: Diplomatic and official visas",
      "heading_path": [
        "Temporary residents: Diplomatic and official visas"
      ],
      "anchor": "#temporary-residents-diplomatic-and-official-visas",
      "text": "Published Time: Thu, 12 Feb 2026 00:33:06 GMT\n\nTemporary residents: Diplomatic and official visas\n==================================================\n\nThis section contains policy, procedures and guidance used by IRCC staff. It is posted on the department’s website as a courtesy to stakeholders.\n\nDiplomatic, official and courtesy visas, although not equivalent to the right of entry into Canada, are nonetheless the only evidence of Canada’s consent to official visits by foreign officials. That consent, under international and domestic law, is a condition of granting diplomatic, consular or official (functional) privileges and immunities (or courtesies), as soon as the holder sets foot on Canadian soil or during transit. Although holders of diplomatic visas are, in principle, exempt from immigration and customs inspection on entry into Canada, they are subject to mandatory security checks at Canadian airports.\n\nDiplomatic, official and similar passports issued by the country of which the foreign national is a citizen or national are only travel documents and do not in themselves determine the type of visa that should be granted.\n\nOn this page\n------------\n\n* [When diplomatic and official travellers do not require a temporary resident visa (TRV) or electronic travel authorization (eTA) and are not required to provide biometrics](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/visitors/diplomatic-official-visas.html#trv-req-when)\n* [People travelling to Canada to assume a diplomatic posting (accreditation in Canada)](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/visitors/diplomatic-official-visas.html#accreditation)\n* [Who is entitled to diplomatic, official and courtesy visas?](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/visitors/diplomatic-official-visas.html#visa-who)\n* [Criteria for diplomatic and official visas](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/visitors/diplomatic-official-visas.html#visa-crit)\n* [Documents to be submitted](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/visitors/diplomatic-official-visas.html#docs-tbs)\n* [Authority for issuance](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/visitors/diplomatic-official-visas.html#issuance-auth)\n* [Issuance of visas](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/visitors/diplomatic-official-visas.html#visa-issuance)\n* [Summary of procedures for diplomatic and official visas](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/visitors/diplomatic-official-visas.html#visa-procedure-summary)\n\nWhen diplomatic and official travellers do not require a temporary resident visa (TRV) or electronic travel authorization (eTA) and are not required to provide biometrics\n--------------------------------------------------------------------------------------------------------------------------------------------------------------------------\n\nPersons travelling with diplomatic, official or similar passports do not require temporary resident visas, biometric information collection or an electronic travel authorization if they:\n\n* hold a passport that contains a diplomatic Acceptance, a consular Acceptance or an official Acceptance issued by the Chief of Protocol for Global Affairs Canada(GAC) on behalf of the Government of Canada; and\n* are properly accredited diplomats, consular officers, representatives or officials of a country other than Canada, of the United Nations or an agency thereof, or of any international organization of which Canada is a member [R190(2)(a)].\n\nDiplomats from visa-required, biometric and electronic travel authorization (eTA)-required countries holding a passport that contains a diplomatic acceptance, a consular acceptance or an official acceptance issued by the Chief of Protocol for GAC will be exempt from temporary resident visa, biometric information collection and eTA requirements.\n\nPeople travelling to Canada to assume a diplomatic posting (accreditation in Canada):\n-------------------------------------------------------------------------------------\n\nAll foreign officials travelling to Canada to assume diplomatic positions for which an acceptance **has not yet been issued** should apply for a temporary resident visa(TRV) before travelling to Canada, whether they are from an eTA-required country or a visa-required country. Holders of a diplomatic or official visa wishing to take up their diplomatic/consular functions in Canada (i.e. at the time of first installation) will normally benefit from a multiple-entry visa, for up to three (3) months. Some exceptions may apply. Such multiple-entry diplomatic or official visas must not be issued without specific authorization from the Office of Protocol of GAC.\n\nNotwithstanding the above, diplomatic visas can be issued to facilitate travel for eligible visa- and eTA-required foreign officials, as they offer evidence of Canada’s consent to official visits by foreign officials. There is no processing fee for diplomatic visas.\n\nTRVs are the only indication to Border Services Officers in Canada that the passport holder, in Canada's view, may be entitled to diplomatic, consular or official privileges and immunities and recognized under the Foreign Missions and International Organizations Act (FMIOA).\n\nWho is entitled to diplomatic, official and courtesy visas?\n-----------------------------------------------------------"
    },
    {
      "heading": "Diplomatic visas",
      "heading_path": [
        "Temporary residents: Diplomatic and official visas",
        "Diplomatic visas"
      ],
      "anchor": "#diplomatic-visas",
      "text": "Diplomatic visas may be granted to persons entitled, under international and domestic law, to diplomatic or consular (and similar) privileges and immunities, who intend to travel to Canada for an official purpose or to pass through Canada on the way to an assignment in another state and who come within one of the following categories:\n\n* Heads of state or members of organizations entrusted with head-of-state duties and their accompanying family members;\n* Heads of government and their accompanying family members, and cabinet ministers of foreign governments;\n* Diplomatic agents travelling to or from their diplomatic missions or on a temporary mission to Canada;\n* Career consular officers travelling to or from their consular posts or on a temporary mission to Canada;\n* Delegates to the international organizations listed in the Temporary Foreign Worker Guidelines including delegates to conferences convened by the latter, with the exception of clerical staff;\n* Senior officials (Secretary General, Assistant Secretaries General, and holders of equivalent positions, such as President of the Council of the International Civil Aviation Organization) of the international organizations listed in the Temporary Foreign Worker Guidelines;\n* Senior officers (appointed at the P-4 level and above) of the Secretariat of the I.C.A.O.;\n* Persons (spouse, father, mother, children) who are recognized as members of the family forming part of the household of either diplomatic agents travelling to or from their diplomatic missions or on a temporary mission to Canada, or of senior officers of the Secretariat of the International Civil Aviation Organization;\n* Foreign diplomatic couriers; and\n* Special cases, on authorization from Headquarters (Diplomatic Corps Services (XDC))."
    },
    {
      "heading": "U.S. government officials",
      "heading_path": [
        "Temporary residents: Diplomatic and official visas",
        "Diplomatic visas",
        "U.S. government officials"
      ],
      "anchor": "#u-s-government-officials",
      "text": "The following official U.S. government personnel assigned to temporary postings in Canada are not issued diplomatic or official acceptances in Canada and are therefore not eligible for diplomatic visas:\n\n* Department of Homeland Security officers;\n* U.S. Customs officers;\n* International Joint Commission employees; and\n* Inspectors with the Federal Grain Inspection Service of the United States Department of Agriculture and other U.S. government officials in possession of official U.S. government passports and assigned to temporary postings in Canada.\n\nU.S. government employees will be issued work permits under R204 and as such are HRSDC/SC LMO exempt (T10). For more information on the documentation of U.S. government employees, refer to the Temporary Foreign Worker Guidelines."
    },
    {
      "heading": "Official visas",
      "heading_path": [
        "Temporary residents: Diplomatic and official visas",
        "Diplomatic visas",
        "Official visas"
      ],
      "anchor": "#official-visas",
      "text": "Official visas may be granted to persons entitled, under international and domestic law, to official (functional) privileges and immunities, who intend to travel to, or to pass through, Canada for an official purpose and who come within one of the following categories:\n\n* Members of the administrative and technical staff of diplomatic missions or international organizations; consular staff of consular posts; and service staff of diplomatic missions and consular posts in Canada;\n* Officials who hold a diplomatic, official or similar passport, invited by the Government of Canada or a provincial or territorial government for meetings in Canada;\n* Other officials or experts on mission, acting on behalf of the international organizations listed in the Temporary Foreign Worker Guidelines, or contractual employees such as translators hired by the United Nations Organization or the International Civil Aviation Organization for their assemblies;\n* Persons (spouse, father, mother, children) who are recognized as members of the family forming part of the household of persons listed in section (1) above and of \"other officials\" indicated in section (2) above;\n* Private servants of a member of a diplomatic mission or a consular post, but only after a Household Domestic Worker Employment Agreement (refer to the Temporary Foreign Worker Guidelines) has been submitted by the employer to the diplomatic mission or the consular post or GAC Protocol (XDC); and\n* Special cases, on authorization from GAC, Protocol (XDC)."
    },
    {
      "heading": "Courtesy visas",
      "heading_path": [
        "Temporary residents: Diplomatic and official visas",
        "Diplomatic visas",
        "Courtesy visas"
      ],
      "anchor": "#courtesy-visas",
      "text": "Under Canadian law, no person other than those listed above under diplomatic visas or official visas is entitled to diplomatic, consular, or official privileges and immunities. Therefore, all other persons travelling to Canada for the purpose of an official visit, for an international organization or on behalf of a foreign government, other than those situations listed above, may be issued courtesy visas.\n\nOfficers may issue a courtesy visa in the interest of bilateral relations.\n\nCourtesy visas may be issued as multiple-entry visas, with a validity period of up to 3 years.\n\nCriteria for diplomatic or official visas\n-----------------------------------------"
    },
    {
      "heading": "Purpose of a visit",
      "heading_path": [
        "Temporary residents: Diplomatic and official visas",
        "Diplomatic visas",
        "Purpose of a visit"
      ],
      "anchor": "#purpose-of-a-visit",
      "text": "Diplomatic and official visas are not automatically granted to holders of diplomatic, official or similar passports. The purpose of the visit is the primary factor to be considered in determining whether a diplomatic or official visa should be issued. For that reason, it is essential that a written request in the form of a note be received from the Ministry of Foreign Affairs, a diplomatic mission, or a consular post, bearing a signature or initial(s) and an official stamp and clearly defining the purpose of the visit to Canada."
    },
    {
      "heading": "Official visit",
      "heading_path": [
        "Temporary residents: Diplomatic and official visas",
        "Diplomatic visas",
        "Official visit"
      ],
      "anchor": "#official-visit",
      "text": "Ambiguous statements, such as \"special mission\" or \"official visit,\" are not sufficient to justify the issuance of a diplomatic or official visa. The purpose of the visit, as stated in the written request, must clearly be of such an official nature that, insofar as Canada is concerned, it would justify the granting of appropriate privileges and immunities in Canada under domestic law in accordance with the relevant international conventions, headquarters agreements with international organizations, or international customary law.\n\nThe following working definition of \"special mission\" or \"official visit\" should be used in considering a request for a diplomatic or official visa: such a visa is of a temporary nature by a representative of a state, sent by the latter and consented to by Canada for the purpose of dealing with:\n\n* questions of mutual interest,\n* questions pertaining to a diplomatic mission or a consular post of the sending state in Canada, and,\n* questions regarding bilateral or multilateral relations with third states or international organizations, including international conferences hosted by Canada."
    },
    {
      "heading": "Examples where diplomatic visas are justified",
      "heading_path": [
        "Temporary residents: Diplomatic and official visas",
        "Diplomatic visas",
        "Examples where diplomatic visas are justified"
      ],
      "anchor": "#examples-where-diplomatic-visas-are-justified",
      "text": "Examples of situations justifying the issuance of diplomatic visas include:\n\n* a diplomatic agent being assigned to a diplomatic mission in Canada or travelling through Canada on the way to a diplomatic assignment elsewhere;\n* an official visit of a head of state or chief administrative officer (Secretary General, Director, or their Assistants) of the international organizations listed in Temporary Foreign Worker Guidelines."
    },
    {
      "heading": "Examples where official visas are justified",
      "heading_path": [
        "Temporary residents: Diplomatic and official visas",
        "Diplomatic visas",
        "Examples where official visas are justified"
      ],
      "anchor": "#examples-where-official-visas-are-justified",
      "text": "Examples of situations justifying the issuance of official visas include:\n\n* support staff assigned to a diplomatic mission or a consular post in Canada or travelling through Canada on the way to a diplomatic mission or a consular post elsewhere;\n* officials or experts of the United Nations Organization travelling to Canada on United Nations business. Some purposes that may be \"official\" to a sending state will not be regarded necessarily as such by Canada, like buying or selling a diplomatic mission on behalf of a governmental agency, or a fund-raising or electioneering visit to an expatriate community in Canada.\n* government officials travelling to Canada to conduct business with representatives of the Government of Canada or provincial or territorial governments."
    },
    {
      "heading": "Personal status",
      "heading_path": [
        "Temporary residents: Diplomatic and official visas",
        "Diplomatic visas",
        "Personal status"
      ],
      "anchor": "#personal-status",
      "text": "An individual's personal status is not normally a primary consideration for the issuance of a diplomatic or official visa (except for heads of state and other relatively rare instances). For instance, a senior official of a foreign government, travelling on a diplomatic passport, should not be issued a diplomatic visa if the individual intends to enter Canada for commercial negotiations with private enterprises, or on a private visit. In that case, the individual would be issued a regular temporary resident visa, if required, or a courtesy visa, if deemed appropriate. Another instance would be a student who is the child of a diplomatic agent serving outside Canada and who enters Canada solely to pursue their studies. If not exempt from a temporary resident visa, that person would need a regular temporary resident visa before entering Canada and may require a study permit as well. This individual would not be entitled to a diplomatic or official visa although they may hold a diplomatic or special passport."
    },
    {
      "heading": "Diplomatic or official visas on an ordinary passport",
      "heading_path": [
        "Temporary residents: Diplomatic and official visas",
        "Diplomatic visas",
        "Diplomatic or official visas on an ordinary passport"
      ],
      "anchor": "#diplomatic-or-official-visas-on-an-ordinary-passport",
      "text": "A diplomatic or official visa may be inserted in an ordinary passport if the purpose of the visit warrants it, such as when a member of a foreign government, travelling on an ordinary passport, enters Canada as a member on an official mission, or when a private citizen (for example, an academic) is included in a state's delegation to a meeting of the International Civil Aviation Organization or a diplomatic conference in Canada.\n\nDocuments to be submitted\n-------------------------\n\nAn officer may issue a diplomatic or official visa only on receipt of one of the following:\n\n* a written request, as above, from the Ministry of Foreign Affairs of the state to which the head of mission or post is accredited, or for which the diplomatic mission or consular post has jurisdiction in visa matters;\n* a written request, as above, from a diplomatic mission or a consular post of the state of the applicant's citizenship;\n* a written request, as above, by an international organization listed in Temporary Foreign Worker Guidelines in respect of its officials travelling to Canada to carry out official duties; or,\n* in the case of persons entering Canada to take employment as officers of the Secretariat of the International Civil Aviation Organization, a letter to the individual concerned constituting an \"offer of employment,\" indicating their official level at the I.C.A.O. and signed by or on behalf of the Secretary General.\n\nAuthority for issuance\n----------------------"
    },
    {
      "heading": "Policy",
      "heading_path": [
        "Temporary residents: Diplomatic and official visas",
        "Diplomatic visas",
        "Policy"
      ],
      "anchor": "#policy",
      "text": "With the exception of those cases described below, diplomatic agents, consular officers, or immigration officers may issue diplomatic and official visas without reference to Headquarters. However, if they have the slightest doubt regarding the bona fides of an applicant or their entitlement to a diplomatic or official visa, they should refer the request to the appropriate Immigration, Refugees and Citizenship Canada(IRCC) Geographic division and to GAC Protocol."
    },
    {
      "heading": "Categories requiring consultation with IRCC Geographic and GAC Protocol (XDC)",
      "heading_path": [
        "Temporary residents: Diplomatic and official visas",
        "Diplomatic visas",
        "Categories requiring consultation with IRCC Geographic and GAC Protocol (XDC)"
      ],
      "anchor": "#categories-requiring-consultation-with-ircc-geographic-and-gac-protocol-xdc",
      "text": "* Diplomatic agents, consular officers, and immigration officers may not issue diplomatic or official visas to officials of \"special category\" states without prior consultation.\n* Officers should consult whenever there is some doubt or question regarding the issuance of a visa to a person assigned to Canada.\n* Officers should consult on all requests for visas for members of diplomatic missions, consular posts, or other offices in Canada not listed in the latest edition of [Foreign representatives in Canada](http://www.international.gc.ca/protocol-protocole/reps.aspx). There may be other categories of persons or states where, for a temporary period, authority from headquarters will be required before diplomatic or official visas are granted. When such circumstances arise, Protocol (XDC) or IRCC Geographic will provide specific guidance to diplomatic missions and consular posts on request.\n\nIssuance of visas\n-----------------"
    },
    {
      "heading": "Usefulness of diplomatic, official and courtesy visas",
      "heading_path": [
        "Temporary residents: Diplomatic and official visas",
        "Diplomatic visas",
        "Usefulness of diplomatic, official and courtesy visas"
      ],
      "anchor": "#usefulness-of-diplomatic-official-and-courtesy-visas",
      "text": "Persons listed in “Who is entitled to diplomatic, official and courtesy visas?” above, who are within the jurisdiction of the diplomatic mission or consular post and who intend to travel to Canada, should be advised to apply for the appropriate visa or eTA, as applicable.\n\nDiplomatic, official, and courtesy visas, although not equivalent to the right of entry into Canada, are nonetheless the only evidence of Canada's consent to official visits by foreign officials. That consent, under international and domestic law, is a condition of the granting of diplomatic, consular, or official (functional) privileges and immunities (or courtesies) as soon as the holder sets foot on Canadian soil or during transit.\n\nDiplomatic, official and courtesy visas are the only indication to Border Services Officers in Canada that the holder, in Canada's view, may be entitled to diplomatic, consular, or official (functional) privileges and immunities (or courtesies). In that connection, the visa coding and the statement made in \"purpose of stay\" are the essential elements for the issuance of the visas. The possession of an appropriate visa, not the holding of a diplomatic, official or similar passport, is the sole way of ensuring the right processing on arrival in Canada and thereby avoiding unpleasant incidents."
    },
    {
      "heading": "Security checks",
      "heading_path": [
        "Temporary residents: Diplomatic and official visas",
        "Diplomatic visas",
        "Security checks"
      ],
      "anchor": "#security-checks",
      "text": "Although holders of diplomatic visas are, in principle, exempt from immigration and customs inspection on entry into Canada, they are subject to mandatory security checks at Canadian airports. Officers should apprise holders of diplomatic visas of that requirement whenever possible. If necessary, the persons concerned can obtain more details about that requirement from their own diplomatic missions accredited to Canada."
    },
    {
      "heading": "Multiple-entry visas",
      "heading_path": [
        "Temporary residents: Diplomatic and official visas",
        "Diplomatic visas",
        "Multiple-entry visas"
      ],
      "anchor": "#multiple-entry-visas",
      "text": "The period during which a visa is valid is left to the discretion of the officer. That leeway should not be confused with the requirement on the former visa to show the intended duration of stay.\n\nGenerally speaking, diplomats and officials may be issued a multiple-entry visa that is valid for up to **3 years**. Some exceptions may apply. This does **not** apply to foreign officials travelling to Canada to obtain their accreditation in Canada (to assume their diplomatic posting in Canada).\n\nForeign officials travelling to Canada to obtain their accreditation (to assume their diplomatic posting) are issued a multiple-entry TRV that is valid for **3 months**. These applicants should be advised that the duration of the initial entry into Canada is determined by the Canadian official at the border and that the diplomatic mission in Canada should send their passports, along with the required documents, to the Department of Global Affairs, Protocol(XDC), requesting accreditation or recognition. During the validity of the diplomatic or official acceptance, the applicants do not require any other visa to enter Canada.\n\nMultiple-entry diplomatic or official visas must not be issued to persons who are on assignment to Canada without specific authorization from GAC."
    },
    {
      "heading": "Notification to IRCC Geographic Desk and GAC, Protocol",
      "heading_path": [
        "Temporary residents: Diplomatic and official visas",
        "Diplomatic visas",
        "Notification to IRCC Geographic Desk and GAC, Protocol"
      ],
      "anchor": "#notification-to-ircc-geographic-desk-and-gac-protocol",
      "text": "Whenever an officer issues a diplomatic, official, or courtesy visa without prior authorization from Headquarters, but pursuant to standing instructions, and believes the visit would be of interest to Headquarters, they should notify Headquarters of the name and the occupation of the person concerned and the nature and the date of the proposed visit. Notification should be addressed to GAC Protocol and to the appropriate IRCC geographic division and should be marked for distribution to other interested functional divisions or departments. Moreover, the Canadian port of entry should be alerted if that is deemed appropriate.\n\nSummary of procedures for diplomatic and official visas\n-------------------------------------------------------"
    },
    {
      "heading": "Who is entitled to diplomatic or official visas?",
      "heading_path": [
        "Temporary residents: Diplomatic and official visas",
        "Diplomatic visas",
        "Who is entitled to diplomatic or official visas?"
      ],
      "anchor": "#who-is-entitled-to-diplomatic-or-official-visas",
      "text": "* For details refer to [Diplomatic or official temporary resident visas](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/visitors/diplomatic-official-visas.html).\n* In addition, consult the Office of Protocol at GAC. In urgent cases, contact the Immigration Advisor and Liaison Officer"
    },
    {
      "heading": "Ports of entry procedures",
      "heading_path": [
        "Temporary residents: Diplomatic and official visas",
        "Diplomatic visas",
        "Ports of entry procedures"
      ],
      "anchor": "#ports-of-entry-procedures",
      "text": "The Border Service Officer (BSO) will stamp diplomatic or official passports, thereby authorizing entry for a period of six months. Officers will not refer diplomats or officials to secondary examination."
    },
    {
      "heading": "Role of Office of Protocol",
      "heading_path": [
        "Temporary residents: Diplomatic and official visas",
        "Diplomatic visas",
        "Role of Office of Protocol"
      ],
      "anchor": "#role-of-office-of-protocol",
      "text": "* During the six-month period, the person’s foreign mission will forward the passport to the Diplomatic Corps Services Division, Office of Protocol, GAC.\n* The Office of Protocol will issue a diplomatic (D), consular (C), official (J) or international (I) acceptance, which indicates that the person is accredited to Canada and entitled to remain in Canada for the duration of their status."
    },
    {
      "heading": "Visa exemption for accredited persons",
      "heading_path": [
        "Temporary residents: Diplomatic and official visas",
        "Diplomatic visas",
        "Visa exemption for accredited persons"
      ],
      "anchor": "#visa-exemption-for-accredited-persons",
      "text": "Once accredited, these persons do not require a temporary resident visa or an eTA to enter Canada."
    },
    {
      "heading": "Spouses, parents and dependent children of diplomats",
      "heading_path": [
        "Temporary residents: Diplomatic and official visas",
        "Diplomatic visas",
        "Spouses, parents and dependent children of diplomats"
      ],
      "anchor": "#spouses-parents-and-dependent-children-of-diplomats",
      "text": "* People (spouses, fathers, mothers and children) who are recognized as members of the family, forming part of the household, may be granted official visas.\n* Diplomats’, consular officers’, representatives’ and officials’ dependent children who are under 19 years of age and considered to be members of the family, forming part of the household, are issued acceptances.\n* Children over 19 years of age are issued acceptances only if they are registered as full-time students.\n* After turning 25 years of age, dependent children are no longer eligible to receive official acceptance (even if they are still studying) and must change their official status to regular immigration status."
    },
    {
      "heading": "Servants of diplomats",
      "heading_path": [
        "Temporary residents: Diplomatic and official visas",
        "Diplomatic visas",
        "Servants of diplomats"
      ],
      "anchor": "#servants-of-diplomats",
      "text": "**Note:** Members of the official service staff are exempt from the same requirements as foreign representatives (diplomats).\n\nCan be one of the following two types:\n\n* Private servants: are issued official (O-1) visas; will receive an official (J) acceptance from the Office of Protocol; will not require a temporary resident visa if they wish to re-enter; do not require a work permit; must undergo a medical examination, and must provide biometric information if from a country or territory whose nationals are required to do so, but are exempt from the biometric fee.\n* For guidance on employment requirements for diplomatic servants, refer to Temporary Foreign Worker Guidelines.\n* Live-in Caregivers: must meet requirements to be live-in caregivers in Canada; must undergo a medical examination; must provide biometric information if from a country or territory whose nationals are required to do so and must pay the biometric fee; are issued a work permit; do not enjoy any privileges or immunities; require a temporary resident visa to re-enter Canada.\n\nLearn more about the Live-in Caregiver Program in OP14."
    },
    {
      "heading": "Processing fees",
      "heading_path": [
        "Temporary residents: Diplomatic and official visas",
        "Diplomatic visas",
        "Processing fees"
      ],
      "anchor": "#processing-fees",
      "text": "There is no [processing fee for diplomatic visas](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/fees/immigration/temporary-resident-visa-electronic-travel-authorization-applications-fees.html)."
    },
    {
      "heading": "Medical examinations (exemptions)",
      "heading_path": [
        "Temporary residents: Diplomatic and official visas",
        "Diplomatic visas",
        "Medical examinations (exemptions)"
      ],
      "anchor": "#medical-examinations-exemptions",
      "text": "The following people are exempt from having to undergo a medical examination, even if they are from countries where one would normally be required:\n\n* diplomatic and consular officials entering for official duties only\n* spouses and dependent children of diplomatic and consular officials, unless they intend to work\n* members of the armed forces of a country designated under the Visiting Forces Act who are entering for official duties only (see [Countries designated for the purposes of the Visiting Forces Act](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/visitors/countries-designated-purposes-visiting-forces-act.html))"
    },
    {
      "heading": "Biometric information (exemptions)",
      "heading_path": [
        "Temporary residents: Diplomatic and official visas",
        "Diplomatic visas",
        "Biometric information (exemptions)"
      ],
      "anchor": "#biometric-information-exemptions",
      "text": "* Diplomats and officials and their family members who have been issued a D-1 or O-1 visa are exempt from providing biometric information, even if they are from a country or territory whose nationals are normally required to do so.\n* Those issued a courtesy visa are required to provide their biometrics; however, the biometric requirement may be exempted only at the discretion of the Migration Program Manager, in the interest of bilateral relations.\n* Holders of diplomatic or official passports who are nationals of a biometric-required country or territory, and who have been issued a regular TRV, are required to provide their biometric information but are exempt from the biometric fee.\n* Private servants of diplomats and officials must provide their biometric information if they are nationals of a biometric-required country or territory, but are exempt from the biometric fee if their employer is travelling to Canada on official business.\n* Live-in caregivers of diplomats and officials must provide their biometric information when applying for a Temporary resident visa or work permit if they are nationals of a biometric-required country or territory and must pay the biometric fee.\n\nFor further information on the biometric requirement, see [Biometrics collection and screening](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/identity-management/biometrics.html).\n\nPage details\n------------\n\n 2019-06-10"
    }
  ],
  "links": {
    "outbound": [
      "https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/visitors/diplomatic-official-visas.html",
      "http://www.international.gc.ca/protocol-protocole/reps.aspx",
      "https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/fees/immigration/temporary-resident-visa-electronic-travel-authorization-applications-fees.html",
      "https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/visitors/countries-designated-purposes-visiting-forces-act.html",
      "https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/identity-management/biometrics.html"
    ],
    "internal_children": []
  },
  "quality": {
    "is_toc_like": false,
    "is_low_text": false,
    "notes": []
  }
}