{
  "source_id": "pdi_9e8b156b101a",
  "source_type": "guidance_pdi",
  "source_url": "https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/foreign-workers/work-without-permit/employer-compliance-inspections.html",
  "canonical_url": "https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/foreign-workers/work-without-permit/employer-compliance-inspections.html",
  "title": "Employer compliance inspections",
  "language": "en",
  "manual": "Employer compliance inspections",
  "chapter": null,
  "heading_path": [
    "Employer compliance inspections"
  ],
  "last_updated": "2024-07-26",
  "crawl_ts": "2026-02-12T00:00:00Z",
  "http": {
    "status_code": 200,
    "content_type": "text/markdown"
  },
  "content_hash": "0f1c0faf1b9672fe9a59f7e2697bbd6c5f1646f3c4668f71e79fdfb54070018f",
  "raw_html_path": null,
  "markdown_path": "scripts/scraper/ircc_data_clean/employer-compliance-inspections-9e8b156b10.md",
  "text": "Published Time: Thu, 12 Feb 2026 00:45:21 GMT\n\nEmployer compliance inspections\n===============================\n\nThis section contains policy, procedures and guidance used by IRCC staff. It is posted on the department’s website as a courtesy to stakeholders.\n\nUnder the International Mobility Program (IMP), all employers, apart from [those exempted](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/foreign-workers/compliance-exempt-employers.html) from the employer compliance regime, who make an offer of employment to a foreign national referred to in [subparagraph 200(1)(c)(ii.1)](https://laws-lois.justice.gc.ca/eng/regulations/SOR-2002-227/section-200.html) of the Immigration and Refugee Protection Regulations (IRPR) must comply with the conditions imposed under [sections R209.2](http://laws-lois.justice.gc.ca/eng/regulations/SOR-2002-227/section-209.2.html) and [R209.4](https://laws-lois.justice.gc.ca/eng/regulations/SOR-2002-227/section-209.4.html). An employer may be inspected and must ensure they have met these conditions.\n\nFor conditions that relate to the Quarantine Act, the Emergencies Act or the provincial laws that govern public health in response to COVID-19, please refer to [Employer compliance inspections: COVID-19 program delivery](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/service-delivery/coronavirus/compliance.html).\n\nAll employer inspections under the IMP are conducted by Immigration, Refugees and Citizenship Canada (IRCC) employees. Inspections of employers under the Temporary Foreign Worker Program (TFWP) are conducted by employees of Employment and Social Development Canada (ESDC).\n\n**Important:** On September 26, 2022, amendments were made to the Immigration and Refugee Protection Regulations to enhance the protection of temporary foreign workers by setting new employer requirements and conditions and improving the Government of Canada’s ability to hold employers accountable for non-compliance. This includes, but is not limited to, requirements for an employer to provide the most recent information to foreign nationals about their rights in Canada, and provide access to health care services when the worker is injured or becomes ill at the workplace.\n\nOn this page\n------------\n\n* [Overview: Employer inspections under the IMP](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/foreign-workers/work-without-permit/employer-compliance-inspections.html#imp)\n* [Circumstances for an employer inspection](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/foreign-workers/work-without-permit/employer-compliance-inspections.html#employer-inspection)\n* [When to refer a concern to Integrity Risk Management Branch (IRM)](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/foreign-workers/work-without-permit/employer-compliance-inspections.html#t10)\n* [Initiating the inspection or verification](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/foreign-workers/work-without-permit/employer-compliance-inspections.html#initiating-inspection)\n* [Inspection conditions imposed on employers [R209.4]](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/foreign-workers/work-without-permit/employer-compliance-inspections.html#inspection-conditions)\n* [Compliance conditions imposed on employers [R209.2]](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/foreign-workers/work-without-permit/employer-compliance-inspections.html#compliance-conditions)\n* [Assessing compliance conditions](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/foreign-workers/work-without-permit/employer-compliance-inspections.html#assessing-compliance)\n* [Documents that may be used to verify employer compliance](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/foreign-workers/work-without-permit/employer-compliance-inspections.html#employer-compliance)\n* [Decision-making](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/foreign-workers/work-without-permit/employer-compliance-inspections.html#decision-making)\n\nOverview: Employer inspections under the IMP\n--------------------------------------------\n\nEmployers who submitted an offer of employment for which a work permit was issued to a foreign national on or after December 31, 2013, may, under [section R209.5](http://laws-lois.justice.gc.ca/eng/regulations/SOR-2002-227/section-209.5.html) , be inspected for compliance with the conditions set out in the IRPR. An inspection may be initiated from the first day of employment for which a work permit is issued up to a maximum of 6 years thereafter.\n\nInspections are administrative assessments of whether an employer has met the conditions required in the IRPR [R209.2 and R209.4]. If, on the basis of information obtained during an inspection, a final determination is made that an employer violated a regulatory condition and was not justified in doing so [under [subsection R209.2(3)](https://laws-lois.justice.gc.ca/eng/regulations/SOR-2002-227/section-209.2.html), [209.2(3.1)](https://laws-lois.justice.gc.ca/eng/regulations/SOR-2002-227/section-209.2.html), [R209.2(4)](https://laws-lois.justice.gc.ca/eng/regulations/SOR-2002-227/section-209.2.html) or [R209.4(2)](https://laws-lois.justice.gc.ca/eng/regulations/SOR-2002-227/section-209.4.html)] , IRCC must inform the employer of the finding and add their name to the [public list](https://www.canada.ca/en/immigration-refugees-citizenship/services/work-canada/employers-non-compliant.html) (as per sections [R209.996](https://laws-lois.justice.gc.ca/eng/regulations/SOR-2002-227/section-209.996.html) and [R209.997](https://laws-lois.justice.gc.ca/eng/regulations/SOR-2002-227/section-209.997.html)), stating the violation and the penalty.\n\nThe penalty administered is based not only on whether the violation occurred before or after December 1, 2015, but also on the type and severity of the violation for offences committed after December 1, 2015. For offences committed before December 1, 2015, employers will be banned for 2 years from accessing the IMP and TFWP. For violations committed on or after December 1, 2015, employers may receive a warning letter (the employer’s name will not be published on the public list), an administrative monetary penalty and/or a ban from accessing the IMP or TFWP for a specified time.\n\nIn certain circumstances and depending on the severity of the violation, work permits of foreign workers working for employers found non-compliant with any of the conditions following an inspection may be revoked as per the Ministerial Instructions.\n\nCircumstances for an employer inspection\n----------------------------------------\n\nUnder [section R209.5](http://laws-lois.justice.gc.ca/eng/regulations/SOR-2002-227/section-209.5.html), there are 3 circumstances (triggers) for an inspection: known past non-compliance, random selection and reason to suspect.\n\n### Known past non-compliance\n\nAn employer who has previously been found non-compliant with IMP or TFWP conditions.\n\n### Random selection\n\nVerification of employer compliance based on a random selection model.\n\n### Reason to suspect\n\nReceipt of information relating to an employer using the IMP and giving an officer reason to suspect non-compliance with 1 or more of the conditions set out under section R209.2.\n\nInformation may come from a variety of sources, including but not limited to the following:\n\n* an allegation or complaint (a call, letter or email received from a member of the public, stakeholder, the foreign national, etc.)\n* ESDC, the Canada Border Services Agency or another IMP partner\n* diplomatic channels or parliamentarians\n* a non-governmental organization, union or similar organization\n* a province or territory\n* the media (for example, print, radio, television and social media)\n* voluntary disclosure ([IMM 5964](https://www.canada.ca/content/dam/ircc/migration/ircc/english/pdf/kits/forms/imm5964e.pdf)) by the employer (see [our employer resource page](https://www.canada.ca/en/immigration-refugees-citizenship/services/work-canada/hire-temporary-foreign/international-mobility-program/voluntary-disclosure.html) for more information)\n\nAny information received by an officer regarding a situation that could trigger an inspection should be referred to the Integrity Risk Management Branch (IRM), for potential initiation of an inspection.\n\nWhen to refer a concern to Integrity Risk Management Branch (IRM)\n-----------------------------------------------------------------\n\nIf an officer detects any anomalies or patterns of concern during work permit processing, issuance, or anytime thereafter, they are requested to complete the Employer Inspection Tip Referral template (MSG, 70 KB) (available internally only) and submit it to Integrity Risk Management Branch (IRM), Employer Compliance Inspections Unit (ECIU). ECIU will assess the information and determine whether or not an employer inspection is warranted.\n\nSome examples of reasons for using the Tip Referral process:\n\n* the processing officer has concerns or evidence of past non-compliance that the employer **did not meet** any of the following commitments made in a past offer of employment: \n * employment in the same occupation as that set out in the foreign national’s offer of employment\n * similar but not lower wages and benefits than offered\n * working conditions that were substantially the same but not less favourable than those set out in their offer\n\n* information is available (such as a media article according to which an employer is being investigated for labour violations against their workers) indicating that there could be grounds to make a negative determination\n* complaints received that the employer might not have complied with elements listed on the offer of employment, such as underpaying the foreign worker or forcing extra hours or duties\n* concerns that an employer might have provided misleading information on an offer of employment, such as offering a job that did not exist to facilitate a permanent resident application for the foreign worker (**Note:** this could also be grounds to refuse a work permit as the job offer submitted by the employer is not genuine)\n\nInitiating the inspection or verification\n-----------------------------------------\n\nThe IRM will send the employer a letter indicating the following:\n\n* the reason for the inspection, including the inspection trigger and program condition where there is a concern\n* a request for documentation that will provide proof of compliance\n* a request for the employer to provide an indication of their justification as per subsection [R209.2(3) and R209.2(3.1)](https://laws-lois.justice.gc.ca/eng/regulations/SOR-2002-227/section-209.2.html) if applicable, and proof of the justifications if they believe they are non-compliant\n* a deadline for submission of the documentation\n\nInspection conditions imposed on employers [[R209.4](https://laws-lois.justice.gc.ca/eng/regulations/SOR-2002-227/section-209.4.html) ]\n---------------------------------------------------------------------------------------------------------------------------------------\n\nInspections can involve employers having to answer questions and provide documents [[R209.6](https://laws-lois.justice.gc.ca/eng/regulations/SOR-2002-227/section-209.6.html) ], the examination of documents [[R209.7](https://laws-lois.justice.gc.ca/eng/regulations/SOR-2002-227/section-209.7.html)] or on-site inspections [[R209.8](https://laws-lois.justice.gc.ca/eng/regulations/SOR-2002-227/section-209.8.html) ], including interviews with foreign workers or other employees (with their consent).\n\nUnder section R209.4, for the purposes of inspections, employers must make reasonable efforts to do the following:\n\n* report at any specified time and place to answer questions and provide documents, or ensure that a representative is available to provide assistance\n* provide any documents that are requested to verify compliance with specific conditions (employers will be instructed to redact all personal information that IRCC is not authorized to collect)\n* attend any inspection or ensure that a qualified or delegated employee attends any inspection (unless the employer was not notified of it), give all reasonable assistance to the person conducting that inspection and provide that person with any document or information that the person requires\n\n**Note:** An officer may consider that an employer has made reasonable efforts if the employer has done the following:\n\n* met any of the conditions above that are relevant to a particular inspection\n* cooperated to the greatest extent possible during an inspection\n\n### Collection of documents by officers\n\nAs of September 26, 2022, paragraph [R209.7(1)(c)](https://laws-lois.justice.gc.ca/eng/regulations/SOR-2002-227/section-209.7.html) authorizes officers to require any individual or entity to provide any document in their possession that relates to the employer’s compliance with the conditions set out in [R209.2](https://laws-lois.justice.gc.ca/eng/regulations/SOR-2002-227/section-209.2.html) for the purpose of verifying compliance with those conditions.\n\n* Individuals or entities may include, but are not limited to: \n * banks\n * accountants\n * payroll companies\n * recruitment agencies, etc.\n\n* Documents requested may include, but are not limited to, records such as \n * payroll information\n * job description\n * job offer / employment agreement\n * receipts for disbursements\n * records of registration for private health insurance\n * evidence (e.g., email or other correspondence).\n\n* Although consent of the employer is not required, officers must continue to adhere to the Privacy Act and to privacy requirements in their departmental acts by collecting only information that is directly related to and is demonstrably necessary for the intended authorized purpose. Collecting documents from a third party should only be considered in instances where the employer is uncooperative with the inspection (e.g., ignoring requests or refusing to provide documentation requested by an officer).\n* Where an employer would be penalized if they do not make reasonable effort to provide documents requested by an officer, **there is no penalty to third party individuals or entities if they do not provide the documents**.\n\n### On-site inspections\n\nOn-site inspections will be conducted by IRCC’s Domestic Network, after a referral from IRM.\n\nEmployers are required to give all reasonable assistance to personnel conducting the inspection, including the following:\n\n* allowing the officer to use copying equipment or providing copies to the officer as requested\n* allowing the officer to take photographs or make video or audio recordings (with written consent)\n* allowing the officer to examine anything on the premises that is relevant to the inspection\n\nEmployers may be found non-compliant if they refuse to cooperate during an inspection.\n\nThe following are guidelines (a non-exhaustive list) indicating in which circumstances an officer could carry out the on-site component of the inspection:\n\n* when there has been no communication from the employer and the investigator is aware that the business does exist and is operational\n* when there is a lack of communication during the investigation, and the actions of the employer point to avoidance\n* when the investigator has reason to believe that information provided by the employer is not factually accurate, as in the following examples: \n * if an employer provides perfect payroll records after denying having payroll records\n * if evidence suggests that the TFW may be working in a different occupation than what is stated on the offer of employment (for example, an employer attempted to hire a TFW for one position, was denied, and the employer then hired the same TFW for another occupation)\n * if evidence suggests that the employer may have hired the TFW prior to the issuance of the work permit; there is inconsistent information relating to the employment start date\n * if there are safety or security concerns\n\n* when an allegation of abuse has been received\n* when the investigator deems it necessary during the course of the inspection to include an on-site component\n\nCompliance conditions imposed on employers [[R209.2](https://laws-lois.justice.gc.ca/eng/regulations/SOR-2002-227/section-209.2.html)]\n--------------------------------------------------------------------------------------------------------------------------------------\n\nPrior to any work permit application, employers must make the following attestations in order to submit an offer of employment in the Employer Portal or using the IMM 5802 as authorized:\n\nDeclaration of employer (as of September 26, 2022):\n\n* “I attest that I have entered into an employment agreement with the foreign national that provides for employment in the same occupation and the same wages and working conditions as those set out in the offer of employment. I attest that the employment agreement is drafted in the foreign national’s chosen official language of Canada, is signed by myself and the foreign national, and that I have provided a copy of the employment agreement to the foreign national.\n\n* I attest that I have not, directly or indirectly, charged or recovered from the foreign national the fee referred to in subsection 303.1(1) of the Immigration and Refugee Protection Regulations [compliance fee] or any fees related to the recruitment of the foreign national, with the exception of the fees referred to in subsections 296(1), 298(1), and 299(1) of the Immigration and Refugee Protection Regulations [temporary resident visa, temporary resident permit and work permit fees].\n* I attest that I have ensured that any person who recruited the foreign national on my behalf did not, directly or indirectly, charge or recover from the foreign national the fee referred to in subsection 303.1(1) of the Immigration and Refugee Protection Regulations [compliance fee] or any fees related to the recruitment of the foreign national, with the exception of the fees referred to in subsections 296(1), 298(1), and 299(1) of the Immigration and Refugee Protection Regulations [temporary resident visa, temporary resident permit and work permit fees].” \n\nWhen completing the offer of employment, employers also sign indicating the following certifications:\n\n* “I certify that I am actively engaged in the business in respect of which the offer of employment is made and understand that I must remain so during the period of employment for which the work permit is issued to the foreign national.\n* I certify that I am compliant with, and will comply with, the federal/provincial/territorial laws that regulate employment and the recruitment of employees, in the province/territory in which it is intended that the foreign national work and, if applicable, with the terms and conditions of any collective agreement.\n* I certify that I will provide the foreign national with employment in the same occupation as that set out in the foreign national's offer of employment and with wages and working conditions that are substantially the same as—but not less favourable than—those set out in the offer.\n* I certify that I will make reasonable efforts to provide a workplace that is free of abuse which includes physical, sexual, psychological or financial abuse and includes reprisals against foreign nationals.” \n\nFor inspection purposes relating to paragraph [R209.2(1)(b)(i)](https://laws-lois.justice.gc.ca/eng/regulations/SOR-2002-227/section-209.2.html) and the accuracy of the information provided under section [R209.11](https://laws-lois.justice.gc.ca/eng/regulations/SOR-2002-227/section-209.11.html), including the attestations, officers should be aware that the employer must click on the attestations above to submit an offer of employment. Employers are unable to refuse to the attestations and certification above when they submit an offer of employment through the Employer Portal. The IMM 5802 also includes the same attestations and certifications.\n\nIn some circumstances (often but not limited to the context of contract for services), employers could click on the attestations in the Employer Portal and also indicate in a comment text box of the Portal that they have not entered into an employment agreementt wih the foreign national. This information appears in GCMS under the section “Additional Information Tab.” In this scenario, officers may find the employer non-compliant with the regulatory requirements as per subparagraphs R209.11(e)(i)(a) to (c).\n\n### Employment agreement\n\nParagraph R209.11(1)(e) requires employers to provide the temporary worker with a signed employment agreement with the same occupation, wages and working conditions as those set out in the offer of employment before submitting the offer of employment. The employment agreement must be in the official language chosen by the temporary worker. For inspection purposes relating to [paragraph R209.2(1)(b)(i)](https://laws-lois.justice.gc.ca/eng/regulations/SOR-2002-227/section-209.2.html) and the accuracy of the information provided under [section R209.11](https://laws-lois.justice.gc.ca/eng/regulations/SOR-2002-227/section-209.11.html), officers should be aware that in the context of contract for services, the Canadian company (not the foreign company) is the entity who must provide the worker with a signed agreement. This is because it is the Canadian company that creates the need for the temporary worker to enter Canada, even if it is the foreign company that pays the temporary worker. The intent of the employment agreement is not to establish a standard employee–employer relationship as normally understood in the labour force; rather, it aims to make the Canadian company responsible for providing the worker with the same occupation, wages and working conditions as those set out in the offer of employment.\n\n**Note:** There are situations where the job offer may be exempt from having to pay the employer compliance fee. The employer must still submit the attestation above in order to submit the offer of employment.\n\n**Important:** Employers who made attestations before September 26, 2022 will not be subject to same inspection requirements as above. They only sign the following:\n\nDeclaration of employer (prior to September 26, 2022):\n\n* “I certify that I am actively engaged in the business in respect of which the offer of employment is made and understand that I must remain so during the period of employment for which the work permit is issued to the foreign national.\n* I certify that I am compliant with, and will comply with, the federal/provincial/territorial laws that regulate employment and the recruitment of employees, in the province/territory in which it is intended that the foreign national work and, if applicable, with the terms and conditions of any collective agreement.\n* I certify that I will provide the foreign national with employment in the same occupation as that set out in the foreign national's offer of employment and with wages and working conditions that are substantially the same as—but not less favourable than—those set out in the offer.\n* I certify that I will make reasonable efforts to provide a workplace that is free of abuse which includes physical, sexual, psychological or financial abuse.”\n\nThe purpose of an inspection authorized under section [R209.5](https://laws-lois.justice.gc.ca/eng/regulations/SOR-2002-227/section-209.5.html) is to determine if an employer who provided an offer of employment under [subparagraph R200(1)(c)(ii.1)](https://laws-lois.justice.gc.ca/eng/regulations/SOR-2002-227/section-200.html) has complied with the conditions stated in section [R209.2](https://laws-lois.justice.gc.ca/eng/regulations/SOR-2002-227/section-209.2.html). These conditions are imposed automatically on issuance of the associated work permit.\n\nAlthough the conditions are imposed only for the period of the work permit, compliance with the conditions can be inspected up to 6 years after the work permit is issued. During this period, the following conditions can be inspected:\n\n1. The employer must remain actively engaged in the business in respect of which the offer of employment was made [[R209.2(1)(a)(i)](https://laws-lois.justice.gc.ca/eng/regulations/SOR-2002-227/section-209.2.html)].\n2. The employer must provide a copy of the most recent information in the chosen official language regarding the foreign national’s rights in Canada made available by the Government of Canada on or before the first day of work and must make it available to the foreign national in both official languages of Canada during the period of employment [R209.2(1)(a.1) and R209.2(1)(a)(ii.1)].\n3. The employer must comply with the federal and provincial laws that regulate employment and the recruiting of employees, including foreign nationals, in the province in which the foreign national works [R209.2(1)(a)(ii)].\n4. The employer must provide the foreign worker with employment in the same occupation as that set out in the offer of employment and with wages and working conditions that are substantially the same as, but not less favourable than, those in the same offer [R209.2(1)(a)(iii)].\n5. The employer must make reasonable efforts to provide temporary foreign workers with a workplace that is free of abuse [R209.2(1)(a)(iv)] and, more specifically, free of the following: \n 1. physical abuse, including assault and forcible confinement\n 2. sexual abuse, including sexual contact without consent\n 3. psychological abuse, including threats and intimidation\n 4. financial abuse, including fraud and extortion\n 5. reprisals, which consists of any measure taken by or on behalf of an employer against a foreign national that affects their employment or working conditions and that was taken because the foreign national reported that the conditions in R209.2 or [R209.3](https://laws-lois.justice.gc.ca/eng/regulations/SOR-2002-227/section-209.3.html) have not been met or has in good faith cooperated with an inspection. This can include disciplinary measures, demotions, dismissals or threats to take any of these measures. [[R196.2(2)](https://laws-lois.justice.gc.ca/eng/regulations/SOR-2002-227/section-196.2.html)]\n\n6. The employer must make reasonable efforts to provide access to health care services if the foreign national is injured or becomes ill at the work place [R209(2)(a)(viii)].\n7. The employer must not, directly or indirectly, charge or recover from the foreign national the employer compliance fee [referred to in [R303.1(1](https://laws-lois.justice.gc.ca/eng/regulations/SOR-2002-227/section-303.1.html)) or any recruitment fees, with the exception of fees referred to in [R296 (1](https://laws-lois.justice.gc.ca/eng/regulations/SOR-2002-227/section-296.html)), [R298](https://laws-lois.justice.gc.ca/eng/regulations/SOR-2002-227/section-298.html)(1) and [R299(1](https://laws-lois.justice.gc.ca/eng/regulations/SOR-2002-227/section-299.html)). The employer must also ensure that any persons who recruited the foreign national for the employer did not, directly or indirectly, charge or recover the fees described above from the foreign national [R209.2(1)(a)(ix) and R209.2(1)(a)(x)]. The employer must be able to demonstrate for a period of six years beginning on the first day of the period of employment that any information they provided in relation to an offer of employment under section R209.11 or on request of an officer during the associated work permit application [R200(1)(c)(ii.1)] was accurate [R209.2(1)(b)(i)].\n8. The employer must also retain any document that relates to compliance with the imposed conditions under R2092.2(1)(a) [R209.2(1)(b)(ii)].\n\nFor conditions related to the Quarantine Act, the Emergencies Act or provincial or territorial laws that govern public health in response to COVID-19, please refer to [Employer compliance inspections: COVID-19 program delivery](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/service-delivery/coronavirus/compliance.html).\n\nAssessing compliance conditions\n-------------------------------\n\nOfficers can request specific documents or information or ask the employer to provide whatever documents the employer determines are sufficient as proof of their compliance with the conditions. A list of documents that could be provided as proof is available in [Documents that may be used to verify employer compliance](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/foreign-workers/work-without-permit/employer-compliance-inspections.html#employer-compliance).\n\nUpon receipt of the documents and any other information the employer provides as proof of their compliance or justification, an officer will review the documents and information to determine compliance with the conditions.\n\n### Employer is actively engaged in the business [[R209.2(1)(a)(i)]](https://laws-lois.justice.gc.ca/eng/regulations/SOR-2002-227/section-209.2.html)\n\nTo assess whether the employer is actively engaged in the business in which the offer of employment was made, IRCC can request all relevant documentation, including but not limited to a Canada Revenue Agency business number, business licence or permit, the employer’s relevant income documents and any of the following documents as proof of business activity:\n\n* an attestation by a lawyer, notary public or chartered accountant who is a member in good standing of their respective professional body, confirming that the employer is actively engaged\n* an up-to-date commercial lease agreement\n* a formal letter from a legal business other than the employer’s, confirming the existence of a contract for goods or services being provided\n\n### Start-ups\n\nFlexibility for additional documents to be provided can allow for more options for employers trying to prove active engagement. For example, entrepreneurs are given up to 20 months, depending on the jurisdiction and their circumstances, to get their business formally started. If they are not yet providing goods or services, proof of active engagement could include business or investment plans, supply contracts, and such.\n\n**Note:** IRCC will not consider attestations or letters submitted from an employee of the company as proof of business activity.\n\nPublicly available information may also be used to make a determination on the active engagement in business of an employer who has made the offer of employment to the temporary foreign worker. Information sources include the following:\n\n* Internet searches (for instance, Google; Better Business Bureau; Innovation, Science and Economic Development Canada and Canada 411)\n* Provincial websites\n* Employer websites\n* Job Bank advertisements\n\n**Note:** Any extrinsic information (for example, publicly available information) used in making a decision on compliance must be disclosed to the employer by way of a notice of preliminary finding before a final decision of non-compliance is made, and the employer must have an opportunity to respond to this information.\n\n### Compliance with federal, provincial and territorial employment and recruitment legislation [R209.2(1)(a)(ii)]\n\nFor the purpose of inspections, the verification of compliance with federal, provincial and territorial laws should focus on the employer’s compliance record from the date of the work permit issuance.\n\nCompliance in respect of this condition is focused on **any** federal, provincial or territorial laws that regulate employment and recruitment in the province or territory in which the temporary foreign worker works. This includes, for example, labour law areas dealing with health and safety, unfair dismissal, the right to file complaints, leave, and workplace privacy laws. It also includes recruitment laws that regulate the business of employment agencies and recruiters. More examples are provided in the section below.\n\nRegardless of the triggering event, there are specific types of documentation for any federal, provincial or territorial compliance issue that can or should be checked:\n\n* proof of registration, where required by provincial or territorial employment or recruitment legislation for employers and recruiters\n* a workers’ compensation clearance letter, declaring that the employer is registered with the workers’ compensation board and has an account in good standing\n* other relevant official provincial or territorial documentation, including any documentation available directly from a province or territory by way of information-sharing agreements or publicly accessible information\n\nTo meet this condition, employers must comply with the applicable federal, provincial or territorial laws governing employment or recruitment from the date the foreign national starts working and for the duration of their employment. In most cases, information about violations and convictions is readily available online (for example, from federal or provincial websites); however, if extrinsic information (for example, website information not provided by the employer) is used, officers must give the employer an opportunity to respond to any allegations before recommending a finding of non-compliance.\n\n**Note:** It is the employers responsibility to ensure that they are compliant and knowledgeable regarding legislation that applies to them. Officers should note:\n\n* Jurisdictions that require registration/licensing for employers: \n * British Columbia, Saskatchewan, Manitoba, Quebec, New Brunswick, Nova Scotia, Yukon.\n\n* Jurisdictions that require registration/licensing for recruiters: \n * British Columbia, Alberta, Saskatchewan, Manitoba, Quebec, Nova Scotia, Yukon. \n\n#### Examples of federal, provincial and territorial laws\n\nThis is not an exhaustive list. Examples include but are not limited to the following:\n\n* [Canada Labour Code](http://laws-lois.justice.gc.ca/eng/acts/L-2/)\n* [Alberta: Fair Trading Act](http://www.qp.alberta.ca/1266.cfm?page=2012_045.cfm&leg_type=Regs&isbncln=9780779763900)\n* [Alberta: Occupational Health and Safety Act](https://search-ohs-laws.alberta.ca/legislation/occupational-health-and-safety-act/)\n* [British Columbia: Employment Standards Act](https://www.bclaws.gov.bc.ca/civix/document/id/complete/statreg/96113_01)\n* [British Columbia: Workers Compensation Act](http://www.bclaws.ca/Recon/document/ID/freeside/296_97_00)\n* [Manitoba: Worker Recruitment and Protection Act (WRAPA)](http://web2.gov.mb.ca/laws/statutes/2008/c02308e.php)\n* [Manitoba: Workplace Safety and Health Act](https://web2.gov.mb.ca/laws/statutes/ccsm/w210.php?lang=en)\n* [New Brunswick: Employment Standards Act](http://laws.gnb.ca/en/ShowTdm/cs/E-7.2/)\n* [Nova Scotia: Consultation on Temporary Foreign Workers](http://www.gov.ns.ca/lwd/employmentrights/ConsultationonTemporaryForeignWorkers.asp)\n* [Nova Scotia: Guide to the Nova Scotia Labour Standards Code](https://www.novascotia.ca/lae/employmentrights/docs/labourstandardscodeguide.pdf)\n* [Ontario: Employment Protection for Foreign Nationals Act](http://www.e-laws.gov.on.ca/html/statutes/english/elaws_statutes_09e32_e.htm)\n* [Ontario: Employment Standards Act](https://www.ontario.ca/laws/statute/00e41)\n* [Ontario: Occupational Health and Safety Act](http://www.e-laws.gov.on.ca/html/statutes/english/elaws_statutes_90o01_e.htm)\n* Quebec: The province pre-published the [Regulation respecting immigration consultants](https://www.legisquebec.gouv.qc.ca/en/document/cr/I-0.2,%20r.%200.1) , which would require any representative filing an application to its provincial immigration program to fulfil certain criteria (including having an office in Quebec) and be registered with the government\n* [Saskatchewan: The Saskatchewan Employment Act (PDF)](https://publications.saskatchewan.ca/api/v1/products/70351/formats/78194/download)\n* Any other federal, provincial and territorial legislation related to employment standards, occupational health and safety or recruitment as deemed applicable\n\n### Occupation, wages and working conditions [R209.2(1)(a)(iii)]\n\n### Occupation\n\nThe occupation that the foreign worker will hold and the duties they will perform must fall within the description of the National Occupational Classification (NOC) code specified in the offer of employment for the duration of the work permit validity period. If the duties the foreign worker will perform are inconsistent with what was described in the other main duties listed in the offer, the employer may be deemed non-compliant.\n\n### Variance in duties\n\nTo assess whether the employer provided the same occupation as that set out in the offer of employment, officers should take into consideration the following factors with respect to variance in job duties (this list is not exhaustive):\n\n* whether the variation in duties is covered by the same NOC code as that stated in the offer of employment, though those duties may not have been explicitly listed in the offer\n* the amount of time that the foreign worker spent completing the duties listed in the offer versus the variation in duties\n* whether the variation in duties relates to a higher or lower occupation than the job listed in the offer\n* whether appropriate compensation was provided for the time the foreign worker spent completing the variation in duties\n* how close the NOC code associated to the variation in duties is to the NOC code listed on the offer\n* whether the variation in duties is reasonably expected for the position listed in the offer\n\n### Promotion or change of NOC code\n\nIn cases where the employer wishes to promote the foreign worker or otherwise change their duties (for instance, if the offer indicated the worker was a manager but during the validity period of the work permit they ended up working as a director, or if the worker was hired as a technician but they ended up doing an engineering job), the foreign worker should receive a new offer of employment and apply for and be issued a new work permit **before** the change is implemented.\n\nIf a new work permit for the promotion or change in occupation has not been previously approved and the temporary foreign worker is found to be working in an occupation other than that stated on the offer of employment for the work permit that was issued, the employer may be found non-compliant.\n\n### Wages\n\n“Substantially the same, but not less favourable, wages” means the following:\n\n* wages paid cannot be less than those outlined in the offer of employment provided as per section R209.11(e)(i)(A)\n* any unusual deductions (such as transportation costs) should be stated in the offer of employment\n\nWages must be paid even if the worker does not yet have their social insurance number (SIN). Workers must apply for a SIN within 3 days of starting employment but do not have to wait for the SIN to start working. Rather, they are simply required to provide the SIN to the employer within 3 days of receipt.\n\n**Note:** An increase in wages under the IMP may not lead to a finding of non-compliance with respect to providing substantially the same wages under subparagraph [R209.2(1)(a)(iii)](https://laws-lois.justice.gc.ca/eng/regulations/SOR-2002-227/section-209.2.html) . However, wages paid that are higher than those stated in the offer of employment may indicate a change in duties, which could mean a different occupation than that offered. An increase in wages may also result in a finding that the employer did not provide “substantially the same” wages if the increase would have affected the ability of the foreign national to qualify for the Labour Market Impact Assessment (LMIA) exemption.\n\nBased on instructions in the [Employer Portal User Guide](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/partners-service-providers/employer-portal/user-guide.html), the offer of employment requires the input of hourly wages in Canadian dollars. Foreign workers can be paid in Canadian currency or in another legal currency as long as the foreign worker is paid the equivalent Canadian wage stated in the offer throughout the period of employment. The foreign currency must be noted in the “Alternate Compensation Scheme” section of the offer.\n\n### Working conditions\n\n**Note:** When assessing multiple violations within the “working conditions” program condition, such as unpaid overtime **and** unpaid vacation, officers may **assess different violations separately**. When assessing penalties, however, officers cannot count multiple violations within each type of violation. For example, officers would not count unpaid vacation multiple times (such as unpaid Christmas Day, unpaid New Year’s Day, unpaid Canada Day, etc.).\n\n### Working conditions may include non-wage-related remuneration benefits and entitlements specifically detailed in the offer of employment, such as the following:\n\n* location of employment\n* statutory holidays, sick leave and vacation days\n* hours of work (including overtime)\n* transportation costs (where applicable)\n* accommodations, conditions and costs (where applicable)\n* extended health or medical insurance\n* other non-taxable benefits\n\nIf a change in working conditions (such as a reduction in hours or salary) negatively affects a worker, a new offer of employment and a new work permit are required before the change takes effect; otherwise, the employer risks being found non-compliant with the original job offer submitted to IRCC.\n\n**Important:** A change in location, from the location stated on the offer of employment, will be considered non-compliance (that is, **not** “substantially the same”) if it would affect the decision on a work permit application or result in the foreign national working without authorization. For example, a change in location to another province would have a bearing on a work permit that was approved for a provincial nominee, and a fishing guide working on a lake in Canada other than the one specifically stated on the seasonal work permit would be considered to be working without authorization.\n\n**Note:** Many other working conditions and workplace standards (for example, obligations around dismissals and rights to file complaints, occupational health and safety regulations and recruitment laws) are governed by provincial and territorial legislation. Employers of foreign workers must also comply with these laws in order to meet IMP requirements.\n\n### Acceptable changes\n\nEmployers are not required to inform IRCC of changes in working conditions. However, they must provide evidence of an acceptable justification [R209.2(3)] at the time of an inspection should there be differences between the working conditions offered and those found during the inspection.\n\nIf the change in working conditions (such as a reduction in hours or salary) negatively affects the worker, a new offer of employment and a new work permit are required before the change takes effect; otherwise, the employer risks being found non-compliant with the original job offer submitted to IRCC.\n\n### Abuse-free workplace [R209.2(1)(a)(iv)]\n\nThe employer must “make reasonable efforts to provide a workplace that is free of abuse,” within the meaning of [section R196.2(1).](http://laws-lois.justice.gc.ca/eng/regulations/SOR-2002-227/section-196.2.html) The definition of “reasonable efforts” in the context of providing a workplace that is free of abuse is available under the section “Employer efforts to provide abuse-free workplace.”\n\n#### Definition of ‘abuse’\n\n[Section R196.2(1)](http://laws-lois.justice.gc.ca/eng/regulations/SOR-2002-227/section-196.2.html)defines abuse as the following\n\n1. physical abuse, including assault and personal confinement\n2. sexual abuse, including sexual contact without consent\n3. psychological abuse, including threats and intimidation\n4. financial abuse, including fraud and extortion\n5. reprisals, which consists of any measure taken by or on behalf of an employer against a foreign national that affects their employment or working conditions and that was taken because the foreign national reported that the conditions in R209.2 or R209.3 have not be met or has in good faith cooperated with an inspection. [R196.2(2)]\n\n**Note:** Examples of reprisal may include, but are not limited to: reduction of worker’s hours, demotion, early end of contract (dismissal), or threats of the same.\n\n### Charges or convictions for certain criminal offences could lead to an inspection\n\nIn addition to the types of abuse outlined in the IRPR, if IRCC receives information indicating that an IMP employer or one of its employees (a Canadian citizen, permanent resident or temporary foreign worker) has been accused or convicted of any of the following abuse-related crimes, that employer may be inspected (based on the trigger “reason to suspect”) to determine whether reasonable efforts have been made to provide a workplace free of abuse:\n\n* physical or sexual assault in the workplace\n* an offence causing death or bodily harm to an employee\n* trafficking in persons (or a related offence)\n* uttering threats to cause death or bodily harm to an employee\n* harassment in the workplace (including bullying)\n* fraud or extortion against an employee (including withholding pay without reason and paying the employee significantly below what was agreed to in the offer of employment)\n\n### Application of condition\n\nFor the purposes of an inspection, the employer is the person or organization submitting the offer of employment under section [R209.11](https://laws-lois.justice.gc.ca/eng/regulations/SOR-2002-227/section-209.11.html).\n\nWhere an employer holds sole supervisory authority in the workplace (for example, small employers and sole proprietors), they are solely responsible for complying with this condition.\n\nHowever, for larger employers with more complex organizational structures, everyone who is in a supervisory role, particularly those responsible for supervising foreign workers, has a shared responsibility to comply with this condition.\n\nIf abuse is perpetrated by a third party (defined as a person or organization acting on an employer’s behalf, such as a recruiter, consultant or subsidiary), the employer may be found responsible for the actions of that third party. In this case, the employer will be expected to demonstrate efforts to address the abuse perpetrated by the third party.\n\n### Employer efforts to provide abuse-free workplace\n\nTo verify whether reasonable efforts have been made, the following 3 elements will be considered:\n\n1. An employer has made general efforts to prevent workplace abuse.\n2. The employer or anyone in a supervisory role or acting on the employer’s behalf has not actively participated in abuse, including failing to stop abuse of which they had knowledge.\n3. Where an allegation or incident of abuse occurred, steps were taken to address it and prevent it from happening again.\n\nAn employer will be deemed non-compliant where a determination is made of a failure by the employer to demonstrate compliance with any of the elements, including the occurrence of abuse.\n\n#### A. Efforts to prevent workplace abuse in general\n\nIndicators of general efforts made by an employer to prevent workplace abuse may include, but are not limited to, the following:\n\n* development and distribution of policies and procedures that address situations of abuse in the workplace (for example, what to do if an employee or supervisor is aware of or is experiencing abuse)\n* mechanisms to address and resolve workplace abuse, which could include complaints policies and protocols, dispute resolution mechanisms, an employee representative or contact person, employee counselling and anonymous hotlines\n* recent training (within the last 2 years) provided to employees and supervisors to identify and recognize abuse and to address it\n* indication that the employer was aware or should have been aware of the risk of abuse relating to particular staff members or particular situations where workers are or were at risk\n* indication that the employer took reasonable steps to ensure that employees with known abusive or violent tendencies do not have direct contact with foreign workers, and that steps were taken to address it and prevent it from happening again\n\nWhile all employers must make efforts to provide a work environment that is free of abuse and violence, not all employers will have the same types of policies and procedures in place to deal with matters of abuse. The employer must provide sufficient information to enable verification of compliance with the regulatory condition. However, officers can use the indicators listed above in their assessments.\n\n#### B. Information suggesting that abuse in the workplace has occurred\n\n[Subparagraph R209.2(1)(a)(iv)](https://laws-lois.justice.gc.ca/eng/regulations/SOR-2002-227/section-209.2.html) requires employers to make reasonable efforts to provide a workplace free of abuse. In order to meet this condition, employers should be asked to demonstrate efforts taken to prevent abuse generally, as well as any measures taken to respond to specific allegations or instances of abuse that have occurred.\n\nIf an employer is found to be directly responsible for abusing a foreign worker, the employer will be deemed non-compliant and will be subject to applicable consequences. The employer may be considered responsible in situations such as the following:\n\n* The employer, a supervisor or a third party acting on the employer’s behalf has personally abused a foreign worker.\n* There is information to suggest that it is more likely than not that the employer, a supervisor or a third party has directed, encouraged or supported abuse (including failing to act when they have knowledge of abuse) committed by another individual.\n* There is information to suggest that the employer, a supervisor or a third party has taken action to protect the abuser by discouraging or preventing a report of abuse to authorities, suppressing information pertaining to abuse or providing false or misleading information to authorities (including ESDC).\n* There is information to suggest that the employer or a supervisor has knowingly placed another employee, who has been convicted of a violent crime or abuse against an employee and has not undergone a rehabilitation process, in a position that directly interacts with foreign workers.\n\nTo determine whether abuse in the workplace has taken place, IRCC must ensure that all relevant information is taken into consideration and make a determination as to whether it is more likely that abuse occurred or did not occur (on the balance of probabilities). The outcome of any relevant legal procedure, where available, will be considered. Whereas a criminal conviction requires proof beyond a reasonable doubt and can take considerable time following an initial charge, IRCC may initiate an inspection and find an employer non-compliant following an allegation (no criminal conviction is required).\n\nTo determine whether abuse occurred, officers should consider the following information:\n\n* knowledge of a conviction under the Criminal Code for an offence related to abuse of an employee\n* details of any relevant allegation or information as it relates to abuse of an employee that IRCC has received or has been made aware of\n* relevant information, documents or statements gathered from the employer and employees during the course of an inspection\n* relevant information, documents or statements obtained from relevant provincial or federal authorities in accordance with applicable information-sharing agreements\n* relevant information gathered from public sources (for example, relevant media reports, including those with respect to allegations, criminal charges, convictions or provincial offences)\n\nWhere there is evidence of a possible provincial or territorial offence or of criminal behaviour regarding abuse on the part of the employer or other employees, IRCC will notify the relevant authorities in accordance with applicable procedures and directives related to information sharing.\n\n#### C. Efforts to respond to or prevent the reoccurrence of abuse\n\nReasonable efforts to provide a workplace free of abuse, after an incident of abuse or an allegation of abuse for which the employer may not be considered actively responsible, require the employer to demonstrate concrete changes of practice or policy, such as the following:\n\n* indication of relevant disciplinary action, such as the dismissal of a staff member considered to be a risk to cause future abuse\n* modifications made to any of the policies, protocols, training or mechanisms listed in section A, or the creation of policies, protocols, training or mechanisms, etc.\n* other organizational changes to improve the awareness, safety or protection of individuals, such as additional security measures (locks, lights, individuals on call, etc.)\n* new reporting factors (for example, managers’ performance reviews that are based on the implementation of new abuse awareness policies)\n* full cooperation with the relevant authorities investigating allegations or instances of abuse\n\nFor this element, the employer must provide satisfactory responses to requests made in accordance with the department’s inspection authorities. Where IRCC has determined that abuse has occurred, the onus is on the employer to provide sufficient evidence of reasonable efforts to prevent abuse from reoccurring. In addition, where IRCC has determined that there is not sufficient evidence to conclude that abuse has occurred, but that there is sufficient information to cause reasonable concern that abuse may have occurred, the onus is also on the employer to provide sufficient evidence of compliance with this element.\n\nTo demonstrate sufficient efforts to respond to actual instances of workplace abuse, employers must be able to explain the specific actions taken. Such actions could include some or all of the following:\n\n* assessment of the facts\n* provision of support measures for the person who made the allegation (for example, receipts for medical care or counselling)\n* where appropriate, referral to relevant federal or provincial authorities (for example, the police)\n* result and action taken (for example, firing the perpetrating employee or ensuring they will not have contact with temporary foreign workers)\n* employer follow-up with the victim(s)\n* follow-up on the effectiveness of any changes made\n\n### Access to health care services [R209.2(1)(a)(viii)]\n\nAs of September 26, 2022, employers must be able to demonstrate that they made reasonable efforts to provide access to health care services if a foreign national becomes ill or is injured at the work place. Reasonable efforts could include:\n\n* calling for emergency services (e.g., 911)\n* arranging a doctor appointment or visit to walk-in clinic\n* seeking or providing first aid if necessary, including rescue breathing and CPR until emergency help arrives\n* having the worker assessed by the health and safety officer on site (if applicable)\n\nThis list is not exhaustive and reasonable efforts will vary depending on the situation and illness. **Employers are not expected to pay for transportation to a health facility but are expected to make it accessible, such as calling a taxi**.\n\n**Note:** When a person becomes ill or injured at work, scenarios and responses can vary. In any situation, it is required of employers to have in place the means for personnel to report any injuries or illnesses to a supervisor(s) or another worker(s) right away who have the means to contact local emergency, such as having a nearby phone to call ‘911’ and/or having a supervisor/colleague commute the injured or ill worker to a local hospital or clinic.\n\nIf the worker does not need emergency services, employers are still required to make other efforts, such as having first aid kits made both accessible and nearby, guidelines for staff (e.g., “What to do in the event of an injury…”) and/or having someone accompany the worker to a local clinic.\n\nThe longer work-related injuries go unreported, the harder it will be to prove that the injuries were from the workplace itself. As a result, the employer is expected to respond to the injury/illness the same day it is observed.\n\nIf a worker becomes sick or injured when working from home (remotely and physically in Canada), the employer is required to adhere to this requirement by any means possible. For example, see that the worker can first and foremost tend to their injury and leave work, and that the employer call ‘911’ and direct emergency services to the worker’s place of residence, if needed.\n\n### No charging or recovering recruitment or employer compliance fees [R209.2(1)(a)(ix & x)]\n\nAs of September 26, 2022, under [R209.11 (e](https://laws-lois.justice.gc.ca/eng/regulations/SOR-2002-227/section-209.11.html)), when employers are submitting an offer of employment, they must **attest** that neither they, nor any person who recruited the foreign national on their behalf, have, directly or indirectly, charged or recovered from the foreign national employer compliance fees [[R303.1(1)](https://laws-lois.justice.gc.ca/eng/regulations/SOR-2002-227/section-303.1.html)] or recruitment fees, except immigration processing fees related to the application.\n\nDuring the period of employment, employers and any persons who recruited the foreign national on their behalf can not directly or indirectly charge or recover from the foreign national the employer compliance fee [R303.1(1)] or recruitment fees, except immigration processing fees related to the application.\n\n#### Fees definition\n\nThe terms “**fees related to employment services**” or “**recruitment fees**” refer to **any fees or costs incurred in the recruitment process in order for workers to secure employment or placement**, regardless of the manner, timing, amount or location of their imposition or collection.\n\nThese fees may be one-time or recurring and cover recruiting, referral, or placement services. They could also include advertising, disseminating information, arranging interviews, submitting documents for government clearances, confirming credentials, organizing travel and transportation, or placement into employment.\n\nExamples of prohibited recruitment fees include:\n\n* payments for recruitment services offered by labour recruiters, whether public or private, in matching offers of and applications for employment—placement fees, “cash-for-jobs” schemes\n* payments made in the case of recruitment of workers with a view to employing them to perform work for a third party—fees that a foreign national must pay for assistance with finding employment in Canada\n* payments made in the case of direct recruitment by the employer—any expenses incurred by the employer that are integral to the recruitment of the foreign national\n* payments to recover recruitment fees from workers—fees that an employer must pay for assistance or advice in the hiring of foreign nationals, including the referral of foreign nationals for employment\n\nThis definition also addresses “illegitimate, unreasonable and undisclosed costs:” extra-contractual, undisclosed, inflated or illicit costs are never legitimate. Examples of these costs include bribes, tributes, extortion or kickback payments, bonds, illicit cost-recovery fees, and collaterals required by any actor in the recruitment chain.\n\n**A person who recruits for the employer** includes anyone who:\n\n* finds or attempts to find an individual for employment with the employer;\n* assists another person in finding or attempting to find an individual for employment with the employer; or\n* refers a foreign national to another person who finds or attempts to find an individual for employment with the employer.\n\n**Recruitment services** means services that consist of:\n\n* seeking or obtaining employment for a client;\n* assisting or advising any person with respect to seeking or obtaining employment for a client;\n* assisting or advising an employer or another person with respect to hiring a client; or\n* referring a client to another person who offers any of the services referred to above.\n\n**Indirect charging or recovery** refers to measures taken by an employer or anyone recruiting on their behalf to receive compensation for recruitment fees from a foreign national without explicitly charging or deducting from wages for this purpose. These measures include but are not limited to:\n\n* varying or reducing benefits or conditions of a foreign national’s employment\n* requiring a foreign national to perform additional tasks on a “volunteer” basis for business or non-business related activities to the benefit of the employer or recruiter\n* requiring the foreign worker to live in accommodation provided by the employer or recruiter at above-market rents\n* in the case of entities providing immigration services to the foreign nationals to be hired while also acting as a recruiter for the employer, overcharging for the immigration services provided to the foreign nationals\n\n### Provide information on a foreign worker’s rights [R209.2(1)(a.1)]\n\nFor each period of employment for which a work permit is issued, on or before the first day of work, the employer must share information provided by the Government of Canada. This requirement also applies to employers who continued to employ a foreign national on a work permit extension (i.e., foreign national working for the same employer) after September 26, 2022.\n\n**Note:** “First day of work” is considered when the foreign national reports for work either virtually or in person for the first time after work permit issuance during the period of the work permit.\n\n#### Make available the information on the foreign national’s rights [R209.2(1)(a)(ii.1)]\n\nThe employer is required to ensure that this information is also available to the worker during the period of employment in both official languages of Canada. This means that the information should be readily available at the workplace of the foreign national throughout their period of employment. This could include providing the information on paper or in an electronic format, as long as the information is easily visible, accessible to the foreign national and without additional cost to them, and without needing to go through the employer.\n\nFor example, the employer may post the information in an “accessible location,” such as a cafeteria or break room, or a company website. Such a location may be physical or virtual, so long as it is one that is easy for the worker to access and where the worker is likely to spend time regularly.\n\nThe employer can share the information electronically in this situation; it is imperative to have unencumbered access to the digital site where this information can be found, as well as a reliable internet connection and access to a computer.\n\nExamples of these situations could include where an employer has a company landing page where bulletins and important information is posted.\n\n### Verifying the accuracy of information provided [R209.2(1)(b)(i)]\n\nEmployers must be able to demonstrate that the information they provided in the offer of employment [[R209.11](https://laws-lois.justice.gc.ca/eng/regulations/SOR-2002-227/section-209.11.html)] or at the request of an officer during the work permit application process was accurate at the time of submission.\n\nInaccurate information is considered false, incorrect or misleading information, or omitted information that the employer was required to provide.\n\n**Note:** The offer of employment information must be provided to IRCC **before** the foreign national makes an application for a work permit [R209.11]. Employers must provide all accurate information pertaining to the offer in the fields provided in the Employer Portal. The Employer Portal does not allow for “attached documents,” and any references made by the employer to documents attached to the work permit application will not be considered as part of the offer of employment submitted to IRCC. If the offer is not complete, the employer may be required to resubmit a properly completed offer in the Employer Portal before the work permit can be issued, or the work permit application may be refused.\n\nGenerally, for compliance inspections, accuracy should be reviewed only if there is reason to suspect the employer may have provided inaccurate information in the offer of employment or when the work permit was processed.\n\nTo make a determination that the information was inaccurate, there should be evidence that, at the time of submission, the information was inaccurate. There may be some indication that the employer may have been attempting to circumvent requirements or induce an error in the administration of the Act. However, officers need only be satisfied that the information was inaccurate at the time it was submitted and do not need to examine the intent of the employer.\n\n**Note:** This is a verification of the accuracy of the information provided in the offer of employment submitted by the employer or in submissions during the work permit application process and is not a reassessment of the work permit issuance. Therefore, as part of an inspection, the employer should be asked only to demonstrate the accuracy of information already provided.\n\nAccuracy of information applies to **all sections of the offer of employment** and includes all information provided and declarations made during work permit processing.\n\nFactors to consider include the following:\n\n* Employers are responsible for ensuring that all the information submitted in their offer of employment and all documents submitted during work permit processing were accurate at the time of submission.\n* It must be recognized that honest errors and misunderstandings sometimes occur in completing offers of employment fields and in responding to questions.\n* Inaccurate facts are not restricted to facts directly applicable to employer conditions (for example, wages and benefits), but apply to any field in the offer of employment (for example, an explanation of the LMIA exemption, the size of the business, declarations).\n\nOfficers must apply the aforementioned guidelines designed to support the consistent and fair application of the accuracy of information section. It is not possible to provide an exhaustive list of all scenarios. In each case, all the relevant information and the circumstances should be carefully considered.\n\nThe following situations would generally constitute inaccuracy in the offer of employment or during work permit processing:\n\n* The employer indicates in the offer that the duration of employment will be 24 months but signs a contract with the temporary worker before the work permit is issued for only 12 months.\n* The employer enters a higher wage on the offer submitted to IRCC than that actually paid to the worker.\n* The employer states “not applicable” in the benefits field, when the benefits are actually being provided by a foreign employer.\n* The employer signed the declaration that they are compliant with the provincial or territorial laws but knows that it has been charged with, or received a citation for, a provincial or territorial labour infraction.\n\nAn employer who submitted inaccurate information is justified if they made reasonable efforts to comply, as per [subsection R209.2(4)](https://laws-lois.justice.gc.ca/eng/regulations/SOR-2002-227/section-209.2.html).\n\nThe following would generally constitute examples where the employer made reasonable efforts to provide accurate information:\n\n* In the offer of employment, the employer submitted an alternative compensation scheme because the wages were to be paid by a foreign entity or a third party, but the wage information proved to be incorrect; therefore, the employer tried to obtain and verify the wage information from the foreign entity or third party.\n* The employer is paying a foreign company to service equipment, which the foreign worker is fulfilling. In the offer, the employer indicates that the foreign worker’s salary is the contract amount that is being paid to the foreign company. During the inspection, the employer states that they were unaware of the actual amount the foreign company is paying the worker, so they just indicated the contract amount in the salary section of the offer.\n* The foreign worker is not performing standard work hours (for example, 8 hours per day), but the employer indicates standard work hours in the offer of employment. During the inspection, the employer provides a contract indicating the actual non-standard work hours, which are also reflected in the timesheets and payroll statements. The employer mentions they thought they needed to put standard hours in the offer.\n* The foreign national is being paid an annual salary, and the employer incorrectly calculates a higher hourly rate than the actual amount in the offer. The contract indicates the correct annual salary, and the payroll reflects the same. The employer mentions they made an error in calculating the salary and indicates what the actual hourly rate should have been in the offer.\n\n#### Changes to the offer of employment after the work permit is issued\n\nTypically, a foreign worker does not need a new work permit unless there has been a change to the conditions that affect the worker (for example, a change in the employer, the occupation or the location).\n\nIf, after a foreign worker has started working, the employer wishes to make changes to their salary or benefits, the employer cannot amend the benefit information in the offer of employment that was submitted to IRCC after the work permit application has been submitted by the foreign national.\n\nProactive notification to IRCC of changes to such aspects of the foreign worker’s employment is not required under the IMP. However, the employer who provided the offer on which the work permit is based is still responsible for ensuring that the wages and benefits **are consistent with what was stated** in the offer of employment. Employers may be inspected on the conditions listed above; therefore, they will have to provide proof at the time of inspection that they met these conditions or provide a justification for why they did not. The employer **must keep all documents** related to any changes in the original offer of employment submitted to IRCC.\n\nEmployers who have concerns that they are not meeting conditions of the offer of employment can use the [voluntary disclosure](https://www.canada.ca/en/immigration-refugees-citizenship/services/work-canada/hire-temporary-foreign/international-mobility-program/voluntary-disclosure.html) process. In addition, there are certain situations where an officer may have changed the information in the work permit when processing (see [changes between the offer of employment and the work permit application](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/foreign-workers/eligibility/employer-specific-labout-market-impact-assessment-exemptions.html#t9)).\n\nWhere it is determined that an employer has provided false, inaccurate or misleading information on the offer of employment, knowingly omitted information or knowingly provided false or misleading information during an inspection, IRCC may find that the employer did not make reasonable efforts to comply with the condition and that they are therefore non-compliant.\n\n### Document retention by employers [R209.2(1)(b)(ii)]\n\nThe compliance regulations enable IRCC to compel employers to produce documents for the purpose of verifying compliance. Employers are required to retain all documents from the first day of the associated work permit issuance to 6 years thereafter to substantiate the accuracy of information provided in the offer of employment and to demonstrate their compliance with the conditions outlined above in the section: “[Compliance conditions imposed on employers [R209.2]](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/foreign-workers/work-without-permit/employer-compliance-inspections.html#compliance-conditions).”\n\nDocuments employers should retain include, but are not limited to, those related to the hiring and employment of each foreign national they hire. Examples include, but are not limited to, such records as payroll information, job description, job offer/employment agreement, receipts for disbursements, records of registration for private health insurance, evidence (e.g., email or other correspondence) that the employer made reasonable efforts to determine that the recruiter they used is not charging fees. Employers must be able to demonstrate that any information they provided under section [209.11](https://laws-lois.justice.gc.ca/eng/regulations/SOR-2002-227/section-209.11.html) [as well as information provided in the offer of employment ([200(1)(c)(ii.1](https://laws-lois.justice.gc.ca/fra/reglements/DORS-2002-227/section-200.html))] was accurate. As a result, employers should retain the employment agreement signed by the employer and the foreign national.\n\nDocuments that may be used to verify employer compliance\n--------------------------------------------------------\n\nEmployers must cooperate and provide documents as requested in order to demonstrate compliance. Information must always be collected following departmental information collection authorities and privacy laws. In some cases, certain information provided by the employer will need to be redacted (for example, social insurance numbers or other information that is not relevant to an inspection).\n\nDocuments employers may be asked to provide to demonstrate compliance include the following:\n\n* **Business licence or permit, T2 Schedule 125 Income Statement Information, T2 Schedule 100 Balance Sheet Information, commercial lease agreement, etc.:** To demonstrate that the job offer for foreign workers is genuine and that the employer is actively engaged in the business in which the offer was made. In addition to these documents, a T4 Summary of Remuneration Paid may be used to support the total wages paid to a foreign worker.\n* **Provincial or territorial employer and recruiter registration certificate or licence (where applicable):** To demonstrate compliance with federal and provincial or territorial employment and recruitment legislation.\n* **Anti-abuse policies, codes of employee conduct, guidelines provided to staff, protection or support protocols to staff, training, steps taken to resolve complaints of abuse, anti-harassment policies, protocols, etc.:** Evidence that the employer has made reasonable efforts to provide a workplace free of abuse (in assessing this, all available information will be weighed).\n* **Payroll records:** To ensure the appropriate prevailing wage and overtime are being paid and deductions are being made (Canada Pension Plan, employment insurance, income tax), to explain any non-standard deductions and to ensure the working hours match those stated in the offer.\n* **Cancelled cheques paid to the worker, money orders or bank statements:** To determine whether employers have provided temporary foreign workers with wages, working conditions and appropriate compensation.\n* **Time sheets:** To ensure workers are working the number of hours set out in their offer of employment (in most cases, this is usually defined as 30 or more hours per week).\n* **A job description:** To ensure foreign workers are working in the same occupation as that stated in the offer, the NOC matches the occupation, the occupation qualifies under the LMIA exemption and the occupation follows Canadian labour standards.\n* **Registration with provincial or territorial workplace safety insurance or workers' compensation clearance letter (if applicable):** To ensure the employer has registered for workplace safety insurance and is in good standing, to ensure that workers are covered in case of injury.\n* **Travel itinerary or invoices (if applicable):** To determine if an employer provided round-trip transportation costs for foreign workers under their employment.\n* **Accommodation information (if applicable):** Where the employer is providing accommodation, a copy of the rental agreement.\n* **Confirmation of insurance coverage (if applicable):** Proof the employer paid for insurance as indicated on the offer of employment (the documentation provided as proof of payment should not include financial account numbers).\n\n**Employment agreement:** Employers may be required to submit a copy of the jointly signed agreement during an inspection to demonstrate compliance.\n\n**Note:** This is not an exhaustive list. Employers should keep a record of all documentation in order to demonstrate compliance with program requirements.\n\nDecision-making\n---------------\n\nThe [instrument of designation and delegation](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/legislation.html) designates specific positions within IRCC as decision makers in regard to inspections and determinations.\n\n### Justifications\n\nSubsections [R209.2(3)](https://laws-lois.justice.gc.ca/eng/regulations/SOR-2002-227/section-209.2.html) and [R209.2(3.1)](https://laws-lois.justice.gc.ca/eng/regulations/SOR-2002-227/section-209.2.html#:~:text=Marginal%20note%3A-,Justification,-(3.1)%C2%A0A) set out specific justifications that may apply if an employer has not complied with conditions imposed under sections [R209.2](https://laws-lois.justice.gc.ca/eng/regulations/SOR-2002-227/section-209.2.html) and [R209.4](https://laws-lois.justice.gc.ca/eng/regulations/SOR-2002-227/section-209.4.html).\n\nThese justifications include the following:\n\n1. change in a federal, provincial or territorial law (for example, an increase in the minimum wage)\n2. change to a collective agreement (for example, an increase or decrease in salary)\n3. changes in economic conditions impacting all employees equally (for example, an economic downturn causing layoffs)\n4. error in interpretation made in good faith if the employer subsequently provided compensation (for example, missed vacation pay)\n5. unintentional accounting or administrative error if the employer subsequently provided compensation (for example, wrong compensation value entered into the payroll system)\n6. circumstances similar to points (a) to (e), which may require compensation if they are similar to point (d) or (e)\n7. force majeure (for example, a fire or flood destroys a place of business)\n\n#### Compensation\n\nIn order to benefit from justification, compensation or efforts to compensate must be demonstrated before a preliminary decision is made. Otherwise, compensation or efforts to compensate will be considered only in point calculation.\n\nThe IRPR require that, if it is determined that the actual wages paid are different from those set out in the offer of employment and the reason is due to circumstances similar to point (d) or (e), the employer must either provide compensation or (if compensation is not possible) demonstrate sufficient efforts to do so. During an inspection, the employer must inform IRCC of any compensation that has been provided to **all** temporary foreign workers who suffered a disadvantage resulting from the employer’s error.\n\nCompensation may not be possible in the event of a dramatic change in economic conditions that directly impacts the business, in the event of force majeure, or in the event that the temporary foreign worker has already gone home, in which case the employer must demonstrate sufficient efforts to contact the foreign worker to provide compensation.\n\n#### Efforts to compensate\n\nWhere applicable, the employer must be able to demonstrate that they made sufficient efforts to provide compensation (for example, cancelled schedules paid to the worker or attempted correspondence with the worker). If the employer cannot demonstrate sufficient efforts, they may be deemed non-compliant.\n\n[R209.2](https://laws-lois.justice.gc.ca/eng/regulations/SOR-2002-227/section-209.2.html)(3.1) sets out specific justifications that may apply if an employer has not complied with conditions imposed under sections R209.2 (1)(a)(ix) and (x). If the fees referred to in [R209.2](https://laws-lois.justice.gc.ca/eng/regulations/SOR-2002-227/section-209.2.html) (1)(a)(ix) and (x) were incorrectly charged or recovered from the foreign national directly or indirectly, the employer must have made all reasonable efforts to comply with the conditions and must have subsequently provided full compensation to the foreign national for any such fees in order for their failure to comply to be justified.\n\n### Inspection result: compliant, compliant with justification or non-compliant\n\nBased on a review of all available information, possible inspection outcomes are the following:\n\n* **Compliant:** The employer has complied with all conditions reviewed as set out in the regulations or has provided sufficient evidence that their failure to meet all the conditions as set out in paragraph R209.2(1)(a) is justified because it results from one of the situations identified in subsections R209.2(3), R209.2(3.1)R209.2(4) and [R209.4(2).](https://laws-lois.justice.gc.ca/eng/regulations/SOR-2002-227/section-209.4.html)\n* **Compliant with justification:** An employer’s failure to comply with the conditions set out in paragraph R209.2(1)(b) is justified because the employer made all reasonable efforts to comply with the conditions as per subsection R209.2(4). In the case of conditions set out in section R209.4, non-compliance may also be justified if it results from anything done or omitted to be done by the employer in good faith as per subsection R209.4(2).\n* **Non-compliant:** The employer fails to demonstrate that they are in compliance with the conditions under the IRPR, and the failure is not justified. Non-compliance is determined where the employer submitted documentation or information that, when assessed, indicates that the employer has not complied with one or more of the conditions in section R209.2 and that one of the following applies: \n * The employer has failed to provide an acceptable justification.\n * The justification provided requires the employer to undertake compensation and the employer has not done so.\n\n* A finding of non-compliance may also be made if an employer refuses to provide requested documentation or is otherwise uncooperative during an inspection as per section R209.4.\n* For information on assessing administrative monetary penalties or periods of ineligibility (bans) in regard to hiring foreign workers, refer to [Application of consequences where an employer is found non-compliant with the conditions](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/foreign-workers/work-without-permit/application-consequences-where-employer-found-non-compliant-conditions.html).\n\n**Note:** The examples of non-compliance outlined above are not all-encompassing, and analysts may encounter other irregularities that could lead to a recommendation of non-compliance.\n\nRelated links\n-------------\n\n* [Assessing the genuineness of the offer of employment on a work permit application – R200(5)](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/foreign-workers/genuineness.html)\n* [Public list of employers who have been non-compliant](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/foreign-workers/eligibility/public-list-employers-who-have-been-non-compliant.html)\n* [Employer-specific work permits with Labour Market Impact Assessment exemptions](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/foreign-workers/eligibility/employer-specific-labout-market-impact-assessment-exemptions.html)\n* [Open work permits for vulnerable workers](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/foreign-workers/vulnerable-workers.html)\n\nPage details\n------------\n\n 2024-07-26",
  "sections": [
    {
      "heading": "Employer compliance inspections",
      "heading_path": [
        "Employer compliance inspections"
      ],
      "anchor": "#employer-compliance-inspections",
      "text": "Published Time: Thu, 12 Feb 2026 00:45:21 GMT\n\nEmployer compliance inspections\n===============================\n\nThis section contains policy, procedures and guidance used by IRCC staff. It is posted on the department’s website as a courtesy to stakeholders.\n\nUnder the International Mobility Program (IMP), all employers, apart from [those exempted](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/foreign-workers/compliance-exempt-employers.html) from the employer compliance regime, who make an offer of employment to a foreign national referred to in [subparagraph 200(1)(c)(ii.1)](https://laws-lois.justice.gc.ca/eng/regulations/SOR-2002-227/section-200.html) of the Immigration and Refugee Protection Regulations (IRPR) must comply with the conditions imposed under [sections R209.2](http://laws-lois.justice.gc.ca/eng/regulations/SOR-2002-227/section-209.2.html) and [R209.4](https://laws-lois.justice.gc.ca/eng/regulations/SOR-2002-227/section-209.4.html). An employer may be inspected and must ensure they have met these conditions.\n\nFor conditions that relate to the Quarantine Act, the Emergencies Act or the provincial laws that govern public health in response to COVID-19, please refer to [Employer compliance inspections: COVID-19 program delivery](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/service-delivery/coronavirus/compliance.html).\n\nAll employer inspections under the IMP are conducted by Immigration, Refugees and Citizenship Canada (IRCC) employees. Inspections of employers under the Temporary Foreign Worker Program (TFWP) are conducted by employees of Employment and Social Development Canada (ESDC).\n\n**Important:** On September 26, 2022, amendments were made to the Immigration and Refugee Protection Regulations to enhance the protection of temporary foreign workers by setting new employer requirements and conditions and improving the Government of Canada’s ability to hold employers accountable for non-compliance. This includes, but is not limited to, requirements for an employer to provide the most recent information to foreign nationals about their rights in Canada, and provide access to health care services when the worker is injured or becomes ill at the workplace.\n\nOn this page\n------------\n\n* [Overview: Employer inspections under the IMP](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/foreign-workers/work-without-permit/employer-compliance-inspections.html#imp)\n* [Circumstances for an employer inspection](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/foreign-workers/work-without-permit/employer-compliance-inspections.html#employer-inspection)\n* [When to refer a concern to Integrity Risk Management Branch (IRM)](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/foreign-workers/work-without-permit/employer-compliance-inspections.html#t10)\n* [Initiating the inspection or verification](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/foreign-workers/work-without-permit/employer-compliance-inspections.html#initiating-inspection)\n* [Inspection conditions imposed on employers [R209.4]](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/foreign-workers/work-without-permit/employer-compliance-inspections.html#inspection-conditions)\n* [Compliance conditions imposed on employers [R209.2]](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/foreign-workers/work-without-permit/employer-compliance-inspections.html#compliance-conditions)\n* [Assessing compliance conditions](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/foreign-workers/work-without-permit/employer-compliance-inspections.html#assessing-compliance)\n* [Documents that may be used to verify employer compliance](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/foreign-workers/work-without-permit/employer-compliance-inspections.html#employer-compliance)\n* [Decision-making](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/foreign-workers/work-without-permit/employer-compliance-inspections.html#decision-making)\n\nOverview: Employer inspections under the IMP\n--------------------------------------------\n\nEmployers who submitted an offer of employment for which a work permit was issued to a foreign national on or after December 31, 2013, may, under [section R209.5](http://laws-lois.justice.gc.ca/eng/regulations/SOR-2002-227/section-209.5.html) , be inspected for compliance with the conditions set out in the IRPR. An inspection may be initiated from the first day of employment for which a work permit is issued up to a maximum of 6 years thereafter.\n\nInspections are administrative assessments of whether an employer has met the conditions required in the IRPR [R209.2 and R209.4]. If, on the basis of information obtained during an inspection, a final determination is made that an employer violated a regulatory condition and was not justified in doing so [under [subsection R209.2(3)](https://laws-lois.justice.gc.ca/eng/regulations/SOR-2002-227/section-209.2.html), [209.2(3.1)](https://laws-lois.justice.gc.ca/eng/regulations/SOR-2002-227/section-209.2.html), [R209.2(4)](https://laws-lois.justice.gc.ca/eng/regulations/SOR-2002-227/section-209.2.html) or [R209.4(2)](https://laws-lois.justice.gc.ca/eng/regulations/SOR-2002-227/section-209.4.html)] , IRCC must inform the employer of the finding and add their name to the [public list](https://www.canada.ca/en/immigration-refugees-citizenship/services/work-canada/employers-non-compliant.html) (as per sections [R209.996](https://laws-lois.justice.gc.ca/eng/regulations/SOR-2002-227/section-209.996.html) and [R209.997](https://laws-lois.justice.gc.ca/eng/regulations/SOR-2002-227/section-209.997.html)), stating the violation and the penalty.\n\nThe penalty administered is based not only on whether the violation occurred before or after December 1, 2015, but also on the type and severity of the violation for offences committed after December 1, 2015. For offences committed before December 1, 2015, employers will be banned for 2 years from accessing the IMP and TFWP. For violations committed on or after December 1, 2015, employers may receive a warning letter (the employer’s name will not be published on the public list), an administrative monetary penalty and/or a ban from accessing the IMP or TFWP for a specified time.\n\nIn certain circumstances and depending on the severity of the violation, work permits of foreign workers working for employers found non-compliant with any of the conditions following an inspection may be revoked as per the Ministerial Instructions.\n\nCircumstances for an employer inspection\n----------------------------------------\n\nUnder [section R209.5](http://laws-lois.justice.gc.ca/eng/regulations/SOR-2002-227/section-209.5.html), there are 3 circumstances (triggers) for an inspection: known past non-compliance, random selection and reason to suspect."
    },
    {
      "heading": "Known past non-compliance",
      "heading_path": [
        "Employer compliance inspections",
        "Known past non-compliance"
      ],
      "anchor": "#known-past-non-compliance",
      "text": "An employer who has previously been found non-compliant with IMP or TFWP conditions."
    },
    {
      "heading": "Random selection",
      "heading_path": [
        "Employer compliance inspections",
        "Known past non-compliance",
        "Random selection"
      ],
      "anchor": "#random-selection",
      "text": "Verification of employer compliance based on a random selection model."
    },
    {
      "heading": "Reason to suspect",
      "heading_path": [
        "Employer compliance inspections",
        "Known past non-compliance",
        "Reason to suspect"
      ],
      "anchor": "#reason-to-suspect",
      "text": "Receipt of information relating to an employer using the IMP and giving an officer reason to suspect non-compliance with 1 or more of the conditions set out under section R209.2.\n\nInformation may come from a variety of sources, including but not limited to the following:\n\n* an allegation or complaint (a call, letter or email received from a member of the public, stakeholder, the foreign national, etc.)\n* ESDC, the Canada Border Services Agency or another IMP partner\n* diplomatic channels or parliamentarians\n* a non-governmental organization, union or similar organization\n* a province or territory\n* the media (for example, print, radio, television and social media)\n* voluntary disclosure ([IMM 5964](https://www.canada.ca/content/dam/ircc/migration/ircc/english/pdf/kits/forms/imm5964e.pdf)) by the employer (see [our employer resource page](https://www.canada.ca/en/immigration-refugees-citizenship/services/work-canada/hire-temporary-foreign/international-mobility-program/voluntary-disclosure.html) for more information)\n\nAny information received by an officer regarding a situation that could trigger an inspection should be referred to the Integrity Risk Management Branch (IRM), for potential initiation of an inspection.\n\nWhen to refer a concern to Integrity Risk Management Branch (IRM)\n-----------------------------------------------------------------\n\nIf an officer detects any anomalies or patterns of concern during work permit processing, issuance, or anytime thereafter, they are requested to complete the Employer Inspection Tip Referral template (MSG, 70 KB) (available internally only) and submit it to Integrity Risk Management Branch (IRM), Employer Compliance Inspections Unit (ECIU). ECIU will assess the information and determine whether or not an employer inspection is warranted.\n\nSome examples of reasons for using the Tip Referral process:\n\n* the processing officer has concerns or evidence of past non-compliance that the employer **did not meet** any of the following commitments made in a past offer of employment: \n * employment in the same occupation as that set out in the foreign national’s offer of employment\n * similar but not lower wages and benefits than offered\n * working conditions that were substantially the same but not less favourable than those set out in their offer\n\n* information is available (such as a media article according to which an employer is being investigated for labour violations against their workers) indicating that there could be grounds to make a negative determination\n* complaints received that the employer might not have complied with elements listed on the offer of employment, such as underpaying the foreign worker or forcing extra hours or duties\n* concerns that an employer might have provided misleading information on an offer of employment, such as offering a job that did not exist to facilitate a permanent resident application for the foreign worker (**Note:** this could also be grounds to refuse a work permit as the job offer submitted by the employer is not genuine)\n\nInitiating the inspection or verification\n-----------------------------------------\n\nThe IRM will send the employer a letter indicating the following:\n\n* the reason for the inspection, including the inspection trigger and program condition where there is a concern\n* a request for documentation that will provide proof of compliance\n* a request for the employer to provide an indication of their justification as per subsection [R209.2(3) and R209.2(3.1)](https://laws-lois.justice.gc.ca/eng/regulations/SOR-2002-227/section-209.2.html) if applicable, and proof of the justifications if they believe they are non-compliant\n* a deadline for submission of the documentation\n\nInspection conditions imposed on employers [[R209.4](https://laws-lois.justice.gc.ca/eng/regulations/SOR-2002-227/section-209.4.html) ]\n---------------------------------------------------------------------------------------------------------------------------------------\n\nInspections can involve employers having to answer questions and provide documents [[R209.6](https://laws-lois.justice.gc.ca/eng/regulations/SOR-2002-227/section-209.6.html) ], the examination of documents [[R209.7](https://laws-lois.justice.gc.ca/eng/regulations/SOR-2002-227/section-209.7.html)] or on-site inspections [[R209.8](https://laws-lois.justice.gc.ca/eng/regulations/SOR-2002-227/section-209.8.html) ], including interviews with foreign workers or other employees (with their consent).\n\nUnder section R209.4, for the purposes of inspections, employers must make reasonable efforts to do the following:\n\n* report at any specified time and place to answer questions and provide documents, or ensure that a representative is available to provide assistance\n* provide any documents that are requested to verify compliance with specific conditions (employers will be instructed to redact all personal information that IRCC is not authorized to collect)\n* attend any inspection or ensure that a qualified or delegated employee attends any inspection (unless the employer was not notified of it), give all reasonable assistance to the person conducting that inspection and provide that person with any document or information that the person requires\n\n**Note:** An officer may consider that an employer has made reasonable efforts if the employer has done the following:\n\n* met any of the conditions above that are relevant to a particular inspection\n* cooperated to the greatest extent possible during an inspection"
    },
    {
      "heading": "Collection of documents by officers",
      "heading_path": [
        "Employer compliance inspections",
        "Known past non-compliance",
        "Collection of documents by officers"
      ],
      "anchor": "#collection-of-documents-by-officers",
      "text": "As of September 26, 2022, paragraph [R209.7(1)(c)](https://laws-lois.justice.gc.ca/eng/regulations/SOR-2002-227/section-209.7.html) authorizes officers to require any individual or entity to provide any document in their possession that relates to the employer’s compliance with the conditions set out in [R209.2](https://laws-lois.justice.gc.ca/eng/regulations/SOR-2002-227/section-209.2.html) for the purpose of verifying compliance with those conditions.\n\n* Individuals or entities may include, but are not limited to: \n * banks\n * accountants\n * payroll companies\n * recruitment agencies, etc.\n\n* Documents requested may include, but are not limited to, records such as \n * payroll information\n * job description\n * job offer / employment agreement\n * receipts for disbursements\n * records of registration for private health insurance\n * evidence (e.g., email or other correspondence).\n\n* Although consent of the employer is not required, officers must continue to adhere to the Privacy Act and to privacy requirements in their departmental acts by collecting only information that is directly related to and is demonstrably necessary for the intended authorized purpose. Collecting documents from a third party should only be considered in instances where the employer is uncooperative with the inspection (e.g., ignoring requests or refusing to provide documentation requested by an officer).\n* Where an employer would be penalized if they do not make reasonable effort to provide documents requested by an officer, **there is no penalty to third party individuals or entities if they do not provide the documents**."
    },
    {
      "heading": "On-site inspections",
      "heading_path": [
        "Employer compliance inspections",
        "Known past non-compliance",
        "On-site inspections"
      ],
      "anchor": "#on-site-inspections",
      "text": "On-site inspections will be conducted by IRCC’s Domestic Network, after a referral from IRM.\n\nEmployers are required to give all reasonable assistance to personnel conducting the inspection, including the following:\n\n* allowing the officer to use copying equipment or providing copies to the officer as requested\n* allowing the officer to take photographs or make video or audio recordings (with written consent)\n* allowing the officer to examine anything on the premises that is relevant to the inspection\n\nEmployers may be found non-compliant if they refuse to cooperate during an inspection.\n\nThe following are guidelines (a non-exhaustive list) indicating in which circumstances an officer could carry out the on-site component of the inspection:\n\n* when there has been no communication from the employer and the investigator is aware that the business does exist and is operational\n* when there is a lack of communication during the investigation, and the actions of the employer point to avoidance\n* when the investigator has reason to believe that information provided by the employer is not factually accurate, as in the following examples: \n * if an employer provides perfect payroll records after denying having payroll records\n * if evidence suggests that the TFW may be working in a different occupation than what is stated on the offer of employment (for example, an employer attempted to hire a TFW for one position, was denied, and the employer then hired the same TFW for another occupation)\n * if evidence suggests that the employer may have hired the TFW prior to the issuance of the work permit; there is inconsistent information relating to the employment start date\n * if there are safety or security concerns\n\n* when an allegation of abuse has been received\n* when the investigator deems it necessary during the course of the inspection to include an on-site component\n\nCompliance conditions imposed on employers [[R209.2](https://laws-lois.justice.gc.ca/eng/regulations/SOR-2002-227/section-209.2.html)]\n--------------------------------------------------------------------------------------------------------------------------------------\n\nPrior to any work permit application, employers must make the following attestations in order to submit an offer of employment in the Employer Portal or using the IMM 5802 as authorized:\n\nDeclaration of employer (as of September 26, 2022):\n\n* “I attest that I have entered into an employment agreement with the foreign national that provides for employment in the same occupation and the same wages and working conditions as those set out in the offer of employment. I attest that the employment agreement is drafted in the foreign national’s chosen official language of Canada, is signed by myself and the foreign national, and that I have provided a copy of the employment agreement to the foreign national.\n\n* I attest that I have not, directly or indirectly, charged or recovered from the foreign national the fee referred to in subsection 303.1(1) of the Immigration and Refugee Protection Regulations [compliance fee] or any fees related to the recruitment of the foreign national, with the exception of the fees referred to in subsections 296(1), 298(1), and 299(1) of the Immigration and Refugee Protection Regulations [temporary resident visa, temporary resident permit and work permit fees].\n* I attest that I have ensured that any person who recruited the foreign national on my behalf did not, directly or indirectly, charge or recover from the foreign national the fee referred to in subsection 303.1(1) of the Immigration and Refugee Protection Regulations [compliance fee] or any fees related to the recruitment of the foreign national, with the exception of the fees referred to in subsections 296(1), 298(1), and 299(1) of the Immigration and Refugee Protection Regulations [temporary resident visa, temporary resident permit and work permit fees].” \n\nWhen completing the offer of employment, employers also sign indicating the following certifications:\n\n* “I certify that I am actively engaged in the business in respect of which the offer of employment is made and understand that I must remain so during the period of employment for which the work permit is issued to the foreign national.\n* I certify that I am compliant with, and will comply with, the federal/provincial/territorial laws that regulate employment and the recruitment of employees, in the province/territory in which it is intended that the foreign national work and, if applicable, with the terms and conditions of any collective agreement.\n* I certify that I will provide the foreign national with employment in the same occupation as that set out in the foreign national's offer of employment and with wages and working conditions that are substantially the same as—but not less favourable than—those set out in the offer.\n* I certify that I will make reasonable efforts to provide a workplace that is free of abuse which includes physical, sexual, psychological or financial abuse and includes reprisals against foreign nationals.” \n\nFor inspection purposes relating to paragraph [R209.2(1)(b)(i)](https://laws-lois.justice.gc.ca/eng/regulations/SOR-2002-227/section-209.2.html) and the accuracy of the information provided under section [R209.11](https://laws-lois.justice.gc.ca/eng/regulations/SOR-2002-227/section-209.11.html), including the attestations, officers should be aware that the employer must click on the attestations above to submit an offer of employment. Employers are unable to refuse to the attestations and certification above when they submit an offer of employment through the Employer Portal. The IMM 5802 also includes the same attestations and certifications.\n\nIn some circumstances (often but not limited to the context of contract for services), employers could click on the attestations in the Employer Portal and also indicate in a comment text box of the Portal that they have not entered into an employment agreementt wih the foreign national. This information appears in GCMS under the section “Additional Information Tab.” In this scenario, officers may find the employer non-compliant with the regulatory requirements as per subparagraphs R209.11(e)(i)(a) to (c)."
    },
    {
      "heading": "Employment agreement",
      "heading_path": [
        "Employer compliance inspections",
        "Known past non-compliance",
        "Employment agreement"
      ],
      "anchor": "#employment-agreement",
      "text": "Paragraph R209.11(1)(e) requires employers to provide the temporary worker with a signed employment agreement with the same occupation, wages and working conditions as those set out in the offer of employment before submitting the offer of employment. The employment agreement must be in the official language chosen by the temporary worker. For inspection purposes relating to [paragraph R209.2(1)(b)(i)](https://laws-lois.justice.gc.ca/eng/regulations/SOR-2002-227/section-209.2.html) and the accuracy of the information provided under [section R209.11](https://laws-lois.justice.gc.ca/eng/regulations/SOR-2002-227/section-209.11.html), officers should be aware that in the context of contract for services, the Canadian company (not the foreign company) is the entity who must provide the worker with a signed agreement. This is because it is the Canadian company that creates the need for the temporary worker to enter Canada, even if it is the foreign company that pays the temporary worker. The intent of the employment agreement is not to establish a standard employee–employer relationship as normally understood in the labour force; rather, it aims to make the Canadian company responsible for providing the worker with the same occupation, wages and working conditions as those set out in the offer of employment.\n\n**Note:** There are situations where the job offer may be exempt from having to pay the employer compliance fee. The employer must still submit the attestation above in order to submit the offer of employment.\n\n**Important:** Employers who made attestations before September 26, 2022 will not be subject to same inspection requirements as above. They only sign the following:\n\nDeclaration of employer (prior to September 26, 2022):\n\n* “I certify that I am actively engaged in the business in respect of which the offer of employment is made and understand that I must remain so during the period of employment for which the work permit is issued to the foreign national.\n* I certify that I am compliant with, and will comply with, the federal/provincial/territorial laws that regulate employment and the recruitment of employees, in the province/territory in which it is intended that the foreign national work and, if applicable, with the terms and conditions of any collective agreement.\n* I certify that I will provide the foreign national with employment in the same occupation as that set out in the foreign national's offer of employment and with wages and working conditions that are substantially the same as—but not less favourable than—those set out in the offer.\n* I certify that I will make reasonable efforts to provide a workplace that is free of abuse which includes physical, sexual, psychological or financial abuse.”\n\nThe purpose of an inspection authorized under section [R209.5](https://laws-lois.justice.gc.ca/eng/regulations/SOR-2002-227/section-209.5.html) is to determine if an employer who provided an offer of employment under [subparagraph R200(1)(c)(ii.1)](https://laws-lois.justice.gc.ca/eng/regulations/SOR-2002-227/section-200.html) has complied with the conditions stated in section [R209.2](https://laws-lois.justice.gc.ca/eng/regulations/SOR-2002-227/section-209.2.html). These conditions are imposed automatically on issuance of the associated work permit.\n\nAlthough the conditions are imposed only for the period of the work permit, compliance with the conditions can be inspected up to 6 years after the work permit is issued. During this period, the following conditions can be inspected:\n\n1. The employer must remain actively engaged in the business in respect of which the offer of employment was made [[R209.2(1)(a)(i)](https://laws-lois.justice.gc.ca/eng/regulations/SOR-2002-227/section-209.2.html)].\n2. The employer must provide a copy of the most recent information in the chosen official language regarding the foreign national’s rights in Canada made available by the Government of Canada on or before the first day of work and must make it available to the foreign national in both official languages of Canada during the period of employment [R209.2(1)(a.1) and R209.2(1)(a)(ii.1)].\n3. The employer must comply with the federal and provincial laws that regulate employment and the recruiting of employees, including foreign nationals, in the province in which the foreign national works [R209.2(1)(a)(ii)].\n4. The employer must provide the foreign worker with employment in the same occupation as that set out in the offer of employment and with wages and working conditions that are substantially the same as, but not less favourable than, those in the same offer [R209.2(1)(a)(iii)].\n5. The employer must make reasonable efforts to provide temporary foreign workers with a workplace that is free of abuse [R209.2(1)(a)(iv)] and, more specifically, free of the following: \n 1. physical abuse, including assault and forcible confinement\n 2. sexual abuse, including sexual contact without consent\n 3. psychological abuse, including threats and intimidation\n 4. financial abuse, including fraud and extortion\n 5. reprisals, which consists of any measure taken by or on behalf of an employer against a foreign national that affects their employment or working conditions and that was taken because the foreign national reported that the conditions in R209.2 or [R209.3](https://laws-lois.justice.gc.ca/eng/regulations/SOR-2002-227/section-209.3.html) have not been met or has in good faith cooperated with an inspection. This can include disciplinary measures, demotions, dismissals or threats to take any of these measures. [[R196.2(2)](https://laws-lois.justice.gc.ca/eng/regulations/SOR-2002-227/section-196.2.html)]\n\n6. The employer must make reasonable efforts to provide access to health care services if the foreign national is injured or becomes ill at the work place [R209(2)(a)(viii)].\n7. The employer must not, directly or indirectly, charge or recover from the foreign national the employer compliance fee [referred to in [R303.1(1](https://laws-lois.justice.gc.ca/eng/regulations/SOR-2002-227/section-303.1.html)) or any recruitment fees, with the exception of fees referred to in [R296 (1](https://laws-lois.justice.gc.ca/eng/regulations/SOR-2002-227/section-296.html)), [R298](https://laws-lois.justice.gc.ca/eng/regulations/SOR-2002-227/section-298.html)(1) and [R299(1](https://laws-lois.justice.gc.ca/eng/regulations/SOR-2002-227/section-299.html)). The employer must also ensure that any persons who recruited the foreign national for the employer did not, directly or indirectly, charge or recover the fees described above from the foreign national [R209.2(1)(a)(ix) and R209.2(1)(a)(x)]. The employer must be able to demonstrate for a period of six years beginning on the first day of the period of employment that any information they provided in relation to an offer of employment under section R209.11 or on request of an officer during the associated work permit application [R200(1)(c)(ii.1)] was accurate [R209.2(1)(b)(i)].\n8. The employer must also retain any document that relates to compliance with the imposed conditions under R2092.2(1)(a) [R209.2(1)(b)(ii)].\n\nFor conditions related to the Quarantine Act, the Emergencies Act or provincial or territorial laws that govern public health in response to COVID-19, please refer to [Employer compliance inspections: COVID-19 program delivery](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/service-delivery/coronavirus/compliance.html).\n\nAssessing compliance conditions\n-------------------------------\n\nOfficers can request specific documents or information or ask the employer to provide whatever documents the employer determines are sufficient as proof of their compliance with the conditions. A list of documents that could be provided as proof is available in [Documents that may be used to verify employer compliance](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/foreign-workers/work-without-permit/employer-compliance-inspections.html#employer-compliance).\n\nUpon receipt of the documents and any other information the employer provides as proof of their compliance or justification, an officer will review the documents and information to determine compliance with the conditions."
    },
    {
      "heading": "Employer is actively engaged in the business [[R209.2(1)(a)(i)]](https://laws-lois.justice.gc.ca/eng/regulations/SOR-2002-227/section-209.2.html)",
      "heading_path": [
        "Employer compliance inspections",
        "Known past non-compliance",
        "Employer is actively engaged in the business [[R209.2(1)(a)(i)]](https://laws-lois.justice.gc.ca/eng/regulations/SOR-2002-227/section-209.2.html)"
      ],
      "anchor": "#employer-is-actively-engaged-in-the-business-r209-2-1-a-i-https-laws-lois-justice-gc-ca-eng-regulations-sor-2002-227-section-209-2-html",
      "text": "To assess whether the employer is actively engaged in the business in which the offer of employment was made, IRCC can request all relevant documentation, including but not limited to a Canada Revenue Agency business number, business licence or permit, the employer’s relevant income documents and any of the following documents as proof of business activity:\n\n* an attestation by a lawyer, notary public or chartered accountant who is a member in good standing of their respective professional body, confirming that the employer is actively engaged\n* an up-to-date commercial lease agreement\n* a formal letter from a legal business other than the employer’s, confirming the existence of a contract for goods or services being provided"
    },
    {
      "heading": "Start-ups",
      "heading_path": [
        "Employer compliance inspections",
        "Known past non-compliance",
        "Start-ups"
      ],
      "anchor": "#start-ups",
      "text": "Flexibility for additional documents to be provided can allow for more options for employers trying to prove active engagement. For example, entrepreneurs are given up to 20 months, depending on the jurisdiction and their circumstances, to get their business formally started. If they are not yet providing goods or services, proof of active engagement could include business or investment plans, supply contracts, and such.\n\n**Note:** IRCC will not consider attestations or letters submitted from an employee of the company as proof of business activity.\n\nPublicly available information may also be used to make a determination on the active engagement in business of an employer who has made the offer of employment to the temporary foreign worker. Information sources include the following:\n\n* Internet searches (for instance, Google; Better Business Bureau; Innovation, Science and Economic Development Canada and Canada 411)\n* Provincial websites\n* Employer websites\n* Job Bank advertisements\n\n**Note:** Any extrinsic information (for example, publicly available information) used in making a decision on compliance must be disclosed to the employer by way of a notice of preliminary finding before a final decision of non-compliance is made, and the employer must have an opportunity to respond to this information."
    },
    {
      "heading": "Compliance with federal, provincial and territorial employment and recruitment legislation [R209.2(1)(a)(ii)]",
      "heading_path": [
        "Employer compliance inspections",
        "Known past non-compliance",
        "Compliance with federal, provincial and territorial employment and recruitment legislation [R209.2(1)(a)(ii)]"
      ],
      "anchor": "#compliance-with-federal-provincial-and-territorial-employment-and-recruitment-legislation-r209-2-1-a-ii",
      "text": "For the purpose of inspections, the verification of compliance with federal, provincial and territorial laws should focus on the employer’s compliance record from the date of the work permit issuance.\n\nCompliance in respect of this condition is focused on **any** federal, provincial or territorial laws that regulate employment and recruitment in the province or territory in which the temporary foreign worker works. This includes, for example, labour law areas dealing with health and safety, unfair dismissal, the right to file complaints, leave, and workplace privacy laws. It also includes recruitment laws that regulate the business of employment agencies and recruiters. More examples are provided in the section below.\n\nRegardless of the triggering event, there are specific types of documentation for any federal, provincial or territorial compliance issue that can or should be checked:\n\n* proof of registration, where required by provincial or territorial employment or recruitment legislation for employers and recruiters\n* a workers’ compensation clearance letter, declaring that the employer is registered with the workers’ compensation board and has an account in good standing\n* other relevant official provincial or territorial documentation, including any documentation available directly from a province or territory by way of information-sharing agreements or publicly accessible information\n\nTo meet this condition, employers must comply with the applicable federal, provincial or territorial laws governing employment or recruitment from the date the foreign national starts working and for the duration of their employment. In most cases, information about violations and convictions is readily available online (for example, from federal or provincial websites); however, if extrinsic information (for example, website information not provided by the employer) is used, officers must give the employer an opportunity to respond to any allegations before recommending a finding of non-compliance.\n\n**Note:** It is the employers responsibility to ensure that they are compliant and knowledgeable regarding legislation that applies to them. Officers should note:\n\n* Jurisdictions that require registration/licensing for employers: \n * British Columbia, Saskatchewan, Manitoba, Quebec, New Brunswick, Nova Scotia, Yukon.\n\n* Jurisdictions that require registration/licensing for recruiters: \n * British Columbia, Alberta, Saskatchewan, Manitoba, Quebec, Nova Scotia, Yukon."
    },
    {
      "heading": "Examples of federal, provincial and territorial laws",
      "heading_path": [
        "Employer compliance inspections",
        "Known past non-compliance",
        "Compliance with federal, provincial and territorial employment and recruitment legislation [R209.2(1)(a)(ii)]",
        "Examples of federal, provincial and territorial laws"
      ],
      "anchor": "#examples-of-federal-provincial-and-territorial-laws",
      "text": "This is not an exhaustive list. Examples include but are not limited to the following:\n\n* [Canada Labour Code](http://laws-lois.justice.gc.ca/eng/acts/L-2/)\n* [Alberta: Fair Trading Act](http://www.qp.alberta.ca/1266.cfm?page=2012_045.cfm&leg_type=Regs&isbncln=9780779763900)\n* [Alberta: Occupational Health and Safety Act](https://search-ohs-laws.alberta.ca/legislation/occupational-health-and-safety-act/)\n* [British Columbia: Employment Standards Act](https://www.bclaws.gov.bc.ca/civix/document/id/complete/statreg/96113_01)\n* [British Columbia: Workers Compensation Act](http://www.bclaws.ca/Recon/document/ID/freeside/296_97_00)\n* [Manitoba: Worker Recruitment and Protection Act (WRAPA)](http://web2.gov.mb.ca/laws/statutes/2008/c02308e.php)\n* [Manitoba: Workplace Safety and Health Act](https://web2.gov.mb.ca/laws/statutes/ccsm/w210.php?lang=en)\n* [New Brunswick: Employment Standards Act](http://laws.gnb.ca/en/ShowTdm/cs/E-7.2/)\n* [Nova Scotia: Consultation on Temporary Foreign Workers](http://www.gov.ns.ca/lwd/employmentrights/ConsultationonTemporaryForeignWorkers.asp)\n* [Nova Scotia: Guide to the Nova Scotia Labour Standards Code](https://www.novascotia.ca/lae/employmentrights/docs/labourstandardscodeguide.pdf)\n* [Ontario: Employment Protection for Foreign Nationals Act](http://www.e-laws.gov.on.ca/html/statutes/english/elaws_statutes_09e32_e.htm)\n* [Ontario: Employment Standards Act](https://www.ontario.ca/laws/statute/00e41)\n* [Ontario: Occupational Health and Safety Act](http://www.e-laws.gov.on.ca/html/statutes/english/elaws_statutes_90o01_e.htm)\n* Quebec: The province pre-published the [Regulation respecting immigration consultants](https://www.legisquebec.gouv.qc.ca/en/document/cr/I-0.2,%20r.%200.1) , which would require any representative filing an application to its provincial immigration program to fulfil certain criteria (including having an office in Quebec) and be registered with the government\n* [Saskatchewan: The Saskatchewan Employment Act (PDF)](https://publications.saskatchewan.ca/api/v1/products/70351/formats/78194/download)\n* Any other federal, provincial and territorial legislation related to employment standards, occupational health and safety or recruitment as deemed applicable"
    },
    {
      "heading": "Occupation",
      "heading_path": [
        "Employer compliance inspections",
        "Known past non-compliance",
        "Occupation"
      ],
      "anchor": "#occupation",
      "text": "The occupation that the foreign worker will hold and the duties they will perform must fall within the description of the National Occupational Classification (NOC) code specified in the offer of employment for the duration of the work permit validity period. If the duties the foreign worker will perform are inconsistent with what was described in the other main duties listed in the offer, the employer may be deemed non-compliant."
    },
    {
      "heading": "Variance in duties",
      "heading_path": [
        "Employer compliance inspections",
        "Known past non-compliance",
        "Variance in duties"
      ],
      "anchor": "#variance-in-duties",
      "text": "To assess whether the employer provided the same occupation as that set out in the offer of employment, officers should take into consideration the following factors with respect to variance in job duties (this list is not exhaustive):\n\n* whether the variation in duties is covered by the same NOC code as that stated in the offer of employment, though those duties may not have been explicitly listed in the offer\n* the amount of time that the foreign worker spent completing the duties listed in the offer versus the variation in duties\n* whether the variation in duties relates to a higher or lower occupation than the job listed in the offer\n* whether appropriate compensation was provided for the time the foreign worker spent completing the variation in duties\n* how close the NOC code associated to the variation in duties is to the NOC code listed on the offer\n* whether the variation in duties is reasonably expected for the position listed in the offer"
    },
    {
      "heading": "Promotion or change of NOC code",
      "heading_path": [
        "Employer compliance inspections",
        "Known past non-compliance",
        "Promotion or change of NOC code"
      ],
      "anchor": "#promotion-or-change-of-noc-code",
      "text": "In cases where the employer wishes to promote the foreign worker or otherwise change their duties (for instance, if the offer indicated the worker was a manager but during the validity period of the work permit they ended up working as a director, or if the worker was hired as a technician but they ended up doing an engineering job), the foreign worker should receive a new offer of employment and apply for and be issued a new work permit **before** the change is implemented.\n\nIf a new work permit for the promotion or change in occupation has not been previously approved and the temporary foreign worker is found to be working in an occupation other than that stated on the offer of employment for the work permit that was issued, the employer may be found non-compliant."
    },
    {
      "heading": "Wages",
      "heading_path": [
        "Employer compliance inspections",
        "Known past non-compliance",
        "Wages"
      ],
      "anchor": "#wages",
      "text": "“Substantially the same, but not less favourable, wages” means the following:\n\n* wages paid cannot be less than those outlined in the offer of employment provided as per section R209.11(e)(i)(A)\n* any unusual deductions (such as transportation costs) should be stated in the offer of employment\n\nWages must be paid even if the worker does not yet have their social insurance number (SIN). Workers must apply for a SIN within 3 days of starting employment but do not have to wait for the SIN to start working. Rather, they are simply required to provide the SIN to the employer within 3 days of receipt.\n\n**Note:** An increase in wages under the IMP may not lead to a finding of non-compliance with respect to providing substantially the same wages under subparagraph [R209.2(1)(a)(iii)](https://laws-lois.justice.gc.ca/eng/regulations/SOR-2002-227/section-209.2.html) . However, wages paid that are higher than those stated in the offer of employment may indicate a change in duties, which could mean a different occupation than that offered. An increase in wages may also result in a finding that the employer did not provide “substantially the same” wages if the increase would have affected the ability of the foreign national to qualify for the Labour Market Impact Assessment (LMIA) exemption.\n\nBased on instructions in the [Employer Portal User Guide](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/partners-service-providers/employer-portal/user-guide.html), the offer of employment requires the input of hourly wages in Canadian dollars. Foreign workers can be paid in Canadian currency or in another legal currency as long as the foreign worker is paid the equivalent Canadian wage stated in the offer throughout the period of employment. The foreign currency must be noted in the “Alternate Compensation Scheme” section of the offer."
    },
    {
      "heading": "Working conditions",
      "heading_path": [
        "Employer compliance inspections",
        "Known past non-compliance",
        "Working conditions"
      ],
      "anchor": "#working-conditions",
      "text": "**Note:** When assessing multiple violations within the “working conditions” program condition, such as unpaid overtime **and** unpaid vacation, officers may **assess different violations separately**. When assessing penalties, however, officers cannot count multiple violations within each type of violation. For example, officers would not count unpaid vacation multiple times (such as unpaid Christmas Day, unpaid New Year’s Day, unpaid Canada Day, etc.)."
    },
    {
      "heading": "Working conditions may include non-wage-related remuneration benefits and entitlements specifically detailed in the offer of employment, such as the following:",
      "heading_path": [
        "Employer compliance inspections",
        "Known past non-compliance",
        "Working conditions may include non-wage-related remuneration benefits and entitlements specifically detailed in the offer of employment, such as the following:"
      ],
      "anchor": "#working-conditions-may-include-non-wage-related-remuneration-benefits-and-entitlements-specifically-detailed-in-the-offer-of-employment-such-as-the-following",
      "text": "* location of employment\n* statutory holidays, sick leave and vacation days\n* hours of work (including overtime)\n* transportation costs (where applicable)\n* accommodations, conditions and costs (where applicable)\n* extended health or medical insurance\n* other non-taxable benefits\n\nIf a change in working conditions (such as a reduction in hours or salary) negatively affects a worker, a new offer of employment and a new work permit are required before the change takes effect; otherwise, the employer risks being found non-compliant with the original job offer submitted to IRCC.\n\n**Important:** A change in location, from the location stated on the offer of employment, will be considered non-compliance (that is, **not** “substantially the same”) if it would affect the decision on a work permit application or result in the foreign national working without authorization. For example, a change in location to another province would have a bearing on a work permit that was approved for a provincial nominee, and a fishing guide working on a lake in Canada other than the one specifically stated on the seasonal work permit would be considered to be working without authorization.\n\n**Note:** Many other working conditions and workplace standards (for example, obligations around dismissals and rights to file complaints, occupational health and safety regulations and recruitment laws) are governed by provincial and territorial legislation. Employers of foreign workers must also comply with these laws in order to meet IMP requirements."
    },
    {
      "heading": "Acceptable changes",
      "heading_path": [
        "Employer compliance inspections",
        "Known past non-compliance",
        "Acceptable changes"
      ],
      "anchor": "#acceptable-changes",
      "text": "Employers are not required to inform IRCC of changes in working conditions. However, they must provide evidence of an acceptable justification [R209.2(3)] at the time of an inspection should there be differences between the working conditions offered and those found during the inspection.\n\nIf the change in working conditions (such as a reduction in hours or salary) negatively affects the worker, a new offer of employment and a new work permit are required before the change takes effect; otherwise, the employer risks being found non-compliant with the original job offer submitted to IRCC."
    },
    {
      "heading": "Abuse-free workplace [R209.2(1)(a)(iv)]",
      "heading_path": [
        "Employer compliance inspections",
        "Known past non-compliance",
        "Abuse-free workplace [R209.2(1)(a)(iv)]"
      ],
      "anchor": "#abuse-free-workplace-r209-2-1-a-iv",
      "text": "The employer must “make reasonable efforts to provide a workplace that is free of abuse,” within the meaning of [section R196.2(1).](http://laws-lois.justice.gc.ca/eng/regulations/SOR-2002-227/section-196.2.html) The definition of “reasonable efforts” in the context of providing a workplace that is free of abuse is available under the section “Employer efforts to provide abuse-free workplace.”"
    },
    {
      "heading": "Definition of ‘abuse’",
      "heading_path": [
        "Employer compliance inspections",
        "Known past non-compliance",
        "Abuse-free workplace [R209.2(1)(a)(iv)]",
        "Definition of ‘abuse’"
      ],
      "anchor": "#definition-of-abuse",
      "text": "[Section R196.2(1)](http://laws-lois.justice.gc.ca/eng/regulations/SOR-2002-227/section-196.2.html)defines abuse as the following\n\n1. physical abuse, including assault and personal confinement\n2. sexual abuse, including sexual contact without consent\n3. psychological abuse, including threats and intimidation\n4. financial abuse, including fraud and extortion\n5. reprisals, which consists of any measure taken by or on behalf of an employer against a foreign national that affects their employment or working conditions and that was taken because the foreign national reported that the conditions in R209.2 or R209.3 have not be met or has in good faith cooperated with an inspection. [R196.2(2)]\n\n**Note:** Examples of reprisal may include, but are not limited to: reduction of worker’s hours, demotion, early end of contract (dismissal), or threats of the same."
    },
    {
      "heading": "Charges or convictions for certain criminal offences could lead to an inspection",
      "heading_path": [
        "Employer compliance inspections",
        "Known past non-compliance",
        "Charges or convictions for certain criminal offences could lead to an inspection"
      ],
      "anchor": "#charges-or-convictions-for-certain-criminal-offences-could-lead-to-an-inspection",
      "text": "In addition to the types of abuse outlined in the IRPR, if IRCC receives information indicating that an IMP employer or one of its employees (a Canadian citizen, permanent resident or temporary foreign worker) has been accused or convicted of any of the following abuse-related crimes, that employer may be inspected (based on the trigger “reason to suspect”) to determine whether reasonable efforts have been made to provide a workplace free of abuse:\n\n* physical or sexual assault in the workplace\n* an offence causing death or bodily harm to an employee\n* trafficking in persons (or a related offence)\n* uttering threats to cause death or bodily harm to an employee\n* harassment in the workplace (including bullying)\n* fraud or extortion against an employee (including withholding pay without reason and paying the employee significantly below what was agreed to in the offer of employment)"
    },
    {
      "heading": "Application of condition",
      "heading_path": [
        "Employer compliance inspections",
        "Known past non-compliance",
        "Application of condition"
      ],
      "anchor": "#application-of-condition",
      "text": "For the purposes of an inspection, the employer is the person or organization submitting the offer of employment under section [R209.11](https://laws-lois.justice.gc.ca/eng/regulations/SOR-2002-227/section-209.11.html).\n\nWhere an employer holds sole supervisory authority in the workplace (for example, small employers and sole proprietors), they are solely responsible for complying with this condition.\n\nHowever, for larger employers with more complex organizational structures, everyone who is in a supervisory role, particularly those responsible for supervising foreign workers, has a shared responsibility to comply with this condition.\n\nIf abuse is perpetrated by a third party (defined as a person or organization acting on an employer’s behalf, such as a recruiter, consultant or subsidiary), the employer may be found responsible for the actions of that third party. In this case, the employer will be expected to demonstrate efforts to address the abuse perpetrated by the third party."
    },
    {
      "heading": "Employer efforts to provide abuse-free workplace",
      "heading_path": [
        "Employer compliance inspections",
        "Known past non-compliance",
        "Employer efforts to provide abuse-free workplace"
      ],
      "anchor": "#employer-efforts-to-provide-abuse-free-workplace",
      "text": "To verify whether reasonable efforts have been made, the following 3 elements will be considered:\n\n1. An employer has made general efforts to prevent workplace abuse.\n2. The employer or anyone in a supervisory role or acting on the employer’s behalf has not actively participated in abuse, including failing to stop abuse of which they had knowledge.\n3. Where an allegation or incident of abuse occurred, steps were taken to address it and prevent it from happening again.\n\nAn employer will be deemed non-compliant where a determination is made of a failure by the employer to demonstrate compliance with any of the elements, including the occurrence of abuse."
    },
    {
      "heading": "A. Efforts to prevent workplace abuse in general",
      "heading_path": [
        "Employer compliance inspections",
        "Known past non-compliance",
        "Employer efforts to provide abuse-free workplace",
        "A. Efforts to prevent workplace abuse in general"
      ],
      "anchor": "#a-efforts-to-prevent-workplace-abuse-in-general",
      "text": "Indicators of general efforts made by an employer to prevent workplace abuse may include, but are not limited to, the following:\n\n* development and distribution of policies and procedures that address situations of abuse in the workplace (for example, what to do if an employee or supervisor is aware of or is experiencing abuse)\n* mechanisms to address and resolve workplace abuse, which could include complaints policies and protocols, dispute resolution mechanisms, an employee representative or contact person, employee counselling and anonymous hotlines\n* recent training (within the last 2 years) provided to employees and supervisors to identify and recognize abuse and to address it\n* indication that the employer was aware or should have been aware of the risk of abuse relating to particular staff members or particular situations where workers are or were at risk\n* indication that the employer took reasonable steps to ensure that employees with known abusive or violent tendencies do not have direct contact with foreign workers, and that steps were taken to address it and prevent it from happening again\n\nWhile all employers must make efforts to provide a work environment that is free of abuse and violence, not all employers will have the same types of policies and procedures in place to deal with matters of abuse. The employer must provide sufficient information to enable verification of compliance with the regulatory condition. However, officers can use the indicators listed above in their assessments."
    },
    {
      "heading": "B. Information suggesting that abuse in the workplace has occurred",
      "heading_path": [
        "Employer compliance inspections",
        "Known past non-compliance",
        "Employer efforts to provide abuse-free workplace",
        "B. Information suggesting that abuse in the workplace has occurred"
      ],
      "anchor": "#b-information-suggesting-that-abuse-in-the-workplace-has-occurred",
      "text": "[Subparagraph R209.2(1)(a)(iv)](https://laws-lois.justice.gc.ca/eng/regulations/SOR-2002-227/section-209.2.html) requires employers to make reasonable efforts to provide a workplace free of abuse. In order to meet this condition, employers should be asked to demonstrate efforts taken to prevent abuse generally, as well as any measures taken to respond to specific allegations or instances of abuse that have occurred.\n\nIf an employer is found to be directly responsible for abusing a foreign worker, the employer will be deemed non-compliant and will be subject to applicable consequences. The employer may be considered responsible in situations such as the following:\n\n* The employer, a supervisor or a third party acting on the employer’s behalf has personally abused a foreign worker.\n* There is information to suggest that it is more likely than not that the employer, a supervisor or a third party has directed, encouraged or supported abuse (including failing to act when they have knowledge of abuse) committed by another individual.\n* There is information to suggest that the employer, a supervisor or a third party has taken action to protect the abuser by discouraging or preventing a report of abuse to authorities, suppressing information pertaining to abuse or providing false or misleading information to authorities (including ESDC).\n* There is information to suggest that the employer or a supervisor has knowingly placed another employee, who has been convicted of a violent crime or abuse against an employee and has not undergone a rehabilitation process, in a position that directly interacts with foreign workers.\n\nTo determine whether abuse in the workplace has taken place, IRCC must ensure that all relevant information is taken into consideration and make a determination as to whether it is more likely that abuse occurred or did not occur (on the balance of probabilities). The outcome of any relevant legal procedure, where available, will be considered. Whereas a criminal conviction requires proof beyond a reasonable doubt and can take considerable time following an initial charge, IRCC may initiate an inspection and find an employer non-compliant following an allegation (no criminal conviction is required).\n\nTo determine whether abuse occurred, officers should consider the following information:\n\n* knowledge of a conviction under the Criminal Code for an offence related to abuse of an employee\n* details of any relevant allegation or information as it relates to abuse of an employee that IRCC has received or has been made aware of\n* relevant information, documents or statements gathered from the employer and employees during the course of an inspection\n* relevant information, documents or statements obtained from relevant provincial or federal authorities in accordance with applicable information-sharing agreements\n* relevant information gathered from public sources (for example, relevant media reports, including those with respect to allegations, criminal charges, convictions or provincial offences)\n\nWhere there is evidence of a possible provincial or territorial offence or of criminal behaviour regarding abuse on the part of the employer or other employees, IRCC will notify the relevant authorities in accordance with applicable procedures and directives related to information sharing."
    },
    {
      "heading": "C. Efforts to respond to or prevent the reoccurrence of abuse",
      "heading_path": [
        "Employer compliance inspections",
        "Known past non-compliance",
        "Employer efforts to provide abuse-free workplace",
        "C. Efforts to respond to or prevent the reoccurrence of abuse"
      ],
      "anchor": "#c-efforts-to-respond-to-or-prevent-the-reoccurrence-of-abuse",
      "text": "Reasonable efforts to provide a workplace free of abuse, after an incident of abuse or an allegation of abuse for which the employer may not be considered actively responsible, require the employer to demonstrate concrete changes of practice or policy, such as the following:\n\n* indication of relevant disciplinary action, such as the dismissal of a staff member considered to be a risk to cause future abuse\n* modifications made to any of the policies, protocols, training or mechanisms listed in section A, or the creation of policies, protocols, training or mechanisms, etc.\n* other organizational changes to improve the awareness, safety or protection of individuals, such as additional security measures (locks, lights, individuals on call, etc.)\n* new reporting factors (for example, managers’ performance reviews that are based on the implementation of new abuse awareness policies)\n* full cooperation with the relevant authorities investigating allegations or instances of abuse\n\nFor this element, the employer must provide satisfactory responses to requests made in accordance with the department’s inspection authorities. Where IRCC has determined that abuse has occurred, the onus is on the employer to provide sufficient evidence of reasonable efforts to prevent abuse from reoccurring. In addition, where IRCC has determined that there is not sufficient evidence to conclude that abuse has occurred, but that there is sufficient information to cause reasonable concern that abuse may have occurred, the onus is also on the employer to provide sufficient evidence of compliance with this element.\n\nTo demonstrate sufficient efforts to respond to actual instances of workplace abuse, employers must be able to explain the specific actions taken. Such actions could include some or all of the following:\n\n* assessment of the facts\n* provision of support measures for the person who made the allegation (for example, receipts for medical care or counselling)\n* where appropriate, referral to relevant federal or provincial authorities (for example, the police)\n* result and action taken (for example, firing the perpetrating employee or ensuring they will not have contact with temporary foreign workers)\n* employer follow-up with the victim(s)\n* follow-up on the effectiveness of any changes made"
    },
    {
      "heading": "Access to health care services [R209.2(1)(a)(viii)]",
      "heading_path": [
        "Employer compliance inspections",
        "Known past non-compliance",
        "Access to health care services [R209.2(1)(a)(viii)]"
      ],
      "anchor": "#access-to-health-care-services-r209-2-1-a-viii",
      "text": "As of September 26, 2022, employers must be able to demonstrate that they made reasonable efforts to provide access to health care services if a foreign national becomes ill or is injured at the work place. Reasonable efforts could include:\n\n* calling for emergency services (e.g., 911)\n* arranging a doctor appointment or visit to walk-in clinic\n* seeking or providing first aid if necessary, including rescue breathing and CPR until emergency help arrives\n* having the worker assessed by the health and safety officer on site (if applicable)\n\nThis list is not exhaustive and reasonable efforts will vary depending on the situation and illness. **Employers are not expected to pay for transportation to a health facility but are expected to make it accessible, such as calling a taxi**.\n\n**Note:** When a person becomes ill or injured at work, scenarios and responses can vary. In any situation, it is required of employers to have in place the means for personnel to report any injuries or illnesses to a supervisor(s) or another worker(s) right away who have the means to contact local emergency, such as having a nearby phone to call ‘911’ and/or having a supervisor/colleague commute the injured or ill worker to a local hospital or clinic.\n\nIf the worker does not need emergency services, employers are still required to make other efforts, such as having first aid kits made both accessible and nearby, guidelines for staff (e.g., “What to do in the event of an injury…”) and/or having someone accompany the worker to a local clinic.\n\nThe longer work-related injuries go unreported, the harder it will be to prove that the injuries were from the workplace itself. As a result, the employer is expected to respond to the injury/illness the same day it is observed.\n\nIf a worker becomes sick or injured when working from home (remotely and physically in Canada), the employer is required to adhere to this requirement by any means possible. For example, see that the worker can first and foremost tend to their injury and leave work, and that the employer call ‘911’ and direct emergency services to the worker’s place of residence, if needed."
    },
    {
      "heading": "No charging or recovering recruitment or employer compliance fees [R209.2(1)(a)(ix & x)]",
      "heading_path": [
        "Employer compliance inspections",
        "Known past non-compliance",
        "No charging or recovering recruitment or employer compliance fees [R209.2(1)(a)(ix & x)]"
      ],
      "anchor": "#no-charging-or-recovering-recruitment-or-employer-compliance-fees-r209-2-1-a-ix-x",
      "text": "As of September 26, 2022, under [R209.11 (e](https://laws-lois.justice.gc.ca/eng/regulations/SOR-2002-227/section-209.11.html)), when employers are submitting an offer of employment, they must **attest** that neither they, nor any person who recruited the foreign national on their behalf, have, directly or indirectly, charged or recovered from the foreign national employer compliance fees [[R303.1(1)](https://laws-lois.justice.gc.ca/eng/regulations/SOR-2002-227/section-303.1.html)] or recruitment fees, except immigration processing fees related to the application.\n\nDuring the period of employment, employers and any persons who recruited the foreign national on their behalf can not directly or indirectly charge or recover from the foreign national the employer compliance fee [R303.1(1)] or recruitment fees, except immigration processing fees related to the application."
    },
    {
      "heading": "Fees definition",
      "heading_path": [
        "Employer compliance inspections",
        "Known past non-compliance",
        "No charging or recovering recruitment or employer compliance fees [R209.2(1)(a)(ix & x)]",
        "Fees definition"
      ],
      "anchor": "#fees-definition",
      "text": "The terms “**fees related to employment services**” or “**recruitment fees**” refer to **any fees or costs incurred in the recruitment process in order for workers to secure employment or placement**, regardless of the manner, timing, amount or location of their imposition or collection.\n\nThese fees may be one-time or recurring and cover recruiting, referral, or placement services. They could also include advertising, disseminating information, arranging interviews, submitting documents for government clearances, confirming credentials, organizing travel and transportation, or placement into employment.\n\nExamples of prohibited recruitment fees include:\n\n* payments for recruitment services offered by labour recruiters, whether public or private, in matching offers of and applications for employment—placement fees, “cash-for-jobs” schemes\n* payments made in the case of recruitment of workers with a view to employing them to perform work for a third party—fees that a foreign national must pay for assistance with finding employment in Canada\n* payments made in the case of direct recruitment by the employer—any expenses incurred by the employer that are integral to the recruitment of the foreign national\n* payments to recover recruitment fees from workers—fees that an employer must pay for assistance or advice in the hiring of foreign nationals, including the referral of foreign nationals for employment\n\nThis definition also addresses “illegitimate, unreasonable and undisclosed costs:” extra-contractual, undisclosed, inflated or illicit costs are never legitimate. Examples of these costs include bribes, tributes, extortion or kickback payments, bonds, illicit cost-recovery fees, and collaterals required by any actor in the recruitment chain.\n\n**A person who recruits for the employer** includes anyone who:\n\n* finds or attempts to find an individual for employment with the employer;\n* assists another person in finding or attempting to find an individual for employment with the employer; or\n* refers a foreign national to another person who finds or attempts to find an individual for employment with the employer.\n\n**Recruitment services** means services that consist of:\n\n* seeking or obtaining employment for a client;\n* assisting or advising any person with respect to seeking or obtaining employment for a client;\n* assisting or advising an employer or another person with respect to hiring a client; or\n* referring a client to another person who offers any of the services referred to above.\n\n**Indirect charging or recovery** refers to measures taken by an employer or anyone recruiting on their behalf to receive compensation for recruitment fees from a foreign national without explicitly charging or deducting from wages for this purpose. These measures include but are not limited to:\n\n* varying or reducing benefits or conditions of a foreign national’s employment\n* requiring a foreign national to perform additional tasks on a “volunteer” basis for business or non-business related activities to the benefit of the employer or recruiter\n* requiring the foreign worker to live in accommodation provided by the employer or recruiter at above-market rents\n* in the case of entities providing immigration services to the foreign nationals to be hired while also acting as a recruiter for the employer, overcharging for the immigration services provided to the foreign nationals"
    },
    {
      "heading": "Provide information on a foreign worker’s rights [R209.2(1)(a.1)]",
      "heading_path": [
        "Employer compliance inspections",
        "Known past non-compliance",
        "Provide information on a foreign worker’s rights [R209.2(1)(a.1)]"
      ],
      "anchor": "#provide-information-on-a-foreign-worker-s-rights-r209-2-1-a-1",
      "text": "For each period of employment for which a work permit is issued, on or before the first day of work, the employer must share information provided by the Government of Canada. This requirement also applies to employers who continued to employ a foreign national on a work permit extension (i.e., foreign national working for the same employer) after September 26, 2022.\n\n**Note:** “First day of work” is considered when the foreign national reports for work either virtually or in person for the first time after work permit issuance during the period of the work permit."
    },
    {
      "heading": "Make available the information on the foreign national’s rights [R209.2(1)(a)(ii.1)]",
      "heading_path": [
        "Employer compliance inspections",
        "Known past non-compliance",
        "Provide information on a foreign worker’s rights [R209.2(1)(a.1)]",
        "Make available the information on the foreign national’s rights [R209.2(1)(a)(ii.1)]"
      ],
      "anchor": "#make-available-the-information-on-the-foreign-national-s-rights-r209-2-1-a-ii-1",
      "text": "The employer is required to ensure that this information is also available to the worker during the period of employment in both official languages of Canada. This means that the information should be readily available at the workplace of the foreign national throughout their period of employment. This could include providing the information on paper or in an electronic format, as long as the information is easily visible, accessible to the foreign national and without additional cost to them, and without needing to go through the employer.\n\nFor example, the employer may post the information in an “accessible location,” such as a cafeteria or break room, or a company website. Such a location may be physical or virtual, so long as it is one that is easy for the worker to access and where the worker is likely to spend time regularly.\n\nThe employer can share the information electronically in this situation; it is imperative to have unencumbered access to the digital site where this information can be found, as well as a reliable internet connection and access to a computer.\n\nExamples of these situations could include where an employer has a company landing page where bulletins and important information is posted."
    },
    {
      "heading": "Verifying the accuracy of information provided [R209.2(1)(b)(i)]",
      "heading_path": [
        "Employer compliance inspections",
        "Known past non-compliance",
        "Verifying the accuracy of information provided [R209.2(1)(b)(i)]"
      ],
      "anchor": "#verifying-the-accuracy-of-information-provided-r209-2-1-b-i",
      "text": "Employers must be able to demonstrate that the information they provided in the offer of employment [[R209.11](https://laws-lois.justice.gc.ca/eng/regulations/SOR-2002-227/section-209.11.html)] or at the request of an officer during the work permit application process was accurate at the time of submission.\n\nInaccurate information is considered false, incorrect or misleading information, or omitted information that the employer was required to provide.\n\n**Note:** The offer of employment information must be provided to IRCC **before** the foreign national makes an application for a work permit [R209.11]. Employers must provide all accurate information pertaining to the offer in the fields provided in the Employer Portal. The Employer Portal does not allow for “attached documents,” and any references made by the employer to documents attached to the work permit application will not be considered as part of the offer of employment submitted to IRCC. If the offer is not complete, the employer may be required to resubmit a properly completed offer in the Employer Portal before the work permit can be issued, or the work permit application may be refused.\n\nGenerally, for compliance inspections, accuracy should be reviewed only if there is reason to suspect the employer may have provided inaccurate information in the offer of employment or when the work permit was processed.\n\nTo make a determination that the information was inaccurate, there should be evidence that, at the time of submission, the information was inaccurate. There may be some indication that the employer may have been attempting to circumvent requirements or induce an error in the administration of the Act. However, officers need only be satisfied that the information was inaccurate at the time it was submitted and do not need to examine the intent of the employer.\n\n**Note:** This is a verification of the accuracy of the information provided in the offer of employment submitted by the employer or in submissions during the work permit application process and is not a reassessment of the work permit issuance. Therefore, as part of an inspection, the employer should be asked only to demonstrate the accuracy of information already provided.\n\nAccuracy of information applies to **all sections of the offer of employment** and includes all information provided and declarations made during work permit processing.\n\nFactors to consider include the following:\n\n* Employers are responsible for ensuring that all the information submitted in their offer of employment and all documents submitted during work permit processing were accurate at the time of submission.\n* It must be recognized that honest errors and misunderstandings sometimes occur in completing offers of employment fields and in responding to questions.\n* Inaccurate facts are not restricted to facts directly applicable to employer conditions (for example, wages and benefits), but apply to any field in the offer of employment (for example, an explanation of the LMIA exemption, the size of the business, declarations).\n\nOfficers must apply the aforementioned guidelines designed to support the consistent and fair application of the accuracy of information section. It is not possible to provide an exhaustive list of all scenarios. In each case, all the relevant information and the circumstances should be carefully considered.\n\nThe following situations would generally constitute inaccuracy in the offer of employment or during work permit processing:\n\n* The employer indicates in the offer that the duration of employment will be 24 months but signs a contract with the temporary worker before the work permit is issued for only 12 months.\n* The employer enters a higher wage on the offer submitted to IRCC than that actually paid to the worker.\n* The employer states “not applicable” in the benefits field, when the benefits are actually being provided by a foreign employer.\n* The employer signed the declaration that they are compliant with the provincial or territorial laws but knows that it has been charged with, or received a citation for, a provincial or territorial labour infraction.\n\nAn employer who submitted inaccurate information is justified if they made reasonable efforts to comply, as per [subsection R209.2(4)](https://laws-lois.justice.gc.ca/eng/regulations/SOR-2002-227/section-209.2.html).\n\nThe following would generally constitute examples where the employer made reasonable efforts to provide accurate information:\n\n* In the offer of employment, the employer submitted an alternative compensation scheme because the wages were to be paid by a foreign entity or a third party, but the wage information proved to be incorrect; therefore, the employer tried to obtain and verify the wage information from the foreign entity or third party.\n* The employer is paying a foreign company to service equipment, which the foreign worker is fulfilling. In the offer, the employer indicates that the foreign worker’s salary is the contract amount that is being paid to the foreign company. During the inspection, the employer states that they were unaware of the actual amount the foreign company is paying the worker, so they just indicated the contract amount in the salary section of the offer.\n* The foreign worker is not performing standard work hours (for example, 8 hours per day), but the employer indicates standard work hours in the offer of employment. During the inspection, the employer provides a contract indicating the actual non-standard work hours, which are also reflected in the timesheets and payroll statements. The employer mentions they thought they needed to put standard hours in the offer.\n* The foreign national is being paid an annual salary, and the employer incorrectly calculates a higher hourly rate than the actual amount in the offer. The contract indicates the correct annual salary, and the payroll reflects the same. The employer mentions they made an error in calculating the salary and indicates what the actual hourly rate should have been in the offer."
    },
    {
      "heading": "Changes to the offer of employment after the work permit is issued",
      "heading_path": [
        "Employer compliance inspections",
        "Known past non-compliance",
        "Verifying the accuracy of information provided [R209.2(1)(b)(i)]",
        "Changes to the offer of employment after the work permit is issued"
      ],
      "anchor": "#changes-to-the-offer-of-employment-after-the-work-permit-is-issued",
      "text": "Typically, a foreign worker does not need a new work permit unless there has been a change to the conditions that affect the worker (for example, a change in the employer, the occupation or the location).\n\nIf, after a foreign worker has started working, the employer wishes to make changes to their salary or benefits, the employer cannot amend the benefit information in the offer of employment that was submitted to IRCC after the work permit application has been submitted by the foreign national.\n\nProactive notification to IRCC of changes to such aspects of the foreign worker’s employment is not required under the IMP. However, the employer who provided the offer on which the work permit is based is still responsible for ensuring that the wages and benefits **are consistent with what was stated** in the offer of employment. Employers may be inspected on the conditions listed above; therefore, they will have to provide proof at the time of inspection that they met these conditions or provide a justification for why they did not. The employer **must keep all documents** related to any changes in the original offer of employment submitted to IRCC.\n\nEmployers who have concerns that they are not meeting conditions of the offer of employment can use the [voluntary disclosure](https://www.canada.ca/en/immigration-refugees-citizenship/services/work-canada/hire-temporary-foreign/international-mobility-program/voluntary-disclosure.html) process. In addition, there are certain situations where an officer may have changed the information in the work permit when processing (see [changes between the offer of employment and the work permit application](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/foreign-workers/eligibility/employer-specific-labout-market-impact-assessment-exemptions.html#t9)).\n\nWhere it is determined that an employer has provided false, inaccurate or misleading information on the offer of employment, knowingly omitted information or knowingly provided false or misleading information during an inspection, IRCC may find that the employer did not make reasonable efforts to comply with the condition and that they are therefore non-compliant."
    },
    {
      "heading": "Document retention by employers [R209.2(1)(b)(ii)]",
      "heading_path": [
        "Employer compliance inspections",
        "Known past non-compliance",
        "Document retention by employers [R209.2(1)(b)(ii)]"
      ],
      "anchor": "#document-retention-by-employers-r209-2-1-b-ii",
      "text": "The compliance regulations enable IRCC to compel employers to produce documents for the purpose of verifying compliance. Employers are required to retain all documents from the first day of the associated work permit issuance to 6 years thereafter to substantiate the accuracy of information provided in the offer of employment and to demonstrate their compliance with the conditions outlined above in the section: “[Compliance conditions imposed on employers [R209.2]](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/foreign-workers/work-without-permit/employer-compliance-inspections.html#compliance-conditions).”\n\nDocuments employers should retain include, but are not limited to, those related to the hiring and employment of each foreign national they hire. Examples include, but are not limited to, such records as payroll information, job description, job offer/employment agreement, receipts for disbursements, records of registration for private health insurance, evidence (e.g., email or other correspondence) that the employer made reasonable efforts to determine that the recruiter they used is not charging fees. Employers must be able to demonstrate that any information they provided under section [209.11](https://laws-lois.justice.gc.ca/eng/regulations/SOR-2002-227/section-209.11.html) [as well as information provided in the offer of employment ([200(1)(c)(ii.1](https://laws-lois.justice.gc.ca/fra/reglements/DORS-2002-227/section-200.html))] was accurate. As a result, employers should retain the employment agreement signed by the employer and the foreign national.\n\nDocuments that may be used to verify employer compliance\n--------------------------------------------------------\n\nEmployers must cooperate and provide documents as requested in order to demonstrate compliance. Information must always be collected following departmental information collection authorities and privacy laws. In some cases, certain information provided by the employer will need to be redacted (for example, social insurance numbers or other information that is not relevant to an inspection).\n\nDocuments employers may be asked to provide to demonstrate compliance include the following:\n\n* **Business licence or permit, T2 Schedule 125 Income Statement Information, T2 Schedule 100 Balance Sheet Information, commercial lease agreement, etc.:** To demonstrate that the job offer for foreign workers is genuine and that the employer is actively engaged in the business in which the offer was made. In addition to these documents, a T4 Summary of Remuneration Paid may be used to support the total wages paid to a foreign worker.\n* **Provincial or territorial employer and recruiter registration certificate or licence (where applicable):** To demonstrate compliance with federal and provincial or territorial employment and recruitment legislation.\n* **Anti-abuse policies, codes of employee conduct, guidelines provided to staff, protection or support protocols to staff, training, steps taken to resolve complaints of abuse, anti-harassment policies, protocols, etc.:** Evidence that the employer has made reasonable efforts to provide a workplace free of abuse (in assessing this, all available information will be weighed).\n* **Payroll records:** To ensure the appropriate prevailing wage and overtime are being paid and deductions are being made (Canada Pension Plan, employment insurance, income tax), to explain any non-standard deductions and to ensure the working hours match those stated in the offer.\n* **Cancelled cheques paid to the worker, money orders or bank statements:** To determine whether employers have provided temporary foreign workers with wages, working conditions and appropriate compensation.\n* **Time sheets:** To ensure workers are working the number of hours set out in their offer of employment (in most cases, this is usually defined as 30 or more hours per week).\n* **A job description:** To ensure foreign workers are working in the same occupation as that stated in the offer, the NOC matches the occupation, the occupation qualifies under the LMIA exemption and the occupation follows Canadian labour standards.\n* **Registration with provincial or territorial workplace safety insurance or workers' compensation clearance letter (if applicable):** To ensure the employer has registered for workplace safety insurance and is in good standing, to ensure that workers are covered in case of injury.\n* **Travel itinerary or invoices (if applicable):** To determine if an employer provided round-trip transportation costs for foreign workers under their employment.\n* **Accommodation information (if applicable):** Where the employer is providing accommodation, a copy of the rental agreement.\n* **Confirmation of insurance coverage (if applicable):** Proof the employer paid for insurance as indicated on the offer of employment (the documentation provided as proof of payment should not include financial account numbers).\n\n**Employment agreement:** Employers may be required to submit a copy of the jointly signed agreement during an inspection to demonstrate compliance.\n\n**Note:** This is not an exhaustive list. Employers should keep a record of all documentation in order to demonstrate compliance with program requirements.\n\nDecision-making\n---------------\n\nThe [instrument of designation and delegation](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/legislation.html) designates specific positions within IRCC as decision makers in regard to inspections and determinations."
    },
    {
      "heading": "Justifications",
      "heading_path": [
        "Employer compliance inspections",
        "Known past non-compliance",
        "Justifications"
      ],
      "anchor": "#justifications",
      "text": "Subsections [R209.2(3)](https://laws-lois.justice.gc.ca/eng/regulations/SOR-2002-227/section-209.2.html) and [R209.2(3.1)](https://laws-lois.justice.gc.ca/eng/regulations/SOR-2002-227/section-209.2.html#:~:text=Marginal%20note%3A-,Justification,-(3.1)%C2%A0A) set out specific justifications that may apply if an employer has not complied with conditions imposed under sections [R209.2](https://laws-lois.justice.gc.ca/eng/regulations/SOR-2002-227/section-209.2.html) and [R209.4](https://laws-lois.justice.gc.ca/eng/regulations/SOR-2002-227/section-209.4.html).\n\nThese justifications include the following:\n\n1. change in a federal, provincial or territorial law (for example, an increase in the minimum wage)\n2. change to a collective agreement (for example, an increase or decrease in salary)\n3. changes in economic conditions impacting all employees equally (for example, an economic downturn causing layoffs)\n4. error in interpretation made in good faith if the employer subsequently provided compensation (for example, missed vacation pay)\n5. unintentional accounting or administrative error if the employer subsequently provided compensation (for example, wrong compensation value entered into the payroll system)\n6. circumstances similar to points (a) to (e), which may require compensation if they are similar to point (d) or (e)\n7. force majeure (for example, a fire or flood destroys a place of business)"
    },
    {
      "heading": "Compensation",
      "heading_path": [
        "Employer compliance inspections",
        "Known past non-compliance",
        "Justifications",
        "Compensation"
      ],
      "anchor": "#compensation",
      "text": "In order to benefit from justification, compensation or efforts to compensate must be demonstrated before a preliminary decision is made. Otherwise, compensation or efforts to compensate will be considered only in point calculation.\n\nThe IRPR require that, if it is determined that the actual wages paid are different from those set out in the offer of employment and the reason is due to circumstances similar to point (d) or (e), the employer must either provide compensation or (if compensation is not possible) demonstrate sufficient efforts to do so. During an inspection, the employer must inform IRCC of any compensation that has been provided to **all** temporary foreign workers who suffered a disadvantage resulting from the employer’s error.\n\nCompensation may not be possible in the event of a dramatic change in economic conditions that directly impacts the business, in the event of force majeure, or in the event that the temporary foreign worker has already gone home, in which case the employer must demonstrate sufficient efforts to contact the foreign worker to provide compensation."
    },
    {
      "heading": "Efforts to compensate",
      "heading_path": [
        "Employer compliance inspections",
        "Known past non-compliance",
        "Justifications",
        "Efforts to compensate"
      ],
      "anchor": "#efforts-to-compensate",
      "text": "Where applicable, the employer must be able to demonstrate that they made sufficient efforts to provide compensation (for example, cancelled schedules paid to the worker or attempted correspondence with the worker). If the employer cannot demonstrate sufficient efforts, they may be deemed non-compliant.\n\n[R209.2](https://laws-lois.justice.gc.ca/eng/regulations/SOR-2002-227/section-209.2.html)(3.1) sets out specific justifications that may apply if an employer has not complied with conditions imposed under sections R209.2 (1)(a)(ix) and (x). If the fees referred to in [R209.2](https://laws-lois.justice.gc.ca/eng/regulations/SOR-2002-227/section-209.2.html) (1)(a)(ix) and (x) were incorrectly charged or recovered from the foreign national directly or indirectly, the employer must have made all reasonable efforts to comply with the conditions and must have subsequently provided full compensation to the foreign national for any such fees in order for their failure to comply to be justified."
    },
    {
      "heading": "Inspection result: compliant, compliant with justification or non-compliant",
      "heading_path": [
        "Employer compliance inspections",
        "Known past non-compliance",
        "Inspection result: compliant, compliant with justification or non-compliant"
      ],
      "anchor": "#inspection-result-compliant-compliant-with-justification-or-non-compliant",
      "text": "Based on a review of all available information, possible inspection outcomes are the following:\n\n* **Compliant:** The employer has complied with all conditions reviewed as set out in the regulations or has provided sufficient evidence that their failure to meet all the conditions as set out in paragraph R209.2(1)(a) is justified because it results from one of the situations identified in subsections R209.2(3), R209.2(3.1)R209.2(4) and [R209.4(2).](https://laws-lois.justice.gc.ca/eng/regulations/SOR-2002-227/section-209.4.html)\n* **Compliant with justification:** An employer’s failure to comply with the conditions set out in paragraph R209.2(1)(b) is justified because the employer made all reasonable efforts to comply with the conditions as per subsection R209.2(4). In the case of conditions set out in section R209.4, non-compliance may also be justified if it results from anything done or omitted to be done by the employer in good faith as per subsection R209.4(2).\n* **Non-compliant:** The employer fails to demonstrate that they are in compliance with the conditions under the IRPR, and the failure is not justified. Non-compliance is determined where the employer submitted documentation or information that, when assessed, indicates that the employer has not complied with one or more of the conditions in section R209.2 and that one of the following applies: \n * The employer has failed to provide an acceptable justification.\n * The justification provided requires the employer to undertake compensation and the employer has not done so.\n\n* A finding of non-compliance may also be made if an employer refuses to provide requested documentation or is otherwise uncooperative during an inspection as per section R209.4.\n* For information on assessing administrative monetary penalties or periods of ineligibility (bans) in regard to hiring foreign workers, refer to [Application of consequences where an employer is found non-compliant with the conditions](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/foreign-workers/work-without-permit/application-consequences-where-employer-found-non-compliant-conditions.html).\n\n**Note:** The examples of non-compliance outlined above are not all-encompassing, and analysts may encounter other irregularities that could lead to a recommendation of non-compliance.\n\nRelated links\n-------------\n\n* [Assessing the genuineness of the offer of employment on a work permit application – R200(5)](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/foreign-workers/genuineness.html)\n* [Public list of employers who have been non-compliant](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/foreign-workers/eligibility/public-list-employers-who-have-been-non-compliant.html)\n* [Employer-specific work permits with Labour Market Impact Assessment exemptions](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/foreign-workers/eligibility/employer-specific-labout-market-impact-assessment-exemptions.html)\n* [Open work permits for vulnerable workers](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/foreign-workers/vulnerable-workers.html)\n\nPage details\n------------\n\n 2024-07-26"
    }
  ],
  "links": {
    "outbound": [
      "https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/foreign-workers/compliance-exempt-employers.html",
      "https://laws-lois.justice.gc.ca/eng/regulations/SOR-2002-227/section-200.html",
      "http://laws-lois.justice.gc.ca/eng/regulations/SOR-2002-227/section-209.2.html",
      "https://laws-lois.justice.gc.ca/eng/regulations/SOR-2002-227/section-209.4.html",
      "https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/service-delivery/coronavirus/compliance.html",
      "https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/foreign-workers/work-without-permit/employer-compliance-inspections.html",
      "http://laws-lois.justice.gc.ca/eng/regulations/SOR-2002-227/section-209.5.html",
      "https://laws-lois.justice.gc.ca/eng/regulations/SOR-2002-227/section-209.2.html",
      "https://www.canada.ca/en/immigration-refugees-citizenship/services/work-canada/employers-non-compliant.html",
      "https://laws-lois.justice.gc.ca/eng/regulations/SOR-2002-227/section-209.996.html",
      "https://laws-lois.justice.gc.ca/eng/regulations/SOR-2002-227/section-209.997.html",
      "https://www.canada.ca/content/dam/ircc/migration/ircc/english/pdf/kits/forms/imm5964e.pdf",
      "https://www.canada.ca/en/immigration-refugees-citizenship/services/work-canada/hire-temporary-foreign/international-mobility-program/voluntary-disclosure.html",
      "https://laws-lois.justice.gc.ca/eng/regulations/SOR-2002-227/section-209.6.html",
      "https://laws-lois.justice.gc.ca/eng/regulations/SOR-2002-227/section-209.7.html",
      "https://laws-lois.justice.gc.ca/eng/regulations/SOR-2002-227/section-209.8.html",
      "https://laws-lois.justice.gc.ca/eng/regulations/SOR-2002-227/section-209.11.html",
      "https://laws-lois.justice.gc.ca/eng/regulations/SOR-2002-227/section-209.5.html",
      "https://laws-lois.justice.gc.ca/eng/regulations/SOR-2002-227/section-209.3.html",
      "https://laws-lois.justice.gc.ca/eng/regulations/SOR-2002-227/section-196.2.html",
      "https://laws-lois.justice.gc.ca/eng/regulations/SOR-2002-227/section-303.1.html",
      "https://laws-lois.justice.gc.ca/eng/regulations/SOR-2002-227/section-296.html",
      "https://laws-lois.justice.gc.ca/eng/regulations/SOR-2002-227/section-298.html",
      "https://laws-lois.justice.gc.ca/eng/regulations/SOR-2002-227/section-299.html",
      "http://laws-lois.justice.gc.ca/eng/acts/L-2",
      "http://www.qp.alberta.ca/1266.cfm?isbncln=9780779763900&leg_type=Regs&page=2012_045.cfm",
      "https://search-ohs-laws.alberta.ca/legislation/occupational-health-and-safety-act",
      "https://www.bclaws.gov.bc.ca/civix/document/id/complete/statreg/96113_01",
      "http://www.bclaws.ca/Recon/document/ID/freeside/296_97_00",
      "http://web2.gov.mb.ca/laws/statutes/2008/c02308e.php",
      "https://web2.gov.mb.ca/laws/statutes/ccsm/w210.php?lang=en",
      "http://laws.gnb.ca/en/ShowTdm/cs/E-7.2",
      "http://www.gov.ns.ca/lwd/employmentrights/ConsultationonTemporaryForeignWorkers.asp",
      "https://www.novascotia.ca/lae/employmentrights/docs/labourstandardscodeguide.pdf",
      "http://www.e-laws.gov.on.ca/html/statutes/english/elaws_statutes_09e32_e.htm",
      "https://www.ontario.ca/laws/statute/00e41",
      "http://www.e-laws.gov.on.ca/html/statutes/english/elaws_statutes_90o01_e.htm",
      "https://www.legisquebec.gouv.qc.ca/en/document/cr/I-0.2,%20r.%200.1",
      "https://publications.saskatchewan.ca/api/v1/products/70351/formats/78194/download",
      "https://www.canada.ca/en/immigration-refugees-citizenship/corporate/partners-service-providers/employer-portal/user-guide.html",
      "http://laws-lois.justice.gc.ca/eng/regulations/SOR-2002-227/section-196.2.html",
      "https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/foreign-workers/eligibility/employer-specific-labout-market-impact-assessment-exemptions.html",
      "https://laws-lois.justice.gc.ca/fra/reglements/DORS-2002-227/section-200.html",
      "https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/legislation.html",
      "https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/foreign-workers/work-without-permit/application-consequences-where-employer-found-non-compliant-conditions.html",
      "https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/foreign-workers/genuineness.html",
      "https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/foreign-workers/eligibility/public-list-employers-who-have-been-non-compliant.html",
      "https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/foreign-workers/vulnerable-workers.html"
    ],
    "internal_children": []
  },
  "quality": {
    "is_toc_like": false,
    "is_low_text": false,
    "notes": []
  }
}