{
  "source_id": "pdi_f6b197fdcbd3",
  "source_type": "guidance_pdi",
  "source_url": "https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/foreign-workers/international-free-trade-agreements/canada-eu/engineering-scientific-technologists.html",
  "canonical_url": "https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/foreign-workers/international-free-trade-agreements/canada-eu/engineering-scientific-technologists.html",
  "title": "Engineering technologists and scientific technologists - CETA [R204(a) -T48] – Agreements or arrangements – International Mobility Program",
  "language": "en",
  "manual": "Engineering technologists and scientific technologists",
  "chapter": "CETA [R204(a)",
  "heading_path": [
    "Engineering technologists and scientific technologists - CETA [R204(a) -T48] – Agreements or arrangements – International Mobility Program"
  ],
  "last_updated": "2025-01-20",
  "crawl_ts": "2026-02-12T00:00:00Z",
  "http": {
    "status_code": 200,
    "content_type": "text/markdown"
  },
  "content_hash": "b90e2bf188aaad8e948bb8e31a3c4b4025059577bdb99b80f571dd084e61089c",
  "raw_html_path": null,
  "markdown_path": "scripts/scraper/ircc_data_clean/engineering-scientific-technologists-f6b197fdcb.md",
  "text": "Published Time: Thu, 12 Feb 2026 00:39:49 GMT\n\nEngineering technologists and scientific technologists - CETA [R204(a) -T48] – Agreements or arrangements – International Mobility Program\n==========================================================================================================================================\n\nThis section contains policy, procedures and guidance used by IRCC staff. It is posted on the department’s website as a courtesy to stakeholders.\n\nIn these instructions “officers” refers to employees of both Immigration, Refugees and Citizenship Canada and the Canada Border Services Agency.\n\nThe instructions on this page should be reviewed in conjunction with:\n\n* [Employer-specific work permits – General processing – International Mobility Program](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/foreign-workers/eligibility/employer-specific-labout-market-impact-assessment-exemptions.html)\n* [Assessing the genuineness of the offer of employment on a work permit application](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/foreign-workers/genuineness.html)\n* [Conditions and validity period on work permits](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/foreign-workers/eligibility/eligibility-admissibility-conditions-including-validity-period.html)\n* [Public list of Employers who have been non-compliant](https://www.canada.ca/en/immigration-refugees-citizenship/services/work-canada/employers-non-compliant.html)\n\nThe [Canada-European Union (EU) Comprehensive Economic Trade Agreement (CETA)](https://www.international.gc.ca/trade-commerce/trade-agreements-accords-commerciaux/agr-acc/ceta-aecg/index.aspx?lang=eng) covers 2 types of technologists: engineering and scientific. Both are subject to the same criteria as contractual service suppliers and independent professionals, with the exception of the education credentials outlined below.\n\nCETA includes a list of service sectors (set out in[Annex 10-C](https://www.international.gc.ca/trade-commerce/trade-agreements-accords-commerciaux/agr-acc/ceta-aecg/text-texte/10-A.aspx?lang=eng#c:~:text=Annex%2010%2DC%20%E2%80%93%20Equivalent%20qualifications%20for%20engineering%20technologists%20and%20scientific%20technologists)) applicable to engineering and scientific technologists.\n\n[A table](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/foreign-workers/international-free-trade-agreements/canada-eu/noc-equivalents.html) has been created to demonstrate equivalency between Annex 10-C and Canada’s National Occupational Classification (NOC) codes, and to highlight those occupations where Canada has made commitments to facilitate temporary entry for engineering and scientific technologists.\n\nOn this page\n------------\n\n* [Eligibility](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/foreign-workers/international-free-trade-agreements/canada-eu/engineering-scientific-technologists.html#s1)\n* [Documentary evidence](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/foreign-workers/international-free-trade-agreements/canada-eu/engineering-scientific-technologists.html#s2)\n* [Place of application](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/foreign-workers/international-free-trade-agreements/canada-eu/engineering-scientific-technologists.html#s3)\n* [Application assessment](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/foreign-workers/international-free-trade-agreements/canada-eu/engineering-scientific-technologists.html#s4)\n* [Final decision](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/foreign-workers/international-free-trade-agreements/canada-eu/engineering-scientific-technologists.html#s5)\n* [Length of stay](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/foreign-workers/international-free-trade-agreements/canada-eu/engineering-scientific-technologists.html#s6)\n\nEligibility\n-----------\n\nTo be eligible for a work permit in the Engineering technologists and scientific technologists category, a foreign national must:\n\n* be a citizens of a [European Union member state](https://europa.eu/european-union/about-eu/countries_en)\n* have a signed contract between the service provider and the Canadian service consumer;\n* possess the necessary professional qualifications required to practise an activity pursuant to the laws or requirements in the province or territory where the service is supplied.\n\nIn addition to the general criteria listed above, a [contractual service supplier](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/foreign-workers/international-free-trade-agreements/canada-eu/contractual-service-providers.html) applying as an engineering technologist or scientific technologist must also:\n\n* be engaged in the supply of a service on a temporary basis as an employee of an enterprise that has obtained a service contract;\n* have been an employee of the EU-headquartered enterprise for at least 1 year prior to application;\n* possess 3 years of professional experience in the sector of activity that is the subject of the contract at the date of submission of an application for entry into Canada; and\n* not receive remuneration for the provision of services other than the remuneration paid by the enterprise employing the contractual service suppliers during their stay in Canada.\n\nIn addition to the general criteria listed above, an [independent professional](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/foreign-workers/international-free-trade-agreements/canada-eu/contractual-service-providers.html) applying as an engineering technologist or scientific technologist must also:\n\n* be engaged in the supply of a service on a temporary basis as a self-employed person; and\n* possess at least 6 years of professional experience in the sector of activity that is the subject of the contract as of the date of submission of an application for entry into Canada.\n\n### Specific criteria for engineering and scientific technologists\n\nEngineering technologists must possess the following education credentials:\n\n* a 3-year post-secondary degree from an officially recognized institution in engineering technology, which shall be considered equivalent to a university degree.\n\nScientific technologists must possess the following education credentials:\n\n* a 3-year post-secondary degree from an officially recognized institution in the discipline of agriculture, architecture, biology, chemistry, physics, forestry, geology, geophysics, mining or energy, which shall be considered equivalent to a university degree.\n\nDocumentary evidence\n--------------------\n\nThe onus is on the applicant to provide evidence that they meet the eligibility requirements of the exemption and will be able to perform the work being sought as stated in the International Mobility Program (IMP) offer of employment.\n\nApplicants in both categories of technologists must provide:\n\n* proof of citizenship of a [European Union member state](https://europa.eu/european-union/about-eu/countries_en);\n* a copy of a signed contract between the service provider and the Canadian service consumer;\n* documentation that provides the following information: \n * the profession for which entry is sought\n * their province or territory of destination\n * details of the position (job description, duration of employment, arrangements as to payment)\n * the educational qualification specific to the type of technologist (outlined below)\n\n* evidence that the applicant has the necessary professional qualifications required to practise an activity pursuant to the laws or requirements in the province or territory where the service is supplied;\n* an offer of employment submitted through the Employer Portal or through [alternate means](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/visitors/place-application-visa-electronic-travel-authorization-study-permit-work-permit/exempt-electronic-applications.html#exceptions) if authorized \n * the offer of employment provides confirmation of the pre-arranged employment;\n * the proposed employer in Canada;\n * the profession for which entry is sought; and\n * details of the position (title, duties, duration of employment, arrangements as to payment).\n\nPlace of application\n--------------------\n\nForeign nationals who are exempt from the requirement for a temporary resident visa may apply for a work permit at the port of entry, as well as foreign nationals who otherwise meet the requirements of R198. For more information, see: [Temporary Foreign Worker Program (TFWP) and International Mobility Program (IMP): Persons who may apply at a port of entry](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/foreign-workers/persons-who-may-apply-port-entry.html).\n\nForeign nationals may apply for a work permit from within Canada if they meet the conditions set out in [section R199](http://laws-lois.justice.gc.ca/eng/regulations/sor-2002-227/section-199.html) of the Immigration and Refugee Protection Regulations.\n\nApplication assessment\n----------------------\n\n### Review of the offer of employment\n\nWhen assessing if the work permit application meets the requirements of the CETA, officers should review the offer of employment that appears under the Employment Details tab in the Global Case Management System (GCMS) for information provided by the employer (who could be the applicant) or the matching fields on the IMM 5802 form (if the employer was authorized to use it).\n\n| Field | Considerations |\n| --- | --- |\n| LMIA Exemption Code | **T48** – CETA – R204(a) – Engineering technologists and scientific technologists |\n| Requirements Exemptions Met | Has the employer indicated how the position in Canada meets the eligibility requirements for CETA? For example, what is the position that the foreign national will hold? |\n| NOC and Job Title | Do the National Occupational Classification (NOC) code and job title align with their duties as an engineering or scientific technologists? |\n| Duration | The maximum duration for initial work permits under the Engineering and scientific technologist category is 1 year. Is the employer requesting a longer period of time than what is allowed under the CETA? If yes, this may be an indicator that the foreign national may not be entering for a temporary purpose. |\n| Employer | Does the offer of employment provide confirmation of the pre-arranged employment? Is the proposed employer in Canada? Does the offer of employment give accurate details of the profession for which entry is sought: * title * duties * duration of employment * arrangements as to payment? |\n| Duties and Job Requirements | These are the activities that the foreign national will be performing. * Do they align with the occupation? * Do they make sense in relation to the position that is being offered? * Are there specific requirements that align with the applicant’s role? |\n| Wages | **Note:** A mandatory wage assessment is not required for applicants under this category. However, for these applicants, wage remains an important indicator of knowledge, expertise and experience, and should be taken into account as an important factor in an officer’s overall assessment, although officers should not refuse an application based on the wage alone. There is no requirement that the foreign national be paid by the Canadian enterprise or in Canadian dollars. |\n| Minimum Education Requirements | Are the educational requirements compatible with the stated occupation outlined in the offer of employment? The client’s education may have some bearing on whether the client meets the job requirements; however, its relative weight may be less if their work experience is sufficient. Refer to [Specific to criteria for engineering and scientific technologists](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/foreign-workers/international-free-trade-agreements/canada-eu/engineering-scientific-technologists.html#s1.1) for further information. |\n\nRefer to [Employer-specific work permits – General processing – International Mobility Program](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/foreign-workers/eligibility/employer-specific-labout-market-impact-assessment-exemptions.html) for further guidance.\n\n### Pre-arranged employment\n\nIn this context, the Canadian employer may be an enterprise or an individual. The following are some examples of pre-arranged employment:\n\n* an employee-employer relationship with a Canadian enterprise; or\n* a contract between the technologist and a Canadian enterprise; or\n* a contract between the technologist’s EU employer and a Canadian enterprise.\n\n**Important:** The engineering technologist and scientific technologist category does not allow self-employment in Canada (i.e., soliciting business in the Canadian labour market). However, a European citizen who is self-employed outside Canada is not barred from this category, provided the services to be rendered in Canada are pre-arranged with a Canadian employer.\n\nFinal decision\n--------------\n\n### Approval\n\nThe work permit will be issued under the authority of paragraph [R204(a)](https://laws-lois.justice.gc.ca/eng/regulations/SOR-2002-227/section-204.html).\n\nIn GCMS, under the Application screen, officers should enter the information below in the specified fields.\n\n| Field | Selection or input |\n| --- | --- |\n| Case type | 52 |\n| Province of destination | The province of destination entered by the applicant should match the address of employment in the IMP offer of employment. This information is under the **Employment Details – LMIA-exempt** tab. If there is more than one location, officers should enter the primary location in the “Province of destination” field and the secondary location in the “User remarks” field. |\n| City of destination | The city of destination entered by the applicant should match the address of employment in the IMP offer of employment. This information is under the **Employment Details – LMIA-exempt** tab. If there is more than one location, officers should enter “Unknown” in the “City of destination” field and “As per the offer” in the “User remarks” field. |\n| Exemption code | **T48** – CETA – R204(a) – Engineering technologists and scientific technologists This code is auto-populated from the IMP offer of employment. For further instruction, see [Changes between the offer of employment and the work permit application](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/foreign-workers/eligibility/employer-specific-labout-market-impact-assessment-exemptions.html#t9) |\n| NOC | The NOC code is auto-populated from the IMP offer of employment. |\n| Intended occupation | Job title This is auto-populated from the IMP offer of employment. |\n| LMIA/LMIA-exempt # | “A” number from the work permit application. This number is auto-populated from the work permit application, and it is what is used to “match” in the Portal. If the work permit application was submitted on paper, the officer must manually enter the number. |\n| Employer | Business operating name |\n| Duration | Principal applicant: 1 year from the date of entry |\n\n### Refusal\n\nIf an officer is not satisfied that all the requirements of [R200](https://laws-lois.justice.gc.ca/eng/regulations/SOR-2002-227/section-200.html), including the assessment under [R204(a)](https://laws-lois.justice.gc.ca/eng/regulations/SOR-2002-227/section-204.html), are met, they must record their reasons and outline the rationale underlying the decision as well as the facts and elements considered. They must also provide an explanation for the decision in a case note.\n\nA decision is reasonable and therefore defendable when another person is able to trace the decision maker’s reasoning, without encountering fatal flaws in the overarching logic, and is satisfied that there is a line of analysis within the given reasons that could reasonably lead the tribunal from the evidence before it to the decision maker’s conclusion.\n\nThe officer needs to engage with the documentary evidence that was provided by the applicant. Simply stating ‘I have reviewed the submissions and I am not satisfied that R204 is met’ **is not sufficient** for the another reasonable person to understand the logic of the decision without reviewing all of the evidence again.\n\nRefusal reasons should clearly indicate which criteria or what requirement of R200 was not met and explain how the conclusion was reached.\n\nFor assistance, officers can follow the steps in [Decision making: Standard of review and process for making a reasonable decision](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/service-delivery/decision-standard-review.html).\n\n#### Refusal grounds in the GCMS\n\nThe GCMS has standard text for refusal grounds. Officers should ensure that the refusal grounds selected for the refusal letter match the reasons that they have stated in their case note.\n\nIf an officer has reasonable grounds to believe that the applicant is not able to perform the work sought, they should select the paragraph “R200(3)(a) **You were not able to demonstrate that you will be able to adequately perform the work you seek**.” Officers should ensure that they clearly indicate in their refusal notes why they are not satisfied.\n\nGiven that there is no specific refusal ground for FTA categories in GCMS for when a officer is not satisfied that the criteria has been met, **they should select the refusal ground “Other” and add a short explanation in the Comments field that they are not satisfied that section R200 or paragraph R204(a) are met**.\n\nLength of stay\n--------------\n\nA cumulative period of no more than 12 months in any 24-month period or for the duration of the contract, whichever is less. Permits for engineering technologist or scientific technologist may be extended up to 12 months from the start of the initial work permit and must fall within the overall 24-month window permitted for these categories.\n\nIn order to apply for an extension, applicants must:\n\n* apply before their current status expires;\n* comply with all the conditions that were imposed on entry; and\n* be in possession of a passport or travel document that is valid for the entire period authorized for the applicant’s stay.\n\nIn order to extend a CETA work permit, the employer must submit a new offer of employment.\n\nOfficers should review the suggested documentation when reviewing the work duration requested by the employer.\n\nExtensions are possible at the officer’s discretion while not exceeding the 24-month period. For more information, see:\n\n* [Extending CETA work permits](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/foreign-workers/international-free-trade-agreements/canada-eu.html#s5)\n\nPage details\n------------\n\n 2025-01-20",
  "sections": [
    {
      "heading": "Engineering technologists and scientific technologists - CETA [R204(a) -T48] – Agreements or arrangements – International Mobility Program",
      "heading_path": [
        "Engineering technologists and scientific technologists - CETA [R204(a) -T48] – Agreements or arrangements – International Mobility Program"
      ],
      "anchor": "#engineering-technologists-and-scientific-technologists-ceta-r204-a-t48-agreements-or-arrangements-international-mobility-program",
      "text": "Published Time: Thu, 12 Feb 2026 00:39:49 GMT\n\nEngineering technologists and scientific technologists - CETA [R204(a) -T48] – Agreements or arrangements – International Mobility Program\n==========================================================================================================================================\n\nThis section contains policy, procedures and guidance used by IRCC staff. It is posted on the department’s website as a courtesy to stakeholders.\n\nIn these instructions “officers” refers to employees of both Immigration, Refugees and Citizenship Canada and the Canada Border Services Agency.\n\nThe instructions on this page should be reviewed in conjunction with:\n\n* [Employer-specific work permits – General processing – International Mobility Program](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/foreign-workers/eligibility/employer-specific-labout-market-impact-assessment-exemptions.html)\n* [Assessing the genuineness of the offer of employment on a work permit application](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/foreign-workers/genuineness.html)\n* [Conditions and validity period on work permits](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/foreign-workers/eligibility/eligibility-admissibility-conditions-including-validity-period.html)\n* [Public list of Employers who have been non-compliant](https://www.canada.ca/en/immigration-refugees-citizenship/services/work-canada/employers-non-compliant.html)\n\nThe [Canada-European Union (EU) Comprehensive Economic Trade Agreement (CETA)](https://www.international.gc.ca/trade-commerce/trade-agreements-accords-commerciaux/agr-acc/ceta-aecg/index.aspx?lang=eng) covers 2 types of technologists: engineering and scientific. Both are subject to the same criteria as contractual service suppliers and independent professionals, with the exception of the education credentials outlined below.\n\nCETA includes a list of service sectors (set out in[Annex 10-C](https://www.international.gc.ca/trade-commerce/trade-agreements-accords-commerciaux/agr-acc/ceta-aecg/text-texte/10-A.aspx?lang=eng#c:~:text=Annex%2010%2DC%20%E2%80%93%20Equivalent%20qualifications%20for%20engineering%20technologists%20and%20scientific%20technologists)) applicable to engineering and scientific technologists.\n\n[A table](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/foreign-workers/international-free-trade-agreements/canada-eu/noc-equivalents.html) has been created to demonstrate equivalency between Annex 10-C and Canada’s National Occupational Classification (NOC) codes, and to highlight those occupations where Canada has made commitments to facilitate temporary entry for engineering and scientific technologists.\n\nOn this page\n------------\n\n* [Eligibility](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/foreign-workers/international-free-trade-agreements/canada-eu/engineering-scientific-technologists.html#s1)\n* [Documentary evidence](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/foreign-workers/international-free-trade-agreements/canada-eu/engineering-scientific-technologists.html#s2)\n* [Place of application](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/foreign-workers/international-free-trade-agreements/canada-eu/engineering-scientific-technologists.html#s3)\n* [Application assessment](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/foreign-workers/international-free-trade-agreements/canada-eu/engineering-scientific-technologists.html#s4)\n* [Final decision](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/foreign-workers/international-free-trade-agreements/canada-eu/engineering-scientific-technologists.html#s5)\n* [Length of stay](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/foreign-workers/international-free-trade-agreements/canada-eu/engineering-scientific-technologists.html#s6)\n\nEligibility\n-----------\n\nTo be eligible for a work permit in the Engineering technologists and scientific technologists category, a foreign national must:\n\n* be a citizens of a [European Union member state](https://europa.eu/european-union/about-eu/countries_en)\n* have a signed contract between the service provider and the Canadian service consumer;\n* possess the necessary professional qualifications required to practise an activity pursuant to the laws or requirements in the province or territory where the service is supplied.\n\nIn addition to the general criteria listed above, a [contractual service supplier](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/foreign-workers/international-free-trade-agreements/canada-eu/contractual-service-providers.html) applying as an engineering technologist or scientific technologist must also:\n\n* be engaged in the supply of a service on a temporary basis as an employee of an enterprise that has obtained a service contract;\n* have been an employee of the EU-headquartered enterprise for at least 1 year prior to application;\n* possess 3 years of professional experience in the sector of activity that is the subject of the contract at the date of submission of an application for entry into Canada; and\n* not receive remuneration for the provision of services other than the remuneration paid by the enterprise employing the contractual service suppliers during their stay in Canada.\n\nIn addition to the general criteria listed above, an [independent professional](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/foreign-workers/international-free-trade-agreements/canada-eu/contractual-service-providers.html) applying as an engineering technologist or scientific technologist must also:\n\n* be engaged in the supply of a service on a temporary basis as a self-employed person; and\n* possess at least 6 years of professional experience in the sector of activity that is the subject of the contract as of the date of submission of an application for entry into Canada."
    },
    {
      "heading": "Specific criteria for engineering and scientific technologists",
      "heading_path": [
        "Engineering technologists and scientific technologists - CETA [R204(a) -T48] – Agreements or arrangements – International Mobility Program",
        "Specific criteria for engineering and scientific technologists"
      ],
      "anchor": "#specific-criteria-for-engineering-and-scientific-technologists",
      "text": "Engineering technologists must possess the following education credentials:\n\n* a 3-year post-secondary degree from an officially recognized institution in engineering technology, which shall be considered equivalent to a university degree.\n\nScientific technologists must possess the following education credentials:\n\n* a 3-year post-secondary degree from an officially recognized institution in the discipline of agriculture, architecture, biology, chemistry, physics, forestry, geology, geophysics, mining or energy, which shall be considered equivalent to a university degree.\n\nDocumentary evidence\n--------------------\n\nThe onus is on the applicant to provide evidence that they meet the eligibility requirements of the exemption and will be able to perform the work being sought as stated in the International Mobility Program (IMP) offer of employment.\n\nApplicants in both categories of technologists must provide:\n\n* proof of citizenship of a [European Union member state](https://europa.eu/european-union/about-eu/countries_en);\n* a copy of a signed contract between the service provider and the Canadian service consumer;\n* documentation that provides the following information: \n * the profession for which entry is sought\n * their province or territory of destination\n * details of the position (job description, duration of employment, arrangements as to payment)\n * the educational qualification specific to the type of technologist (outlined below)\n\n* evidence that the applicant has the necessary professional qualifications required to practise an activity pursuant to the laws or requirements in the province or territory where the service is supplied;\n* an offer of employment submitted through the Employer Portal or through [alternate means](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/visitors/place-application-visa-electronic-travel-authorization-study-permit-work-permit/exempt-electronic-applications.html#exceptions) if authorized \n * the offer of employment provides confirmation of the pre-arranged employment;\n * the proposed employer in Canada;\n * the profession for which entry is sought; and\n * details of the position (title, duties, duration of employment, arrangements as to payment).\n\nPlace of application\n--------------------\n\nForeign nationals who are exempt from the requirement for a temporary resident visa may apply for a work permit at the port of entry, as well as foreign nationals who otherwise meet the requirements of R198. For more information, see: [Temporary Foreign Worker Program (TFWP) and International Mobility Program (IMP): Persons who may apply at a port of entry](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/foreign-workers/persons-who-may-apply-port-entry.html).\n\nForeign nationals may apply for a work permit from within Canada if they meet the conditions set out in [section R199](http://laws-lois.justice.gc.ca/eng/regulations/sor-2002-227/section-199.html) of the Immigration and Refugee Protection Regulations.\n\nApplication assessment\n----------------------"
    },
    {
      "heading": "Review of the offer of employment",
      "heading_path": [
        "Engineering technologists and scientific technologists - CETA [R204(a) -T48] – Agreements or arrangements – International Mobility Program",
        "Specific criteria for engineering and scientific technologists",
        "Review of the offer of employment"
      ],
      "anchor": "#review-of-the-offer-of-employment",
      "text": "When assessing if the work permit application meets the requirements of the CETA, officers should review the offer of employment that appears under the Employment Details tab in the Global Case Management System (GCMS) for information provided by the employer (who could be the applicant) or the matching fields on the IMM 5802 form (if the employer was authorized to use it).\n\n| Field | Considerations |\n| --- | --- |\n| LMIA Exemption Code | **T48** – CETA – R204(a) – Engineering technologists and scientific technologists |\n| Requirements Exemptions Met | Has the employer indicated how the position in Canada meets the eligibility requirements for CETA? For example, what is the position that the foreign national will hold? |\n| NOC and Job Title | Do the National Occupational Classification (NOC) code and job title align with their duties as an engineering or scientific technologists? |\n| Duration | The maximum duration for initial work permits under the Engineering and scientific technologist category is 1 year. Is the employer requesting a longer period of time than what is allowed under the CETA? If yes, this may be an indicator that the foreign national may not be entering for a temporary purpose. |\n| Employer | Does the offer of employment provide confirmation of the pre-arranged employment? Is the proposed employer in Canada? Does the offer of employment give accurate details of the profession for which entry is sought: * title * duties * duration of employment * arrangements as to payment? |\n| Duties and Job Requirements | These are the activities that the foreign national will be performing. * Do they align with the occupation? * Do they make sense in relation to the position that is being offered? * Are there specific requirements that align with the applicant’s role? |\n| Wages | **Note:** A mandatory wage assessment is not required for applicants under this category. However, for these applicants, wage remains an important indicator of knowledge, expertise and experience, and should be taken into account as an important factor in an officer’s overall assessment, although officers should not refuse an application based on the wage alone. There is no requirement that the foreign national be paid by the Canadian enterprise or in Canadian dollars. |\n| Minimum Education Requirements | Are the educational requirements compatible with the stated occupation outlined in the offer of employment? The client’s education may have some bearing on whether the client meets the job requirements; however, its relative weight may be less if their work experience is sufficient. Refer to [Specific to criteria for engineering and scientific technologists](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/foreign-workers/international-free-trade-agreements/canada-eu/engineering-scientific-technologists.html#s1.1) for further information. |\n\nRefer to [Employer-specific work permits – General processing – International Mobility Program](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/foreign-workers/eligibility/employer-specific-labout-market-impact-assessment-exemptions.html) for further guidance."
    },
    {
      "heading": "Pre-arranged employment",
      "heading_path": [
        "Engineering technologists and scientific technologists - CETA [R204(a) -T48] – Agreements or arrangements – International Mobility Program",
        "Specific criteria for engineering and scientific technologists",
        "Pre-arranged employment"
      ],
      "anchor": "#pre-arranged-employment",
      "text": "In this context, the Canadian employer may be an enterprise or an individual. The following are some examples of pre-arranged employment:\n\n* an employee-employer relationship with a Canadian enterprise; or\n* a contract between the technologist and a Canadian enterprise; or\n* a contract between the technologist’s EU employer and a Canadian enterprise.\n\n**Important:** The engineering technologist and scientific technologist category does not allow self-employment in Canada (i.e., soliciting business in the Canadian labour market). However, a European citizen who is self-employed outside Canada is not barred from this category, provided the services to be rendered in Canada are pre-arranged with a Canadian employer.\n\nFinal decision\n--------------"
    },
    {
      "heading": "Approval",
      "heading_path": [
        "Engineering technologists and scientific technologists - CETA [R204(a) -T48] – Agreements or arrangements – International Mobility Program",
        "Specific criteria for engineering and scientific technologists",
        "Approval"
      ],
      "anchor": "#approval",
      "text": "The work permit will be issued under the authority of paragraph [R204(a)](https://laws-lois.justice.gc.ca/eng/regulations/SOR-2002-227/section-204.html).\n\nIn GCMS, under the Application screen, officers should enter the information below in the specified fields.\n\n| Field | Selection or input |\n| --- | --- |\n| Case type | 52 |\n| Province of destination | The province of destination entered by the applicant should match the address of employment in the IMP offer of employment. This information is under the **Employment Details – LMIA-exempt** tab. If there is more than one location, officers should enter the primary location in the “Province of destination” field and the secondary location in the “User remarks” field. |\n| City of destination | The city of destination entered by the applicant should match the address of employment in the IMP offer of employment. This information is under the **Employment Details – LMIA-exempt** tab. If there is more than one location, officers should enter “Unknown” in the “City of destination” field and “As per the offer” in the “User remarks” field. |\n| Exemption code | **T48** – CETA – R204(a) – Engineering technologists and scientific technologists This code is auto-populated from the IMP offer of employment. For further instruction, see [Changes between the offer of employment and the work permit application](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/foreign-workers/eligibility/employer-specific-labout-market-impact-assessment-exemptions.html#t9) |\n| NOC | The NOC code is auto-populated from the IMP offer of employment. |\n| Intended occupation | Job title This is auto-populated from the IMP offer of employment. |\n| LMIA/LMIA-exempt # | “A” number from the work permit application. This number is auto-populated from the work permit application, and it is what is used to “match” in the Portal. If the work permit application was submitted on paper, the officer must manually enter the number. |\n| Employer | Business operating name |\n| Duration | Principal applicant: 1 year from the date of entry |"
    },
    {
      "heading": "Refusal",
      "heading_path": [
        "Engineering technologists and scientific technologists - CETA [R204(a) -T48] – Agreements or arrangements – International Mobility Program",
        "Specific criteria for engineering and scientific technologists",
        "Refusal"
      ],
      "anchor": "#refusal",
      "text": "If an officer is not satisfied that all the requirements of [R200](https://laws-lois.justice.gc.ca/eng/regulations/SOR-2002-227/section-200.html), including the assessment under [R204(a)](https://laws-lois.justice.gc.ca/eng/regulations/SOR-2002-227/section-204.html), are met, they must record their reasons and outline the rationale underlying the decision as well as the facts and elements considered. They must also provide an explanation for the decision in a case note.\n\nA decision is reasonable and therefore defendable when another person is able to trace the decision maker’s reasoning, without encountering fatal flaws in the overarching logic, and is satisfied that there is a line of analysis within the given reasons that could reasonably lead the tribunal from the evidence before it to the decision maker’s conclusion.\n\nThe officer needs to engage with the documentary evidence that was provided by the applicant. Simply stating ‘I have reviewed the submissions and I am not satisfied that R204 is met’ **is not sufficient** for the another reasonable person to understand the logic of the decision without reviewing all of the evidence again.\n\nRefusal reasons should clearly indicate which criteria or what requirement of R200 was not met and explain how the conclusion was reached.\n\nFor assistance, officers can follow the steps in [Decision making: Standard of review and process for making a reasonable decision](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/service-delivery/decision-standard-review.html)."
    },
    {
      "heading": "Refusal grounds in the GCMS",
      "heading_path": [
        "Engineering technologists and scientific technologists - CETA [R204(a) -T48] – Agreements or arrangements – International Mobility Program",
        "Specific criteria for engineering and scientific technologists",
        "Refusal",
        "Refusal grounds in the GCMS"
      ],
      "anchor": "#refusal-grounds-in-the-gcms",
      "text": "The GCMS has standard text for refusal grounds. Officers should ensure that the refusal grounds selected for the refusal letter match the reasons that they have stated in their case note.\n\nIf an officer has reasonable grounds to believe that the applicant is not able to perform the work sought, they should select the paragraph “R200(3)(a) **You were not able to demonstrate that you will be able to adequately perform the work you seek**.” Officers should ensure that they clearly indicate in their refusal notes why they are not satisfied.\n\nGiven that there is no specific refusal ground for FTA categories in GCMS for when a officer is not satisfied that the criteria has been met, **they should select the refusal ground “Other” and add a short explanation in the Comments field that they are not satisfied that section R200 or paragraph R204(a) are met**.\n\nLength of stay\n--------------\n\nA cumulative period of no more than 12 months in any 24-month period or for the duration of the contract, whichever is less. Permits for engineering technologist or scientific technologist may be extended up to 12 months from the start of the initial work permit and must fall within the overall 24-month window permitted for these categories.\n\nIn order to apply for an extension, applicants must:\n\n* apply before their current status expires;\n* comply with all the conditions that were imposed on entry; and\n* be in possession of a passport or travel document that is valid for the entire period authorized for the applicant’s stay.\n\nIn order to extend a CETA work permit, the employer must submit a new offer of employment.\n\nOfficers should review the suggested documentation when reviewing the work duration requested by the employer.\n\nExtensions are possible at the officer’s discretion while not exceeding the 24-month period. For more information, see:\n\n* [Extending CETA work permits](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/foreign-workers/international-free-trade-agreements/canada-eu.html#s5)\n\nPage details\n------------\n\n 2025-01-20"
    }
  ],
  "links": {
    "outbound": [
      "https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/foreign-workers/eligibility/employer-specific-labout-market-impact-assessment-exemptions.html",
      "https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/foreign-workers/genuineness.html",
      "https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/foreign-workers/eligibility/eligibility-admissibility-conditions-including-validity-period.html",
      "https://www.canada.ca/en/immigration-refugees-citizenship/services/work-canada/employers-non-compliant.html",
      "https://www.international.gc.ca/trade-commerce/trade-agreements-accords-commerciaux/agr-acc/ceta-aecg/index.aspx?lang=eng",
      "https://www.international.gc.ca/trade-commerce/trade-agreements-accords-commerciaux/agr-acc/ceta-aecg/text-texte/10-A.aspx?lang=eng",
      "https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/foreign-workers/international-free-trade-agreements/canada-eu/noc-equivalents.html",
      "https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/foreign-workers/international-free-trade-agreements/canada-eu/engineering-scientific-technologists.html",
      "https://europa.eu/european-union/about-eu/countries_en",
      "https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/foreign-workers/international-free-trade-agreements/canada-eu/contractual-service-providers.html",
      "https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/visitors/place-application-visa-electronic-travel-authorization-study-permit-work-permit/exempt-electronic-applications.html",
      "https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/foreign-workers/persons-who-may-apply-port-entry.html",
      "http://laws-lois.justice.gc.ca/eng/regulations/sor-2002-227/section-199.html",
      "https://laws-lois.justice.gc.ca/eng/regulations/SOR-2002-227/section-204.html",
      "https://laws-lois.justice.gc.ca/eng/regulations/SOR-2002-227/section-200.html",
      "https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/service-delivery/decision-standard-review.html",
      "https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/foreign-workers/international-free-trade-agreements/canada-eu.html"
    ],
    "internal_children": []
  },
  "quality": {
    "is_toc_like": false,
    "is_low_text": false,
    "notes": []
  }
}