{
  "source_id": "pdi_1adeff3eccd4",
  "source_type": "guidance_pdi",
  "source_url": "https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/eta/manually-processing-electronic-travel-authorization-applications.html",
  "canonical_url": "https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/eta/manually-processing-electronic-travel-authorization-applications.html",
  "title": "Manually processing electronic travel authorization applications",
  "language": "en",
  "manual": "Manually processing electronic travel authorization applications",
  "chapter": null,
  "heading_path": [
    "Manually processing electronic travel authorization applications"
  ],
  "last_updated": "2023-04-13",
  "crawl_ts": "2026-02-12T00:00:00Z",
  "http": {
    "status_code": 200,
    "content_type": "text/markdown"
  },
  "content_hash": "76ddfbd5bf158487a180b7877fa30c65cb2bb6145e1721fbc7764b032537360f",
  "raw_html_path": null,
  "markdown_path": "scripts/scraper/ircc_data_clean/manually-processing-electronic-travel-authorization-applications-1adeff3ecc.md",
  "text": "Published Time: Wed, 11 Feb 2026 22:00:37 GMT\n\nManually processing electronic travel authorization applications\n================================================================\n\nThis section contains policy, procedures and guidance used by IRCC staff. It is posted on the department’s website as a courtesy to stakeholders.\n\nApplications for electronic travel authorizations(eTAs), including eTA expansion, are, for the most part, online, automated applications. Applications that are not approved automatically by the Global Case Management System(GCMS) require manual review at the Operations Support Centre(OSC). Applications may trigger manual review at different stages for either or both of the following reasons:\n\n* identity reconciliation\n* derogatory information\n\neTA and eTA expansion applications are manually processed using essentially the same procedures.\n\nOn this page\n------------\n\n* [Canadian citizen applicants](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/eta/manually-processing-electronic-travel-authorization-applications.html#s01)\n* [Canadian permanent resident applicants](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/eta/manually-processing-electronic-travel-authorization-applications.html#s02)\n* [eTA expansion](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/eta/manually-processing-electronic-travel-authorization-applications.html#s03)\n* [Adverse information associated with an eTA applicant](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/eta/manually-processing-electronic-travel-authorization-applications.html#s04)\n* [Assessing admissibility](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/eta/manually-processing-electronic-travel-authorization-applications.html#s05)\n* [Assessing multiple electronic travel authorization (eTA) applications](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/eta/manually-processing-electronic-travel-authorization-applications.html#s06)\n* [Revalidating, inactivating and refusing an eTA](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/eta/manually-processing-electronic-travel-authorization-applications.html#s07)\n* [Establishing eTA validity](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/eta/manually-processing-electronic-travel-authorization-applications.html#s08)\n* [Service standards](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/eta/manually-processing-electronic-travel-authorization-applications.html#s09)\n\nCanadian citizen applicants\n---------------------------\n\nCanadian citizens are not eligible to apply for an eTA and must travel to Canada using a Canadian passport. If GCMS identifies an eTA applicant as a Canadian citizen, the application drops out of the automated process. GCMS can identify a Canadian citizen only if the individual is a naturalized citizen. Dual-national individuals who are citizens by birth do not have a record of their citizenship in GCMS and are, therefore, not identifiable by GCMS.\n\n**Officers should consider the following:**\n\n* Does the applicant’s immigration history confirm that they were indeed granted Canadian citizenship?\n* Is there any information in GCMS that indicates Canadian citizenship has been revoked (this may include GCMS records or notes from previous applications)?\n\n### Procedure\n\nLevel-1 decision makers at the OSC query for these applications by performing a search in “IMM activities”, under “Automation”. The “Activity” is set to “Derogatory Information”, the “Sub-activity” is set to “Client Derogatory Information” and the “Status” is set to “Review Required”.\n\nThe officer should determine if the applicant is a Canadian citizen.\n\nIf the officer determines that the applicant is a Canadian citizen, the officer should withdraw the application.\n\nThe officer should contact the applicant and advise them that their application has been withdrawn and that they must use their Canadian travel document to enter Canada.\n\nCanadian permanent resident applicants\n--------------------------------------\n\nIn some cases, applications can drop out of the automated process because the individual appears to be a permanent resident of Canada.\n\nIf the applicant is a permanent resident of Canada, they are not eligible for an eTA. See information on the [travel requirements for Canadian permanent residents](https://www.canada.ca/en/immigration-refugees-citizenship/services/permanent-residents/travel-document.html).\n\n**Officers should consider the following:**\n\n* Does the applicant’s immigration history confirm that they were indeed granted permanent residence?\n* Is there any information that shows that the applicant either lost or renounced their permanent resident status? Officers should note that, even if a person has renounced their status, their GCMS profile often still shows them as a permanent resident. Officers should look for more details regarding a possible renunciation if the GCMS profile is still listed as a permanent resident.\n\n### Procedure\n\nLevel 1 decision makers at the OSC query for these applications by performing a search in “IMM activities”, under “Automation”. The “Activity” is set to “Derogatory Information”, the “Sub activity” is set to “Client Derogatory Information” and the “Status” is set to “Review Required”.\n\nIf the applicant is a permanent resident and has not already gone through the formal process of relinquishing their status, they should be contacted to determine if they would like to relinquish their status voluntarily.\n\n* if the applicant does not want to relinquish their status or does not reply to the request, the officer must \n * withdraw the application\n * advise the applicant that they need to get an appropriate travel document that demonstrates that they are a permanent resident, which may necessitate a determination of their status (see [OP 10 Permanent Residency Status Determination (PDF, 653 KB)](https://www.canada.ca/content/dam/ircc/migration/ircc/english/resources/manuals/op/op10-eng.pdf))\n\n* if the applicant wants to relinquish their status, \n * they may do so electronically (see Renouncing permanent residence) via their secure Immigration, Refugees and Citizenship Canada(IRCC) account, as part of their eTA application, or by submitting a paper application to their local migration office\n * once they have done so, assuming they are otherwise admissible, the officer may issue the eTA\n\neTA expansion\n-------------\n\n### Referrals for manual review\n\neTA expansion cases are referred for manual review for the same reasons as other eTA applications. However, eTA expansion cases undergo additional automated eligibility checks. Therefore, there are additional points in the eTA processing continuum at which an eTA expansion application may be referred to the OSC for manual review.\n\n### Assessing eTA expansion eligibility results\n\nPer [subsections 7.01(1) and (2)](http://laws-lois.justice.gc.ca/eng/regulations/SOR-2002-227/section-7.01.html) of the Immigration and Refugee Protection Regulations(IRPR), foreign nationals may apply for an eTA only if they meet at least 1 of the 2 eligibility requirements at the time of application:\n\n* have held a Canadian temporary resident visa(TRV) in the past 10 years\n* hold a valid United States(U.S.) non-immigrant visa\n\nOfficers should note that foreign nationals must also be travelling to Canada by air.\n\nGCMS creates a “Document Validation” activity only for eTA expansion clients, in the eTA application “Automation” tab, and auto-generates the following sub-activities:\n\n* “Validate CAN Visa” (GCMS check of the Canadian TRV)\n* “Validate USA Visa” (check of the U.S. non-immigrant visa)\n\nThe “Document Validation” activity is set to “Review Required” when at least 1 of the sub-activities is set to “Review Required”. This means that the eligibility requirement **has not been met**. An officer may refuse to issue an eTA, under subsection R7.01(2), **only after** verifying that the matched client is the right client (for example, by researching GCMS history or information provided in the application).\n\nThe “Document Validation” activity is set to “No Review Required” when at least 1 of the sub-activities is also set to “No Review Required”. This means that the eligibility requirement **has been met**. In this instance, the application does not drop out for manual review at this eligibility stage but continues through the automated processing continuum.\n\n### Previous TRV holder\n\nFor applicants who declare that they have held a Canadian TRV in the past 10 years, the system automatically searches GCMS for an approved Canadian TRV issued in the 10-year period immediately preceding the date of the application.\n\nIf no Canadian TRV is found, and if the client also provided U.S. non-immigrant visa information, a “Validate USA Visa” sub-activity is created. When the result of this query is “Review Required” (that is, the activity and sub-activity), the case may be refused, under subsection R7.01(2).\n\nIf no Canadian TRV is found, the case is referred for manual review (the “Document Validation” activity is set to “Review Required”, and the “Validate CAN visa” sub-activity is set to “Review Required”). The case may be refused, under subsection R7.01(2), for failure to meet the eligibility requirement.\n\n### Holders of a valid U.S. non-immigrant visa\n\nFor applicants who declare that they hold a U.S. non-immigrant visa at the time of application, the system automatically searches GCMS for an approved Canadian TRV issued in the 10-year period immediately preceding the date of the application.\n\nIf no previous Canadian TRV is found, GCMS automatically sends a U.S. visa validation query to the U.S. The case may be **refused**, under subsection R7.01(2), for failure to meet the eligibility requirement when the “Document Validation” activity and “Validate USA Visa” sub-activity are set to “Review Required”, and the result is\n\n* Complete – No Valid Document\n* Complete – Lost/Stolen Document\n* Complete – Revoked\n\nAdverse information associated with an eTA applicant\n----------------------------------------------------\n\nIf the applicant previously applied for entry to Canada, either through an IRCC program or the Canada Border Services Agency(CBSA), at the port of entry(POE), or if they are already known to IRCC (for example, through intelligence), and if there is adverse information on file for them, it is uncovered through the automated eTA screening process performed in GCMS, which causes the application to be referred for manual review.\n\nAssessing admissibility\n-----------------------\n\nPart 1, Division 4, of the Immigration and Refugee Protection Act(IRPA) refers to inadmissibilities.\n\nTo facilitate the assessment of admissibility, the officer can\n\n* execute a Canadian criminal record check\n* request documents from the applicant (this process should be used to [obtain evidence (PDF, 177 KB)](https://www.canada.ca/content/dam/ircc/migration/ircc/english/resources/manuals/enf/enf17-eng.pdf))\n\nWhen making a decision on an eTA application, the officer should also consider notable [inadmissibility jurisprudence (PDF, 621 KB)](https://www.canada.ca/content/dam/ircc/migration/ircc/english/resources/manuals/enf/enf01-eng.pdf).\n\nOfficers should note that cases for very important people where there is a known inadmissibility on file should be referred to an overseas officer for manual review. Officers who encounter such cases must contact the IRCC Case Management Branch(CMB) to determine if the individual is eligible for a public policy eTA, national interest eTA or national interest temporary resident permit. Officers must also familiarize themselves with the procedures for handling high-profile, complex, sensitive or contentious cases.\n\nSimilarly, if the officer encounters an application from an intending diplomat or official, the officer should contact the CMB to make them aware of the application. The CMB then consults with Global Affairs Canada(GAC) when necessary. Officers should not refuse these applications without first contacting GAC.\n\nAssessing multiple electronic travel authorization (eTA) applications\n---------------------------------------------------------------------\n\nData entry errors with an incorrect passport number or country of issuance may result in unexpected delays for travellers. Although this is just one of various scenarios, this could prompt clients to re-apply for additional electronic travel authorization (eTAs), as no physical eTA document exists other than the approval email.\n\n### When multiple applications exist\n\nThe assigned officer should collectively review all the applications and make an informed decision, based on the information provided. The final decision should be recorded on the latest application. The officer should cancel the earlier application or applications and the automatically generated cancellation letter or letters, to reduce confusion, so that clients receive only 1 correspondence regarding their eTA. This is important, as clients can refer only to a single eTA number when [verifying the status of their eTA online](https://onlineservices-servicesenligne.cic.gc.ca/eta/applicationQuery?lang=en).\n\nRevalidating, inactivating and refusing an eTA\n----------------------------------------------\n\nTo support the policy intent of the eTA Program, [sections 12.06](http://laws-lois.justice.gc.ca/eng/regulations/SOR-2002-227/section-12.06.html) and [12.07](http://laws-lois.justice.gc.ca/eng/regulations/SOR-2002-227/section-12.07.html) of the Immigration and Refugee Protection Regulations (IRPR) provide IRCC with the authority to revalidate and, if appropriate, cancel or inactivate a previously approved eTA document and refuse the associated eTA application.\n\nSection R12.06 describes instances where an eTA holder becomes ineligible to hold an eTA. Section R12.07 allows an officer to refuse an eTA application if a foreign national is inadmissible or becomes ineligible under section R12.06.\n\n### Legal threshold for revalidations\n\nThe legal threshold for determining if an active eTA should be revalidated, refused or both is a determination of inadmissibility or ineligibility, based on a “balance of probabilities”. However, for serious inadmissibility included in sections A34 to A37, the lower threshold of “reasonable grounds to believe” applies. The inadmissibility does not need to be proven; it is enough for the officer to be satisfied, on reasonable grounds, that the applicant is inadmissible to Canada based on the information available.\n\nEstablishing eTA validity\n-------------------------\n\nAn eTA is valid for 5 years, until passport expiry or until it is cancelled by an officer, whichever occurs first.\n\nThe IRPR also stipulate that an eTA ceases to be valid the day a new eTA is issued to the same person. The only exception to this rule is when an applicant possesses 2 different types of passports (for example, a regular passport and a diplomatic passport). In these cases, GCMS is programmed to allow the applicant to hold multiple eTAs.\n\nService standards\n-----------------\n\nThere are no set service standards for the paper application process.\n\nPage details\n------------\n\n 2023-04-13",
  "sections": [
    {
      "heading": "Manually processing electronic travel authorization applications",
      "heading_path": [
        "Manually processing electronic travel authorization applications"
      ],
      "anchor": "#manually-processing-electronic-travel-authorization-applications",
      "text": "Published Time: Wed, 11 Feb 2026 22:00:37 GMT\n\nManually processing electronic travel authorization applications\n================================================================\n\nThis section contains policy, procedures and guidance used by IRCC staff. It is posted on the department’s website as a courtesy to stakeholders.\n\nApplications for electronic travel authorizations(eTAs), including eTA expansion, are, for the most part, online, automated applications. Applications that are not approved automatically by the Global Case Management System(GCMS) require manual review at the Operations Support Centre(OSC). Applications may trigger manual review at different stages for either or both of the following reasons:\n\n* identity reconciliation\n* derogatory information\n\neTA and eTA expansion applications are manually processed using essentially the same procedures.\n\nOn this page\n------------\n\n* [Canadian citizen applicants](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/eta/manually-processing-electronic-travel-authorization-applications.html#s01)\n* [Canadian permanent resident applicants](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/eta/manually-processing-electronic-travel-authorization-applications.html#s02)\n* [eTA expansion](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/eta/manually-processing-electronic-travel-authorization-applications.html#s03)\n* [Adverse information associated with an eTA applicant](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/eta/manually-processing-electronic-travel-authorization-applications.html#s04)\n* [Assessing admissibility](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/eta/manually-processing-electronic-travel-authorization-applications.html#s05)\n* [Assessing multiple electronic travel authorization (eTA) applications](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/eta/manually-processing-electronic-travel-authorization-applications.html#s06)\n* [Revalidating, inactivating and refusing an eTA](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/eta/manually-processing-electronic-travel-authorization-applications.html#s07)\n* [Establishing eTA validity](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/eta/manually-processing-electronic-travel-authorization-applications.html#s08)\n* [Service standards](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/eta/manually-processing-electronic-travel-authorization-applications.html#s09)\n\nCanadian citizen applicants\n---------------------------\n\nCanadian citizens are not eligible to apply for an eTA and must travel to Canada using a Canadian passport. If GCMS identifies an eTA applicant as a Canadian citizen, the application drops out of the automated process. GCMS can identify a Canadian citizen only if the individual is a naturalized citizen. Dual-national individuals who are citizens by birth do not have a record of their citizenship in GCMS and are, therefore, not identifiable by GCMS.\n\n**Officers should consider the following:**\n\n* Does the applicant’s immigration history confirm that they were indeed granted Canadian citizenship?\n* Is there any information in GCMS that indicates Canadian citizenship has been revoked (this may include GCMS records or notes from previous applications)?"
    },
    {
      "heading": "Procedure",
      "heading_path": [
        "Manually processing electronic travel authorization applications",
        "Procedure"
      ],
      "anchor": "#procedure",
      "text": "Level-1 decision makers at the OSC query for these applications by performing a search in “IMM activities”, under “Automation”. The “Activity” is set to “Derogatory Information”, the “Sub-activity” is set to “Client Derogatory Information” and the “Status” is set to “Review Required”.\n\nThe officer should determine if the applicant is a Canadian citizen.\n\nIf the officer determines that the applicant is a Canadian citizen, the officer should withdraw the application.\n\nThe officer should contact the applicant and advise them that their application has been withdrawn and that they must use their Canadian travel document to enter Canada.\n\nCanadian permanent resident applicants\n--------------------------------------\n\nIn some cases, applications can drop out of the automated process because the individual appears to be a permanent resident of Canada.\n\nIf the applicant is a permanent resident of Canada, they are not eligible for an eTA. See information on the [travel requirements for Canadian permanent residents](https://www.canada.ca/en/immigration-refugees-citizenship/services/permanent-residents/travel-document.html).\n\n**Officers should consider the following:**\n\n* Does the applicant’s immigration history confirm that they were indeed granted permanent residence?\n* Is there any information that shows that the applicant either lost or renounced their permanent resident status? Officers should note that, even if a person has renounced their status, their GCMS profile often still shows them as a permanent resident. Officers should look for more details regarding a possible renunciation if the GCMS profile is still listed as a permanent resident."
    },
    {
      "heading": "Procedure",
      "heading_path": [
        "Manually processing electronic travel authorization applications",
        "Procedure",
        "Procedure"
      ],
      "anchor": "#procedure",
      "text": "Level 1 decision makers at the OSC query for these applications by performing a search in “IMM activities”, under “Automation”. The “Activity” is set to “Derogatory Information”, the “Sub activity” is set to “Client Derogatory Information” and the “Status” is set to “Review Required”.\n\nIf the applicant is a permanent resident and has not already gone through the formal process of relinquishing their status, they should be contacted to determine if they would like to relinquish their status voluntarily.\n\n* if the applicant does not want to relinquish their status or does not reply to the request, the officer must \n * withdraw the application\n * advise the applicant that they need to get an appropriate travel document that demonstrates that they are a permanent resident, which may necessitate a determination of their status (see [OP 10 Permanent Residency Status Determination (PDF, 653 KB)](https://www.canada.ca/content/dam/ircc/migration/ircc/english/resources/manuals/op/op10-eng.pdf))\n\n* if the applicant wants to relinquish their status, \n * they may do so electronically (see Renouncing permanent residence) via their secure Immigration, Refugees and Citizenship Canada(IRCC) account, as part of their eTA application, or by submitting a paper application to their local migration office\n * once they have done so, assuming they are otherwise admissible, the officer may issue the eTA\n\neTA expansion\n-------------"
    },
    {
      "heading": "Referrals for manual review",
      "heading_path": [
        "Manually processing electronic travel authorization applications",
        "Procedure",
        "Referrals for manual review"
      ],
      "anchor": "#referrals-for-manual-review",
      "text": "eTA expansion cases are referred for manual review for the same reasons as other eTA applications. However, eTA expansion cases undergo additional automated eligibility checks. Therefore, there are additional points in the eTA processing continuum at which an eTA expansion application may be referred to the OSC for manual review."
    },
    {
      "heading": "Assessing eTA expansion eligibility results",
      "heading_path": [
        "Manually processing electronic travel authorization applications",
        "Procedure",
        "Assessing eTA expansion eligibility results"
      ],
      "anchor": "#assessing-eta-expansion-eligibility-results",
      "text": "Per [subsections 7.01(1) and (2)](http://laws-lois.justice.gc.ca/eng/regulations/SOR-2002-227/section-7.01.html) of the Immigration and Refugee Protection Regulations(IRPR), foreign nationals may apply for an eTA only if they meet at least 1 of the 2 eligibility requirements at the time of application:\n\n* have held a Canadian temporary resident visa(TRV) in the past 10 years\n* hold a valid United States(U.S.) non-immigrant visa\n\nOfficers should note that foreign nationals must also be travelling to Canada by air.\n\nGCMS creates a “Document Validation” activity only for eTA expansion clients, in the eTA application “Automation” tab, and auto-generates the following sub-activities:\n\n* “Validate CAN Visa” (GCMS check of the Canadian TRV)\n* “Validate USA Visa” (check of the U.S. non-immigrant visa)\n\nThe “Document Validation” activity is set to “Review Required” when at least 1 of the sub-activities is set to “Review Required”. This means that the eligibility requirement **has not been met**. An officer may refuse to issue an eTA, under subsection R7.01(2), **only after** verifying that the matched client is the right client (for example, by researching GCMS history or information provided in the application).\n\nThe “Document Validation” activity is set to “No Review Required” when at least 1 of the sub-activities is also set to “No Review Required”. This means that the eligibility requirement **has been met**. In this instance, the application does not drop out for manual review at this eligibility stage but continues through the automated processing continuum."
    },
    {
      "heading": "Previous TRV holder",
      "heading_path": [
        "Manually processing electronic travel authorization applications",
        "Procedure",
        "Previous TRV holder"
      ],
      "anchor": "#previous-trv-holder",
      "text": "For applicants who declare that they have held a Canadian TRV in the past 10 years, the system automatically searches GCMS for an approved Canadian TRV issued in the 10-year period immediately preceding the date of the application.\n\nIf no Canadian TRV is found, and if the client also provided U.S. non-immigrant visa information, a “Validate USA Visa” sub-activity is created. When the result of this query is “Review Required” (that is, the activity and sub-activity), the case may be refused, under subsection R7.01(2).\n\nIf no Canadian TRV is found, the case is referred for manual review (the “Document Validation” activity is set to “Review Required”, and the “Validate CAN visa” sub-activity is set to “Review Required”). The case may be refused, under subsection R7.01(2), for failure to meet the eligibility requirement."
    },
    {
      "heading": "Holders of a valid U.S. non-immigrant visa",
      "heading_path": [
        "Manually processing electronic travel authorization applications",
        "Procedure",
        "Holders of a valid U.S. non-immigrant visa"
      ],
      "anchor": "#holders-of-a-valid-u-s-non-immigrant-visa",
      "text": "For applicants who declare that they hold a U.S. non-immigrant visa at the time of application, the system automatically searches GCMS for an approved Canadian TRV issued in the 10-year period immediately preceding the date of the application.\n\nIf no previous Canadian TRV is found, GCMS automatically sends a U.S. visa validation query to the U.S. The case may be **refused**, under subsection R7.01(2), for failure to meet the eligibility requirement when the “Document Validation” activity and “Validate USA Visa” sub-activity are set to “Review Required”, and the result is\n\n* Complete – No Valid Document\n* Complete – Lost/Stolen Document\n* Complete – Revoked\n\nAdverse information associated with an eTA applicant\n----------------------------------------------------\n\nIf the applicant previously applied for entry to Canada, either through an IRCC program or the Canada Border Services Agency(CBSA), at the port of entry(POE), or if they are already known to IRCC (for example, through intelligence), and if there is adverse information on file for them, it is uncovered through the automated eTA screening process performed in GCMS, which causes the application to be referred for manual review.\n\nAssessing admissibility\n-----------------------\n\nPart 1, Division 4, of the Immigration and Refugee Protection Act(IRPA) refers to inadmissibilities.\n\nTo facilitate the assessment of admissibility, the officer can\n\n* execute a Canadian criminal record check\n* request documents from the applicant (this process should be used to [obtain evidence (PDF, 177 KB)](https://www.canada.ca/content/dam/ircc/migration/ircc/english/resources/manuals/enf/enf17-eng.pdf))\n\nWhen making a decision on an eTA application, the officer should also consider notable [inadmissibility jurisprudence (PDF, 621 KB)](https://www.canada.ca/content/dam/ircc/migration/ircc/english/resources/manuals/enf/enf01-eng.pdf).\n\nOfficers should note that cases for very important people where there is a known inadmissibility on file should be referred to an overseas officer for manual review. Officers who encounter such cases must contact the IRCC Case Management Branch(CMB) to determine if the individual is eligible for a public policy eTA, national interest eTA or national interest temporary resident permit. Officers must also familiarize themselves with the procedures for handling high-profile, complex, sensitive or contentious cases.\n\nSimilarly, if the officer encounters an application from an intending diplomat or official, the officer should contact the CMB to make them aware of the application. The CMB then consults with Global Affairs Canada(GAC) when necessary. Officers should not refuse these applications without first contacting GAC.\n\nAssessing multiple electronic travel authorization (eTA) applications\n---------------------------------------------------------------------\n\nData entry errors with an incorrect passport number or country of issuance may result in unexpected delays for travellers. Although this is just one of various scenarios, this could prompt clients to re-apply for additional electronic travel authorization (eTAs), as no physical eTA document exists other than the approval email."
    },
    {
      "heading": "When multiple applications exist",
      "heading_path": [
        "Manually processing electronic travel authorization applications",
        "Procedure",
        "When multiple applications exist"
      ],
      "anchor": "#when-multiple-applications-exist",
      "text": "The assigned officer should collectively review all the applications and make an informed decision, based on the information provided. The final decision should be recorded on the latest application. The officer should cancel the earlier application or applications and the automatically generated cancellation letter or letters, to reduce confusion, so that clients receive only 1 correspondence regarding their eTA. This is important, as clients can refer only to a single eTA number when [verifying the status of their eTA online](https://onlineservices-servicesenligne.cic.gc.ca/eta/applicationQuery?lang=en).\n\nRevalidating, inactivating and refusing an eTA\n----------------------------------------------\n\nTo support the policy intent of the eTA Program, [sections 12.06](http://laws-lois.justice.gc.ca/eng/regulations/SOR-2002-227/section-12.06.html) and [12.07](http://laws-lois.justice.gc.ca/eng/regulations/SOR-2002-227/section-12.07.html) of the Immigration and Refugee Protection Regulations (IRPR) provide IRCC with the authority to revalidate and, if appropriate, cancel or inactivate a previously approved eTA document and refuse the associated eTA application.\n\nSection R12.06 describes instances where an eTA holder becomes ineligible to hold an eTA. Section R12.07 allows an officer to refuse an eTA application if a foreign national is inadmissible or becomes ineligible under section R12.06."
    },
    {
      "heading": "Legal threshold for revalidations",
      "heading_path": [
        "Manually processing electronic travel authorization applications",
        "Procedure",
        "Legal threshold for revalidations"
      ],
      "anchor": "#legal-threshold-for-revalidations",
      "text": "The legal threshold for determining if an active eTA should be revalidated, refused or both is a determination of inadmissibility or ineligibility, based on a “balance of probabilities”. However, for serious inadmissibility included in sections A34 to A37, the lower threshold of “reasonable grounds to believe” applies. The inadmissibility does not need to be proven; it is enough for the officer to be satisfied, on reasonable grounds, that the applicant is inadmissible to Canada based on the information available.\n\nEstablishing eTA validity\n-------------------------\n\nAn eTA is valid for 5 years, until passport expiry or until it is cancelled by an officer, whichever occurs first.\n\nThe IRPR also stipulate that an eTA ceases to be valid the day a new eTA is issued to the same person. The only exception to this rule is when an applicant possesses 2 different types of passports (for example, a regular passport and a diplomatic passport). In these cases, GCMS is programmed to allow the applicant to hold multiple eTAs.\n\nService standards\n-----------------\n\nThere are no set service standards for the paper application process.\n\nPage details\n------------\n\n 2023-04-13"
    }
  ],
  "links": {
    "outbound": [
      "https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/eta/manually-processing-electronic-travel-authorization-applications.html",
      "https://www.canada.ca/en/immigration-refugees-citizenship/services/permanent-residents/travel-document.html",
      "https://www.canada.ca/content/dam/ircc/migration/ircc/english/resources/manuals/op/op10-eng.pdf",
      "http://laws-lois.justice.gc.ca/eng/regulations/SOR-2002-227/section-7.01.html",
      "https://www.canada.ca/content/dam/ircc/migration/ircc/english/resources/manuals/enf/enf17-eng.pdf",
      "https://www.canada.ca/content/dam/ircc/migration/ircc/english/resources/manuals/enf/enf01-eng.pdf",
      "https://onlineservices-servicesenligne.cic.gc.ca/eta/applicationQuery?lang=en",
      "http://laws-lois.justice.gc.ca/eng/regulations/SOR-2002-227/section-12.06.html",
      "http://laws-lois.justice.gc.ca/eng/regulations/SOR-2002-227/section-12.07.html"
    ],
    "internal_children": []
  },
  "quality": {
    "is_toc_like": false,
    "is_low_text": false,
    "notes": []
  }
}