{
  "source_id": "pdi_4402cd9af5db",
  "source_type": "guidance_pdi",
  "source_url": "https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/foreign-workers/international-free-trade-agreements/canada-chile/professionals.html",
  "canonical_url": "https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/foreign-workers/international-free-trade-agreements/canada-chile/professionals.html",
  "title": "Professionals – CCFTA [R204(a) – F22] - Agreements or arrangements - International Mobility Program",
  "language": "en",
  "manual": "Professionals – CCFTA [R204(a) – F22]",
  "chapter": "Agreements or arrangements",
  "heading_path": [
    "Professionals – CCFTA [R204(a) – F22] - Agreements or arrangements - International Mobility Program"
  ],
  "last_updated": "2025-01-20",
  "crawl_ts": "2026-02-12T00:00:00Z",
  "http": {
    "status_code": 200,
    "content_type": "text/markdown"
  },
  "content_hash": "d49c8d81b45702aee1ecc70297b6e5d4202bf4c32a9a0838878282988289bfe6",
  "raw_html_path": null,
  "markdown_path": "scripts/scraper/ircc_data_clean/professionals-4402cd9af5.md",
  "text": "Published Time: Wed, 11 Feb 2026 22:14:04 GMT\n\nProfessionals – CCFTA [R204(a) – F22] - Agreements or arrangements - International Mobility Program\n===================================================================================================\n\nThis section contains policy, procedures and guidance used by IRCC staff. It is posted on the department’s website as a courtesy to stakeholders.\n\nIn these instructions “officers” refers to employees of both Immigration, Refugees and Citizenship Canada and the Canada Border Services Agency.\n\nThe instructions on this page should be reviewed in conjunction with\n\n* [Employer-specific work permits – General processing – International Mobility Program](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/foreign-workers/eligibility/employer-specific-labout-market-impact-assessment-exemptions.html)\n* [Assessing the genuineness of the offer of employment on a work permit application](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/foreign-workers/genuineness.html)\n* [Conditions and validity period on work permits](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/foreign-workers/eligibility/eligibility-admissibility-conditions-including-validity-period.html)\n* [Public list of Employers who have been non-compliant](https://www.canada.ca/en/immigration-refugees-citizenship/services/work-canada/employers-non-compliant.html)\n\nThe [Canada-Chile Free Trade Agreement (CCFTA)](https://www.international.gc.ca/trade-commerce/trade-agreements-accords-commerciaux/agr-acc/chile-chili/index.aspx?lang=eng) is an international agreement between Canada and Chile, and as such any work permit applications are assessed under [paragraph 204(a)](https://laws-lois.justice.gc.ca/eng/regulations/SOR-2002-227/section-204.html) of the Immigration and Refugee Protection Regulations (IRPR). This regulatory section falls under the International Mobility Program.\n\nProfessionals can also be authorized to enter Canada as business visitors (General Service provision of [Appendix K-03.I.1](https://www.international.gc.ca/trade-commerce/trade-agreements-accords-commerciaux/agr-acc/chile-chili/fta-ale/03k.aspx?lang=eng#:~:text=card%20for%20foreigners.-,Appendix%20K%2D03.I.1,-Business%20Visitors) of the CCFTA) under [R186(a)](https://laws-lois.justice.gc.ca/eng/regulations/SOR-2002-227/section-186.html) when they are not seeking to enter the labour market (meet criteria applicable to business visitors) but will be performing activities such as soliciting business, consulting, providing advice and meeting clients.\n\nOn this page\n------------\n\n* [Eligibility](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/foreign-workers/international-free-trade-agreements/canada-chile/professionals.html#s1)\n* [Documentary evidence](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/foreign-workers/international-free-trade-agreements/canada-chile/professionals.html#s2)\n* [Place of application](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/foreign-workers/international-free-trade-agreements/canada-chile/professionals.html#s3)\n* [Application assessment](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/foreign-workers/international-free-trade-agreements/canada-chile/professionals.html#s4)\n* [Final decision](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/foreign-workers/international-free-trade-agreements/canada-chile/professionals.html#s5)\n* [Length of stay](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/foreign-workers/international-free-trade-agreements/canada-chile/professionals.html#s6)\n* [List of eligible professions under the CCFTA Professionals category](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/foreign-workers/international-free-trade-agreements/canada-chile/professionals.html#s7)\n\nEligibility\n-----------\n\nTo be eligible for a work permit in the professionals category, a foreign national must:\n\n* be a citizen of Chile;\n* be in an occupation identified in [Appendix K-03.IV.1](https://www.international.gc.ca/trade-commerce/trade-agreements-accords-commerciaux/agr-acc/chile-chili/fta-ale/03k.aspx?lang=eng#:~:text=de%20Extranjer%C3%ADa%22).-,Appendix%20K%2D03.IV.1,-Professionals) of the CCFTA;\n* be qualified to work in that profession (degree or certification in a related educational program);\n* have pre-arranged employment with a Canadian employer;\n* be providing professional level services in the field of qualification as indicated in the Appendix; and\n* compliant with all other requirements for temporary entry.\n\nDocumentary evidence\n--------------------\n\nA foreign national must provide sufficient documentary evidence to satisfy an officer that they are eligible for entry.\n\nThe following documents are required:\n\n* proof of Chilean citizenship;\n* proof that the applicant meets the minimum education requirements or alternative credentials listed in [Appendix K-03.IV.1](https://www.international.gc.ca/trade-commerce/trade-agreements-accords-commerciaux/agr-acc/chile-chili/fta-ale/03k.aspx?lang=eng#:~:text=de%20Extranjer%C3%ADa%22).-,Appendix%20K%2D03.IV.1,-Professionals) of the CCFTA (copies of degrees, diplomas, professional licences, accreditation or registration, etc.);\n* an offer of employment submitted through the Employer Portal or through [alternate means](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/visitors/place-application-visa-electronic-travel-authorization-study-permit-work-permit/exempt-electronic-applications.html#exceptions) if authorized \n * the offer of employment provides confirmation of the pre-arranged employment;\n * the proposed employer in Canada;\n * the profession for which entry is sought;\n * details of the position (title, duties, duration of employment, arrangements as to payment); and\n * the educational qualifications or alternative credentials required for the position.\n\n* The onus is on the foreign national to provide evidence that they meet the eligibility criteria. Evidence may include, but is not limited to, the following: \n * reference letters\n * letter of support from the company\n * job descriptions that outlines the level of training acquired\n * years of experience in the field\n * degrees or certifications obtained in the field\n * list of publications and awards (where applicable)\n * a detailed description of the work to be performed in Canada.\n\nPlace of application\n--------------------\n\nForeign nationals that are exempt from the requirement for a temporary resident visa may apply for a work permit at the port of entry, as well as foreign nationals who otherwise meet the requirements of R198. For more information, see: [Temporary Foreign Worker Program (TFWP) and International Mobility Program (IMP): Persons who may apply at a port of entry](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/foreign-workers/persons-who-may-apply-port-entry.html).\n\nForeign nationals may apply for a work permit from within Canada if they meet the conditions set out in[section R199](http://laws-lois.justice.gc.ca/eng/regulations/sor-2002-227/section-199.html)of the Immigration and Refugee Protection Regulations.\n\nApplication Assessment\n----------------------\n\n### Review of the offer of employment\n\nWhen assessing if the work permit application meets the requirements for a CCFTA professional, officers should review the offer of employment that appears under the Employment Details tab in the Global Case Management System (GCMS) for information provided by the employer or the matching fields on the IMM 5802 form (if the employer was authorized to use it).\n\n| Field | Considerations |\n| --- | --- |\n| **LMIA Exemption Code** | **F22** – CCFTA – R204(a) – Professionals |\n| **Requirements Exemptions Met** | Information in this field outlines how the job and the foreign national meet the regulatory and trade agreement requirements, including that the applicant * will work in a TEER 0, 1, 2 or 3 occupation (or [NOC 0, A or B occupation](https://noc.esdc.gc.ca/)) * has the minimum educational and work experience requirements of their TEER category and occupation * has the required licence or certification if their occupation is regulated in the province or territory of destination. |\n| **NOC and Job Title** | Ensure that the occupational code and title are in the appropriate TEER for the occupation capacity. |\n| **Duration** | 3 year maximum on initial document |\n| **Employer** | Does the offer of employment provide confirmation of the pre-arranged employment? Is the proposed employer in Canada? Does the offer of employment give accurate details of the profession for which entry is sought: * title * duties * duration of employment * arrangements as to payment? |\n| **Duties and Job Requirements** | These are the activities that the foreign national will be performing. * Do they align with the occupation? * Are there specific requirements that align with the professional category of the applicant? * Does the employer require more than the minimum amount of paid work experience? |\n| **Wages** | **Note:**A mandatory wage assessment is not required for applicants under this category. However, for these applicants, wage remains an important indicator of knowledge, expertise and experience and should be taken into account as an important factor in an officer’s overall assessment, although officers should not refuse an application based on the wage alone. There is no requirement that the foreign national be paid by the Canadian [enterprise](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/terms-definitions.html#e1) or in Canadian dollars. |\n| **Minimum Education Requirements** | Do the educational requirements outlined in the offer of employment align with the minimum education requirements of the professional category? Are there additional or alternative requirements for this occupation defined in the NOC? |\n| **Other Training Required** | The employer may indicate specialty training as a requirement. |\n| **Provincial/Federal Certification, Licensing or Registration** | The employer should list any specific certification, licensing or registration required in Canada. Documented evidence should be provided with the application if the occupation is regulated by the province or territory; however, some occupations may require the foreign national to write an exam after they enter Canada, for example, for a licence from a regulated body or a first aid certificate. |\n\nRefer to [Employer-specific work permits – General processing – International Mobility Program](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/foreign-workers/eligibility/employer-specific-labout-market-impact-assessment-exemptions.html) for further guidance.\n\n### Pre-arranged employment\n\nIn this context, the Canadian employer may be an [enterprise](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/terms-definitions.html#e1) or an individual. The following are some examples of pre-arranged employment:\n\n* an employee-employer relationship with a Canadian enterprise; or\n* a contract between the professional and a Canadian enterprise; or\n* a contract between the professional’s Chilean employer and a Canadian enterprise.\n\n**Important:** The professionals category does not allow self-employment in Canada (i.e., soliciting business in the Canadian labour market). However, a Chilean citizen who is self-employed outside Canada is not barred from the professional category, provided the services to be rendered in Canada are pre-arranged with a Canadian employer.\n\n### Self-employment\n\nIf the Canadian enterprise is substantially controlled by the applicant, it is considered to be self-employment. For example, if the Canadian enterprise offering the employment is a sole proprietorship operated by the applicant, then entry cannot be granted under the Professionals category. Additionally, if the Canadian enterprise is legally distinct from the applicant, for example, a legal corporate entity but the entity is substantially controlled by the applicant, entry as a Professional must be refused.\n\nIn order to determine if an enterprise is substantially controlled, the following factors must be taken into account:\n\n* whether the applicant has established the business;\n* whether the applicant has primary, sole, or de facto control of the business;\n* whether the applicant is the primary, sole, or de facto owner of the business; and/or\n* whether the applicant is the primary, sole, or de facto recipient of income of the business.\n\nWhen a professional applies for a renewal of a work permit, the following activities may indicate that the applicant has been self-employed in Canada:\n\n* incorporation of a company in Canada expressly for the purpose of the business person being self-employed (incorporating does not automatically signify self-employment; the motives for incorporation need to be examined before making a determination);\n* initiation of communications (e.g., “job hunting” by direct mail or by advertising);\n* responding to advertisements for the purpose of obtaining employment or contracts; or\n* establishing an office which serves as a way to advertise (i.e., a “sign or a shingle” outside the door).\n\nThe following activities do not constitute self-employment:\n\n* responding to unsolicited inquiries about service which the professional may be able to perform; or\n* establishing an office from which to deliver pre-arranged service to clients.\n\n### Occupational qualifications\n\nA professional must be entering Canada to provide professional level services in a eligible occupation for which they are qualified. In making this determination, both the qualification of the individual and the position in Canada must be considered.\n\nOfficers must be satisfied that the applicant meets the qualifications indicated in the Minimum Education Requirements and Alternative Credentials of [Appendix K-03.IV.1](https://www.international.gc.ca/trade-commerce/trade-agreements-accords-commerciaux/agr-acc/chile-chili/fta-ale/03k.aspx?lang=eng#:~:text=de%20Extranjer%C3%ADa%22).-,Appendix%20K%2D03.IV.1,-Professionals) of the CCFTA, which represents only the minimum to permit entry and do not necessarily indicate the level of qualification required to actually work in that profession in Canada.\n\nFor [regulated professions](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/foreign-workers/regulated-certified-occupations.html), the officer must be satisfied that the professional has or can obtain the necessary licensing so that the applicant may [perform the work sought](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/foreign-workers/prohibitions.html#unable-perform).\n\nFor example, an accountant must be seeking to enter Canada as an accountant and not as a bookkeeper, which is not an occupation covered in [Appendix K-03.IV.1](https://www.international.gc.ca/trade-commerce/trade-agreements-accords-commerciaux/agr-acc/chile-chili/fta-ale/03k.aspx?lang=eng#:~:text=de%20Extranjer%C3%ADa%22).-,Appendix%20K%2D03.IV.1,-Professionals) of the CCFTA. Alternatively, a bookkeeper cannot be authorized to enter Canada to work as an accountant unless the applicant is also qualified as an accountant as indicated in the Minimum Education Requirements and Alternative Credentials of [Appendix K-03.IV.1](https://www.international.gc.ca/trade-commerce/trade-agreements-accords-commerciaux/agr-acc/chile-chili/fta-ale/03k.aspx?lang=eng#:~:text=de%20Extranjer%C3%ADa%22).-,Appendix%20K%2D03.IV.1,-Professionals) of the CCFTA. Additionally, to be authorized to enter Canada under the Professionals category, a corporate executive must be entering Canada to work in their field of qualification (i.e. an engineer where the details of the position requirements and job duties of a specific profession are integral to the job).\n\nIn instances where a baccalaureate degree is required, the degree must be in the specific field or in a closely related field. Baccalaureate degrees (or licenciatura) need not have been obtained in colleges or universities in Canada or Chile, whereas post secondary diplomas or certificates should have been earned in one of the two countries.\n\nIt is possible for a professional to be working in Canada on more than one contract at a time. A work permit must be issued for each individual contract.\n\n### Education requirements\n\n**“University Title”** means any document conferred by universities recognized by the Government of Chile and shall be deemed to be equivalent to the Minimum Education Requirements and Alternative Credentials for that profession. In the case of the profession of Lawyer (Abogado), the title is conferred by the Supreme Court of Chile.\n\n**“State/provincial licence”** and “State/provincial/national licence” mean any document issued by a provincial or national government, as the case may be, or under its authority, but not by a local government, that permits a person to engage in a regulated activity or profession.\n\n**“Post-Secondary Diploma**” means a credential issued, on completion of two or more years of post-secondary education, by an accredited academic institution in Canada or in Chile.\n\n**“Post-Secondary Certificate”** means a certificate issued, on completion of two or more years of post-secondary education at an academic institution: in the case of Chile, by the federal government or a state government, an academic institution recognized by the federal government or a state government, or an academic institution created by federal or state law.\n\n### Training\n\nProfessionals with a valid work permit can provide training related to their profession, including conducting seminars.\n\nThe training session must be pre-arranged with a Canadian employer and the subject matter must be at the professional level. Entry does not allow seminar leaders to engage in training that is not pre-arranged with a Canadian employer.\n\nThe training must form part of the professional training or development of the participants and must be related to their job duties.\n\nFinal decision\n--------------\n\n### Approval\n\nThe work permit will be issued under the authority of paragraph [R204(a)](https://laws-lois.justice.gc.ca/eng/regulations/SOR-2002-227/section-204.html).\n\nIn GCMS, under the Application screen, officers should enter the information below in the specified fields.\n\n| Field | Selection or input |\n| --- | --- |\n| **Case type** | 52 |\n| **Province of destination** | The province of destination entered by the applicant should match the address of employment in the IMP offer of employment. This information is under the **Employment Details – LMIA-exempt** tab. If there is more than one location, officers should enter the primary location in the “Province of destination” field and the secondary location in the “User remarks” field. |\n| **City of destination** | The city of destination entered by the applicant should match the address of employment in the IMP offer of employment. This information is under the **Employment Details – LMIA-exempt** tab. If there is more than one location, officers should enter “Unknown” in the “City of destination” field and “As per the offer” in the “User remarks” field. |\n| **Exemption code** | **F22** – CCFTA – R204(a) – Professionals This code is auto-populated from the IMP offer of employment. |\n| **NOC** | The NOC code is auto-populated from the IMP offer of employment. |\n| **Intended occupation** | Job title This is auto-populated from the IMP offer of employment. |\n| **LMIA/LMIA-exempt #** | “A” number from the work permit application. This number is auto-populated from the work permit application, and it is what is used to “match” in the Portal. If the work permit application was submitted on paper, the officer must manually enter the number. |\n| **Employer** | Business operating name |\n| **Duration** | Officers may issue a work permit that is valid for the duration of the offer of employment or until the expiry of the travel document, whichever is earlier. Refer to [Validity period for work permits](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/foreign-workers/eligibility/eligibility-admissibility-conditions-including-validity-period.html#validity). |\n\n**Note:** If the employer is authorized to use an IMM 5802 form instead of completing the offer of employment through the Employer Portal, please see [Employer-specific work permits – General processing – International Mobility Program](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/foreign-workers/eligibility/employer-specific-labout-market-impact-assessment-exemptions.html).\n\n### Refusal\n\nIf an officer is not satisfied that all the requirements of [R200](https://laws-lois.justice.gc.ca/eng/regulations/SOR-2002-227/section-200.html), including the assessment under [R204(a)](https://laws-lois.justice.gc.ca/eng/regulations/SOR-2002-227/section-204.html), are met, they must record their reasons and outline the rationale underlying the decision as well as the facts and elements considered. They must also provide an explanation for the decision in a case note.\n\nA decision is reasonable and therefore defendable when another person is able to trace the decision maker’s reasoning, without encountering fatal flaws in the overarching logic, and is satisfied that there is a line of analysis within the given reasons that could reasonably lead the tribunal from the evidence before it to the decision maker’s conclusion.\n\nThe officer needs to engage with the documentary evidence that was provided by the applicant. Simply stating ‘I have reviewed the submissions and I am not satisfied that R204 is met’ **is not sufficient** for another reasonable person to understand the logic of the decision without reviewing all of the evidence again.\n\nRefusal reasons should clearly indicate which criteria or what requirement of R200 was not met and explain how the conclusion was reached.\n\nFor assistance, officers can follow the steps in [Decision making: Standard of review and process for making a reasonable decision](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/service-delivery/decision-standard-review.html).\n\n#### Refusal grounds in the GCMS\n\nThe GCMS has standard text for refusal grounds. Officers should ensure that the refusal grounds selected for the refusal letter match the reasons that they have stated in their case note.\n\nIf an officer has reasonable grounds to believe that the applicant is not able to perform the work sought, they should select the paragraph “R200(3)(a)**You were not able to demonstrate that you will be able to adequately perform the work you seek**.” Officers should ensure that they clearly indicate in their refusal notes why they are not satisfied.\n\nGiven that there is no specific refusal ground for FTA categories in GCMS for when a officer is not satisfied that the criteria has been met, **they should select the refusal ground “Other” and add a short explanation in the Comments field that they are not satisfied that section R200 or paragraph R204(a) are met.**\n\nLength of stay\n--------------\n\nInitial work permits can be granted for durations of up to 3 years.\n\nExtensions can also be issued in increments of up to 3 years with no limit on the number of extensions providing the individual continues to comply with the requirements for professionals.\n\nOfficers must be satisfied that the employment is still “temporary” and that the foreign national is not using CCFTA entry as a means of circumventing normal immigration procedures.\n\nList of eligible professions under the CCFTA Professionals category\n-------------------------------------------------------------------\n\n### General\n\n| Profession | Minimum education requirements and alternative credentials |\n| --- | --- |\n| Accountant | Baccalaureate or Licenciatura Degree; or C.P.A., C.A., C.G.A. or C.M.A; or Contador auditor or Contador público(University Title) C.P.A.: Certified Public Accountant; C.A.: Chartered Accountant; C.G.A: Certified General Accountant; C.M.A.: Certified Management Accountant |\n| Architect | Baccalaureate or Licenciatura Degree; or state/provincial licence |\n| Computer Systems Analyst | Baccalaureate or Licenciatura Degree; or Post-Secondary Diploma or Post-Secondary Certificate, and three years experience |\n| Disaster Relief Insurance Claims Adjuster (claims adjuster employed by an insurance company located in the territory of a Party, or an independent claims adjuster) | Baccalaureate or Licenciatura Degree, and successful completion of training in the appropriate areas of insurance adjustment pertaining to disaster relief claims; or three years experience in claims adjustment and successful completion of training in the appropriate areas of insurance adjustment pertaining to disaster relief claims |\n| Economist (including Commercial Engineer in Chile) | Baccalaureate or Licenciatura Degree |\n| Engineer | Baccalaureate or Licenciatura Degree; or state/provincial licence |\n| Forester | Baccalaureate or Licenciatura Degree; or state/provincial licence |\n| Graphic Designer | Baccalaureate or Licenciatura Degree; or Post-Secondary Diploma or Post-Secondary Certificate, and three years experience |\n| Hotel Manager | Baccalaureate or Licenciatura Degree in hotel/restaurant management; or Post-Secondary Diploma or Post-Secondary Certificate in hotel/restaurant management, and three years experience in hotel/restaurant management |\n| Industrial Designer | Baccalaureate or Licenciatura Degree; or Post-Secondary Diploma or Post-Secondary Certificate, and three years experience |\n| Interior Designer | Baccalaureate or Licenciatura Degree; or Post-Secondary Diploma or Post-Secondary Certificate, and three years experience |\n| Land Surveyor | Baccalaureate or Licenciatura Degree; or state/provincial/ national licence |\n| Landscape Architect | Baccalaureate or Licenciatura Degree |\n| Lawyer (including Notary in the Province of Quebec) | LL.B., J.D., LL.L., B.C.L. or Licenciatura Degree (five years) or Abogado, or membership in a state/provincial bar LL.B.: Bachelor of Laws; J.D.: Doctor of Jurisprudence (not a doctorate); LL.L:Licence en Droit(Québec universities and University of Ottawa; B.C.L.: Bachelor of Civil Law |\n| Librarian | M.L.S. or B.L.S. or Magister en Bibliotecología(for which another Baccalaureate or Licenciatura Degree was a prerequisite) M.L.S.: Master of Library Science; B.L.S.: Bachelor of Library Science |\n| Management Consultant | Baccalaureate or Licenciatura Degree; or equivalent professional experience as established by statement or professional credential attesting to five years experience as a management consultant, or five years experience in a field of speciality related to the consulting agreement |\n| Mathematician (including Statistician) | Baccalaureate or Licenciatura Degree |\n| Range Manager/Range Conservationalist | Baccalaureate or Licenciatura Degree |\n| Research Assistant (working in a post-secondary educational institution) | Baccalaureate or Licenciatura Degree |\n| Scientific Technician/ Technologist | Possession of (a) theoretical knowledge of any of the following disciplines: agricultural sciences, astronomy, biology, chemistry, engineering, forestry, geology, geophysics, meteorology or physics; and (b) the ability to solve practical problems in any of those disciplines, or the ability to apply principles of any of those disciplines to basic or applied research |\n| Social Worker | Baccalaureate or Licenciatura Degree or Asistente Social/ Trabajador social(University Title) |\n| Sylviculturist (including Forestry Specialist) | Baccalaureate or Licenciatura Degree |\n| Technical Publications Writer | Baccalaureate or Licenciatura Degree; or Post-Secondary Diploma or Post-Secondary Certificate, and three years experience |\n| Urban Planner (including Geographer) | Baccalaureate or Licenciatura Degree |\n| Vocational Counsellor | Baccalaureate or Licenciatura Degree |\n\n### Medical/Allied Professionals\n\n| Profession | Minimum education requirements and alternative credentials |\n| --- | --- |\n| Dentist | D.D.S., D.M.D.,Doctor en Odontologia or Doctor en Cirugia Dental or Licenciatura en Odontologia; or state/provincial licence Doctor of Dental Surgery; D.M.D.: Doctor of Dental Medicine |\n| Dietitian | Baccalaureate or Licenciatura Degree or Dietista Nutricional(University Title); or state/provincial licence |\n| Medical Laboratory Technologist (Canada)/ Medical Technologist (Chile, Mexico and the United States of America) | Baccalaureate or Licenciatura Degree; or Post-Secondary Diploma or Post-Secondary Certificate, and three years experience |\n| Nutritionist | Baccalaureate or Licenciatura Degree or Nutricionista/Dietista Nutricional(University Title) |\n| Occupational Therapist | Baccalaureate or Licenciatura Degree or Terapeuta Ocupacional(University Title); or state/provincial licence |\n| Pharmacist | Baccalaureate or Licenciatura Degree; or state/provincial licence |\n| Physician (teaching or research only) | M.D. Medical Doctor or Doctor en Medicina or Médico Cirujano/Médico(University Title); or state/provincial licence |\n| Physiotherapist/Physical Therapist | Baccalaureate or Licenciatura Degree or Kinesiólogo/ Kinesioterapeuta(University Title) ; or state/provincial licence |\n| Psychologist | State/provincial licence; or Licenciatura Degree |\n| Recreational Therapist | Baccalaureate or Licenciatura Degree |\n| Registered Nurse | State/provincial licence, or Licenciatura Degree, or Enfermera(University Title) |\n| Veterinarian | D.V.M., Doctor of Veterinary Medicine or Doctor en Veterinaria or Médico Vet erinario(University Title); or state/provincial licence |\n\n### Scientists\n\n| Profession | Minimum education requirements and alternative credentials |\n| --- | --- |\n| Agriculturist (including Agronomist) | Baccalaureate or Licenciatura Degree |\n| Animal Breeder | Baccalaureate or Licenciatura Degree |\n| Animal Scientist | Baccalaureate or Licenciatura Degree |\n| Apiculturist | Baccalaureate or Licenciatura Degree |\n| Astronomer | Baccalaureate or Licenciatura Degree |\n| Biochemist | Baccalaureate or Licenciatura Degree |\n| Biologist | Baccalaureate or Licenciatura Degree |\n| Chemist | Baccalaureate or Licenciatura Degree |\n| Dairy Scientist | Baccalaureate or Licenciatura Degree |\n| Entomologist | Baccalaureate or Licenciatura Degree |\n| Epidemiologist | Baccalaureate or Licenciatura Degree |\n| Geneticist | Baccalaureate or Licenciatura Degree |\n| Geologist | Baccalaureate or Licenciatura Degree or Geólogo(University Title) |\n| Geochemist | Baccalaureate or Licenciatura Degree |\n| Geophysicist (including Oceanographer in Mexico and the United States of America) | Baccalaureate or Licenciatura Degree |\n| Horticulturist | Baccalaureate or Licenciatura Degree |\n| Meteorologist | Baccalaureate or Licenciatura Degree |\n| Pharmacologist | Baccalaureate or Licenciatura Degree |\n| Physicist (including Oceanographer in Canada and Chile) | Baccalaureate or Licenciatura Degree for Physicist;Oceanógrafo(University Title) for Oceanographer |\n| Plant Breeder | Baccalaureate or Licenciatura Degree |\n| Poultry Scientist | Baccalaureate or Licenciatura Degree |\n| Soil Scientist | Baccalaureate or Licenciatura Degree |\n| Zoologist | Baccalaureate or Licenciatura Degree |\n\n### Teachers\n\n| Profession | Minimum education requirements and alternative credentials (in a related field or profession) |\n| --- | --- |\n| College | Baccalaureate or Licenciatura Degree |\n| Seminary | Baccalaureate or Licenciatura Degree |\n| University | Baccalaureate or Licenciatura Degree |\n\nPage details\n------------\n\n 2025-01-20",
  "sections": [
    {
      "heading": "Professionals – CCFTA [R204(a) – F22] - Agreements or arrangements - International Mobility Program",
      "heading_path": [
        "Professionals – CCFTA [R204(a) – F22] - Agreements or arrangements - International Mobility Program"
      ],
      "anchor": "#professionals-ccfta-r204-a-f22-agreements-or-arrangements-international-mobility-program",
      "text": "Published Time: Wed, 11 Feb 2026 22:14:04 GMT\n\nProfessionals – CCFTA [R204(a) – F22] - Agreements or arrangements - International Mobility Program\n===================================================================================================\n\nThis section contains policy, procedures and guidance used by IRCC staff. It is posted on the department’s website as a courtesy to stakeholders.\n\nIn these instructions “officers” refers to employees of both Immigration, Refugees and Citizenship Canada and the Canada Border Services Agency.\n\nThe instructions on this page should be reviewed in conjunction with\n\n* [Employer-specific work permits – General processing – International Mobility Program](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/foreign-workers/eligibility/employer-specific-labout-market-impact-assessment-exemptions.html)\n* [Assessing the genuineness of the offer of employment on a work permit application](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/foreign-workers/genuineness.html)\n* [Conditions and validity period on work permits](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/foreign-workers/eligibility/eligibility-admissibility-conditions-including-validity-period.html)\n* [Public list of Employers who have been non-compliant](https://www.canada.ca/en/immigration-refugees-citizenship/services/work-canada/employers-non-compliant.html)\n\nThe [Canada-Chile Free Trade Agreement (CCFTA)](https://www.international.gc.ca/trade-commerce/trade-agreements-accords-commerciaux/agr-acc/chile-chili/index.aspx?lang=eng) is an international agreement between Canada and Chile, and as such any work permit applications are assessed under [paragraph 204(a)](https://laws-lois.justice.gc.ca/eng/regulations/SOR-2002-227/section-204.html) of the Immigration and Refugee Protection Regulations (IRPR). This regulatory section falls under the International Mobility Program.\n\nProfessionals can also be authorized to enter Canada as business visitors (General Service provision of [Appendix K-03.I.1](https://www.international.gc.ca/trade-commerce/trade-agreements-accords-commerciaux/agr-acc/chile-chili/fta-ale/03k.aspx?lang=eng#:~:text=card%20for%20foreigners.-,Appendix%20K%2D03.I.1,-Business%20Visitors) of the CCFTA) under [R186(a)](https://laws-lois.justice.gc.ca/eng/regulations/SOR-2002-227/section-186.html) when they are not seeking to enter the labour market (meet criteria applicable to business visitors) but will be performing activities such as soliciting business, consulting, providing advice and meeting clients.\n\nOn this page\n------------\n\n* [Eligibility](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/foreign-workers/international-free-trade-agreements/canada-chile/professionals.html#s1)\n* [Documentary evidence](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/foreign-workers/international-free-trade-agreements/canada-chile/professionals.html#s2)\n* [Place of application](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/foreign-workers/international-free-trade-agreements/canada-chile/professionals.html#s3)\n* [Application assessment](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/foreign-workers/international-free-trade-agreements/canada-chile/professionals.html#s4)\n* [Final decision](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/foreign-workers/international-free-trade-agreements/canada-chile/professionals.html#s5)\n* [Length of stay](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/foreign-workers/international-free-trade-agreements/canada-chile/professionals.html#s6)\n* [List of eligible professions under the CCFTA Professionals category](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/foreign-workers/international-free-trade-agreements/canada-chile/professionals.html#s7)\n\nEligibility\n-----------\n\nTo be eligible for a work permit in the professionals category, a foreign national must:\n\n* be a citizen of Chile;\n* be in an occupation identified in [Appendix K-03.IV.1](https://www.international.gc.ca/trade-commerce/trade-agreements-accords-commerciaux/agr-acc/chile-chili/fta-ale/03k.aspx?lang=eng#:~:text=de%20Extranjer%C3%ADa%22).-,Appendix%20K%2D03.IV.1,-Professionals) of the CCFTA;\n* be qualified to work in that profession (degree or certification in a related educational program);\n* have pre-arranged employment with a Canadian employer;\n* be providing professional level services in the field of qualification as indicated in the Appendix; and\n* compliant with all other requirements for temporary entry.\n\nDocumentary evidence\n--------------------\n\nA foreign national must provide sufficient documentary evidence to satisfy an officer that they are eligible for entry.\n\nThe following documents are required:\n\n* proof of Chilean citizenship;\n* proof that the applicant meets the minimum education requirements or alternative credentials listed in [Appendix K-03.IV.1](https://www.international.gc.ca/trade-commerce/trade-agreements-accords-commerciaux/agr-acc/chile-chili/fta-ale/03k.aspx?lang=eng#:~:text=de%20Extranjer%C3%ADa%22).-,Appendix%20K%2D03.IV.1,-Professionals) of the CCFTA (copies of degrees, diplomas, professional licences, accreditation or registration, etc.);\n* an offer of employment submitted through the Employer Portal or through [alternate means](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/visitors/place-application-visa-electronic-travel-authorization-study-permit-work-permit/exempt-electronic-applications.html#exceptions) if authorized \n * the offer of employment provides confirmation of the pre-arranged employment;\n * the proposed employer in Canada;\n * the profession for which entry is sought;\n * details of the position (title, duties, duration of employment, arrangements as to payment); and\n * the educational qualifications or alternative credentials required for the position.\n\n* The onus is on the foreign national to provide evidence that they meet the eligibility criteria. Evidence may include, but is not limited to, the following: \n * reference letters\n * letter of support from the company\n * job descriptions that outlines the level of training acquired\n * years of experience in the field\n * degrees or certifications obtained in the field\n * list of publications and awards (where applicable)\n * a detailed description of the work to be performed in Canada.\n\nPlace of application\n--------------------\n\nForeign nationals that are exempt from the requirement for a temporary resident visa may apply for a work permit at the port of entry, as well as foreign nationals who otherwise meet the requirements of R198. For more information, see: [Temporary Foreign Worker Program (TFWP) and International Mobility Program (IMP): Persons who may apply at a port of entry](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/foreign-workers/persons-who-may-apply-port-entry.html).\n\nForeign nationals may apply for a work permit from within Canada if they meet the conditions set out in[section R199](http://laws-lois.justice.gc.ca/eng/regulations/sor-2002-227/section-199.html)of the Immigration and Refugee Protection Regulations.\n\nApplication Assessment\n----------------------"
    },
    {
      "heading": "Review of the offer of employment",
      "heading_path": [
        "Professionals – CCFTA [R204(a) – F22] - Agreements or arrangements - International Mobility Program",
        "Review of the offer of employment"
      ],
      "anchor": "#review-of-the-offer-of-employment",
      "text": "When assessing if the work permit application meets the requirements for a CCFTA professional, officers should review the offer of employment that appears under the Employment Details tab in the Global Case Management System (GCMS) for information provided by the employer or the matching fields on the IMM 5802 form (if the employer was authorized to use it).\n\n| Field | Considerations |\n| --- | --- |\n| **LMIA Exemption Code** | **F22** – CCFTA – R204(a) – Professionals |\n| **Requirements Exemptions Met** | Information in this field outlines how the job and the foreign national meet the regulatory and trade agreement requirements, including that the applicant * will work in a TEER 0, 1, 2 or 3 occupation (or [NOC 0, A or B occupation](https://noc.esdc.gc.ca/)) * has the minimum educational and work experience requirements of their TEER category and occupation * has the required licence or certification if their occupation is regulated in the province or territory of destination. |\n| **NOC and Job Title** | Ensure that the occupational code and title are in the appropriate TEER for the occupation capacity. |\n| **Duration** | 3 year maximum on initial document |\n| **Employer** | Does the offer of employment provide confirmation of the pre-arranged employment? Is the proposed employer in Canada? Does the offer of employment give accurate details of the profession for which entry is sought: * title * duties * duration of employment * arrangements as to payment? |\n| **Duties and Job Requirements** | These are the activities that the foreign national will be performing. * Do they align with the occupation? * Are there specific requirements that align with the professional category of the applicant? * Does the employer require more than the minimum amount of paid work experience? |\n| **Wages** | **Note:**A mandatory wage assessment is not required for applicants under this category. However, for these applicants, wage remains an important indicator of knowledge, expertise and experience and should be taken into account as an important factor in an officer’s overall assessment, although officers should not refuse an application based on the wage alone. There is no requirement that the foreign national be paid by the Canadian [enterprise](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/terms-definitions.html#e1) or in Canadian dollars. |\n| **Minimum Education Requirements** | Do the educational requirements outlined in the offer of employment align with the minimum education requirements of the professional category? Are there additional or alternative requirements for this occupation defined in the NOC? |\n| **Other Training Required** | The employer may indicate specialty training as a requirement. |\n| **Provincial/Federal Certification, Licensing or Registration** | The employer should list any specific certification, licensing or registration required in Canada. Documented evidence should be provided with the application if the occupation is regulated by the province or territory; however, some occupations may require the foreign national to write an exam after they enter Canada, for example, for a licence from a regulated body or a first aid certificate. |\n\nRefer to [Employer-specific work permits – General processing – International Mobility Program](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/foreign-workers/eligibility/employer-specific-labout-market-impact-assessment-exemptions.html) for further guidance."
    },
    {
      "heading": "Pre-arranged employment",
      "heading_path": [
        "Professionals – CCFTA [R204(a) – F22] - Agreements or arrangements - International Mobility Program",
        "Review of the offer of employment",
        "Pre-arranged employment"
      ],
      "anchor": "#pre-arranged-employment",
      "text": "In this context, the Canadian employer may be an [enterprise](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/terms-definitions.html#e1) or an individual. The following are some examples of pre-arranged employment:\n\n* an employee-employer relationship with a Canadian enterprise; or\n* a contract between the professional and a Canadian enterprise; or\n* a contract between the professional’s Chilean employer and a Canadian enterprise.\n\n**Important:** The professionals category does not allow self-employment in Canada (i.e., soliciting business in the Canadian labour market). However, a Chilean citizen who is self-employed outside Canada is not barred from the professional category, provided the services to be rendered in Canada are pre-arranged with a Canadian employer."
    },
    {
      "heading": "Self-employment",
      "heading_path": [
        "Professionals – CCFTA [R204(a) – F22] - Agreements or arrangements - International Mobility Program",
        "Review of the offer of employment",
        "Self-employment"
      ],
      "anchor": "#self-employment",
      "text": "If the Canadian enterprise is substantially controlled by the applicant, it is considered to be self-employment. For example, if the Canadian enterprise offering the employment is a sole proprietorship operated by the applicant, then entry cannot be granted under the Professionals category. Additionally, if the Canadian enterprise is legally distinct from the applicant, for example, a legal corporate entity but the entity is substantially controlled by the applicant, entry as a Professional must be refused.\n\nIn order to determine if an enterprise is substantially controlled, the following factors must be taken into account:\n\n* whether the applicant has established the business;\n* whether the applicant has primary, sole, or de facto control of the business;\n* whether the applicant is the primary, sole, or de facto owner of the business; and/or\n* whether the applicant is the primary, sole, or de facto recipient of income of the business.\n\nWhen a professional applies for a renewal of a work permit, the following activities may indicate that the applicant has been self-employed in Canada:\n\n* incorporation of a company in Canada expressly for the purpose of the business person being self-employed (incorporating does not automatically signify self-employment; the motives for incorporation need to be examined before making a determination);\n* initiation of communications (e.g., “job hunting” by direct mail or by advertising);\n* responding to advertisements for the purpose of obtaining employment or contracts; or\n* establishing an office which serves as a way to advertise (i.e., a “sign or a shingle” outside the door).\n\nThe following activities do not constitute self-employment:\n\n* responding to unsolicited inquiries about service which the professional may be able to perform; or\n* establishing an office from which to deliver pre-arranged service to clients."
    },
    {
      "heading": "Occupational qualifications",
      "heading_path": [
        "Professionals – CCFTA [R204(a) – F22] - Agreements or arrangements - International Mobility Program",
        "Review of the offer of employment",
        "Occupational qualifications"
      ],
      "anchor": "#occupational-qualifications",
      "text": "A professional must be entering Canada to provide professional level services in a eligible occupation for which they are qualified. In making this determination, both the qualification of the individual and the position in Canada must be considered.\n\nOfficers must be satisfied that the applicant meets the qualifications indicated in the Minimum Education Requirements and Alternative Credentials of [Appendix K-03.IV.1](https://www.international.gc.ca/trade-commerce/trade-agreements-accords-commerciaux/agr-acc/chile-chili/fta-ale/03k.aspx?lang=eng#:~:text=de%20Extranjer%C3%ADa%22).-,Appendix%20K%2D03.IV.1,-Professionals) of the CCFTA, which represents only the minimum to permit entry and do not necessarily indicate the level of qualification required to actually work in that profession in Canada.\n\nFor [regulated professions](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/foreign-workers/regulated-certified-occupations.html), the officer must be satisfied that the professional has or can obtain the necessary licensing so that the applicant may [perform the work sought](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/foreign-workers/prohibitions.html#unable-perform).\n\nFor example, an accountant must be seeking to enter Canada as an accountant and not as a bookkeeper, which is not an occupation covered in [Appendix K-03.IV.1](https://www.international.gc.ca/trade-commerce/trade-agreements-accords-commerciaux/agr-acc/chile-chili/fta-ale/03k.aspx?lang=eng#:~:text=de%20Extranjer%C3%ADa%22).-,Appendix%20K%2D03.IV.1,-Professionals) of the CCFTA. Alternatively, a bookkeeper cannot be authorized to enter Canada to work as an accountant unless the applicant is also qualified as an accountant as indicated in the Minimum Education Requirements and Alternative Credentials of [Appendix K-03.IV.1](https://www.international.gc.ca/trade-commerce/trade-agreements-accords-commerciaux/agr-acc/chile-chili/fta-ale/03k.aspx?lang=eng#:~:text=de%20Extranjer%C3%ADa%22).-,Appendix%20K%2D03.IV.1,-Professionals) of the CCFTA. Additionally, to be authorized to enter Canada under the Professionals category, a corporate executive must be entering Canada to work in their field of qualification (i.e. an engineer where the details of the position requirements and job duties of a specific profession are integral to the job).\n\nIn instances where a baccalaureate degree is required, the degree must be in the specific field or in a closely related field. Baccalaureate degrees (or licenciatura) need not have been obtained in colleges or universities in Canada or Chile, whereas post secondary diplomas or certificates should have been earned in one of the two countries.\n\nIt is possible for a professional to be working in Canada on more than one contract at a time. A work permit must be issued for each individual contract."
    },
    {
      "heading": "Education requirements",
      "heading_path": [
        "Professionals – CCFTA [R204(a) – F22] - Agreements or arrangements - International Mobility Program",
        "Review of the offer of employment",
        "Education requirements"
      ],
      "anchor": "#education-requirements",
      "text": "**“University Title”** means any document conferred by universities recognized by the Government of Chile and shall be deemed to be equivalent to the Minimum Education Requirements and Alternative Credentials for that profession. In the case of the profession of Lawyer (Abogado), the title is conferred by the Supreme Court of Chile.\n\n**“State/provincial licence”** and “State/provincial/national licence” mean any document issued by a provincial or national government, as the case may be, or under its authority, but not by a local government, that permits a person to engage in a regulated activity or profession.\n\n**“Post-Secondary Diploma**” means a credential issued, on completion of two or more years of post-secondary education, by an accredited academic institution in Canada or in Chile.\n\n**“Post-Secondary Certificate”** means a certificate issued, on completion of two or more years of post-secondary education at an academic institution: in the case of Chile, by the federal government or a state government, an academic institution recognized by the federal government or a state government, or an academic institution created by federal or state law."
    },
    {
      "heading": "Training",
      "heading_path": [
        "Professionals – CCFTA [R204(a) – F22] - Agreements or arrangements - International Mobility Program",
        "Review of the offer of employment",
        "Training"
      ],
      "anchor": "#training",
      "text": "Professionals with a valid work permit can provide training related to their profession, including conducting seminars.\n\nThe training session must be pre-arranged with a Canadian employer and the subject matter must be at the professional level. Entry does not allow seminar leaders to engage in training that is not pre-arranged with a Canadian employer.\n\nThe training must form part of the professional training or development of the participants and must be related to their job duties.\n\nFinal decision\n--------------"
    },
    {
      "heading": "Approval",
      "heading_path": [
        "Professionals – CCFTA [R204(a) – F22] - Agreements or arrangements - International Mobility Program",
        "Review of the offer of employment",
        "Approval"
      ],
      "anchor": "#approval",
      "text": "The work permit will be issued under the authority of paragraph [R204(a)](https://laws-lois.justice.gc.ca/eng/regulations/SOR-2002-227/section-204.html).\n\nIn GCMS, under the Application screen, officers should enter the information below in the specified fields.\n\n| Field | Selection or input |\n| --- | --- |\n| **Case type** | 52 |\n| **Province of destination** | The province of destination entered by the applicant should match the address of employment in the IMP offer of employment. This information is under the **Employment Details – LMIA-exempt** tab. If there is more than one location, officers should enter the primary location in the “Province of destination” field and the secondary location in the “User remarks” field. |\n| **City of destination** | The city of destination entered by the applicant should match the address of employment in the IMP offer of employment. This information is under the **Employment Details – LMIA-exempt** tab. If there is more than one location, officers should enter “Unknown” in the “City of destination” field and “As per the offer” in the “User remarks” field. |\n| **Exemption code** | **F22** – CCFTA – R204(a) – Professionals This code is auto-populated from the IMP offer of employment. |\n| **NOC** | The NOC code is auto-populated from the IMP offer of employment. |\n| **Intended occupation** | Job title This is auto-populated from the IMP offer of employment. |\n| **LMIA/LMIA-exempt #** | “A” number from the work permit application. This number is auto-populated from the work permit application, and it is what is used to “match” in the Portal. If the work permit application was submitted on paper, the officer must manually enter the number. |\n| **Employer** | Business operating name |\n| **Duration** | Officers may issue a work permit that is valid for the duration of the offer of employment or until the expiry of the travel document, whichever is earlier. Refer to [Validity period for work permits](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/foreign-workers/eligibility/eligibility-admissibility-conditions-including-validity-period.html#validity). |\n\n**Note:** If the employer is authorized to use an IMM 5802 form instead of completing the offer of employment through the Employer Portal, please see [Employer-specific work permits – General processing – International Mobility Program](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/foreign-workers/eligibility/employer-specific-labout-market-impact-assessment-exemptions.html)."
    },
    {
      "heading": "Refusal",
      "heading_path": [
        "Professionals – CCFTA [R204(a) – F22] - Agreements or arrangements - International Mobility Program",
        "Review of the offer of employment",
        "Refusal"
      ],
      "anchor": "#refusal",
      "text": "If an officer is not satisfied that all the requirements of [R200](https://laws-lois.justice.gc.ca/eng/regulations/SOR-2002-227/section-200.html), including the assessment under [R204(a)](https://laws-lois.justice.gc.ca/eng/regulations/SOR-2002-227/section-204.html), are met, they must record their reasons and outline the rationale underlying the decision as well as the facts and elements considered. They must also provide an explanation for the decision in a case note.\n\nA decision is reasonable and therefore defendable when another person is able to trace the decision maker’s reasoning, without encountering fatal flaws in the overarching logic, and is satisfied that there is a line of analysis within the given reasons that could reasonably lead the tribunal from the evidence before it to the decision maker’s conclusion.\n\nThe officer needs to engage with the documentary evidence that was provided by the applicant. Simply stating ‘I have reviewed the submissions and I am not satisfied that R204 is met’ **is not sufficient** for another reasonable person to understand the logic of the decision without reviewing all of the evidence again.\n\nRefusal reasons should clearly indicate which criteria or what requirement of R200 was not met and explain how the conclusion was reached.\n\nFor assistance, officers can follow the steps in [Decision making: Standard of review and process for making a reasonable decision](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/service-delivery/decision-standard-review.html)."
    },
    {
      "heading": "Refusal grounds in the GCMS",
      "heading_path": [
        "Professionals – CCFTA [R204(a) – F22] - Agreements or arrangements - International Mobility Program",
        "Review of the offer of employment",
        "Refusal",
        "Refusal grounds in the GCMS"
      ],
      "anchor": "#refusal-grounds-in-the-gcms",
      "text": "The GCMS has standard text for refusal grounds. Officers should ensure that the refusal grounds selected for the refusal letter match the reasons that they have stated in their case note.\n\nIf an officer has reasonable grounds to believe that the applicant is not able to perform the work sought, they should select the paragraph “R200(3)(a)**You were not able to demonstrate that you will be able to adequately perform the work you seek**.” Officers should ensure that they clearly indicate in their refusal notes why they are not satisfied.\n\nGiven that there is no specific refusal ground for FTA categories in GCMS for when a officer is not satisfied that the criteria has been met, **they should select the refusal ground “Other” and add a short explanation in the Comments field that they are not satisfied that section R200 or paragraph R204(a) are met.**\n\nLength of stay\n--------------\n\nInitial work permits can be granted for durations of up to 3 years.\n\nExtensions can also be issued in increments of up to 3 years with no limit on the number of extensions providing the individual continues to comply with the requirements for professionals.\n\nOfficers must be satisfied that the employment is still “temporary” and that the foreign national is not using CCFTA entry as a means of circumventing normal immigration procedures.\n\nList of eligible professions under the CCFTA Professionals category\n-------------------------------------------------------------------"
    },
    {
      "heading": "General",
      "heading_path": [
        "Professionals – CCFTA [R204(a) – F22] - Agreements or arrangements - International Mobility Program",
        "Review of the offer of employment",
        "General"
      ],
      "anchor": "#general",
      "text": "| Profession | Minimum education requirements and alternative credentials |\n| --- | --- |\n| Accountant | Baccalaureate or Licenciatura Degree; or C.P.A., C.A., C.G.A. or C.M.A; or Contador auditor or Contador público(University Title) C.P.A.: Certified Public Accountant; C.A.: Chartered Accountant; C.G.A: Certified General Accountant; C.M.A.: Certified Management Accountant |\n| Architect | Baccalaureate or Licenciatura Degree; or state/provincial licence |\n| Computer Systems Analyst | Baccalaureate or Licenciatura Degree; or Post-Secondary Diploma or Post-Secondary Certificate, and three years experience |\n| Disaster Relief Insurance Claims Adjuster (claims adjuster employed by an insurance company located in the territory of a Party, or an independent claims adjuster) | Baccalaureate or Licenciatura Degree, and successful completion of training in the appropriate areas of insurance adjustment pertaining to disaster relief claims; or three years experience in claims adjustment and successful completion of training in the appropriate areas of insurance adjustment pertaining to disaster relief claims |\n| Economist (including Commercial Engineer in Chile) | Baccalaureate or Licenciatura Degree |\n| Engineer | Baccalaureate or Licenciatura Degree; or state/provincial licence |\n| Forester | Baccalaureate or Licenciatura Degree; or state/provincial licence |\n| Graphic Designer | Baccalaureate or Licenciatura Degree; or Post-Secondary Diploma or Post-Secondary Certificate, and three years experience |\n| Hotel Manager | Baccalaureate or Licenciatura Degree in hotel/restaurant management; or Post-Secondary Diploma or Post-Secondary Certificate in hotel/restaurant management, and three years experience in hotel/restaurant management |\n| Industrial Designer | Baccalaureate or Licenciatura Degree; or Post-Secondary Diploma or Post-Secondary Certificate, and three years experience |\n| Interior Designer | Baccalaureate or Licenciatura Degree; or Post-Secondary Diploma or Post-Secondary Certificate, and three years experience |\n| Land Surveyor | Baccalaureate or Licenciatura Degree; or state/provincial/ national licence |\n| Landscape Architect | Baccalaureate or Licenciatura Degree |\n| Lawyer (including Notary in the Province of Quebec) | LL.B., J.D., LL.L., B.C.L. or Licenciatura Degree (five years) or Abogado, or membership in a state/provincial bar LL.B.: Bachelor of Laws; J.D.: Doctor of Jurisprudence (not a doctorate); LL.L:Licence en Droit(Québec universities and University of Ottawa; B.C.L.: Bachelor of Civil Law |\n| Librarian | M.L.S. or B.L.S. or Magister en Bibliotecología(for which another Baccalaureate or Licenciatura Degree was a prerequisite) M.L.S.: Master of Library Science; B.L.S.: Bachelor of Library Science |\n| Management Consultant | Baccalaureate or Licenciatura Degree; or equivalent professional experience as established by statement or professional credential attesting to five years experience as a management consultant, or five years experience in a field of speciality related to the consulting agreement |\n| Mathematician (including Statistician) | Baccalaureate or Licenciatura Degree |\n| Range Manager/Range Conservationalist | Baccalaureate or Licenciatura Degree |\n| Research Assistant (working in a post-secondary educational institution) | Baccalaureate or Licenciatura Degree |\n| Scientific Technician/ Technologist | Possession of (a) theoretical knowledge of any of the following disciplines: agricultural sciences, astronomy, biology, chemistry, engineering, forestry, geology, geophysics, meteorology or physics; and (b) the ability to solve practical problems in any of those disciplines, or the ability to apply principles of any of those disciplines to basic or applied research |\n| Social Worker | Baccalaureate or Licenciatura Degree or Asistente Social/ Trabajador social(University Title) |\n| Sylviculturist (including Forestry Specialist) | Baccalaureate or Licenciatura Degree |\n| Technical Publications Writer | Baccalaureate or Licenciatura Degree; or Post-Secondary Diploma or Post-Secondary Certificate, and three years experience |\n| Urban Planner (including Geographer) | Baccalaureate or Licenciatura Degree |\n| Vocational Counsellor | Baccalaureate or Licenciatura Degree |"
    },
    {
      "heading": "Medical/Allied Professionals",
      "heading_path": [
        "Professionals – CCFTA [R204(a) – F22] - Agreements or arrangements - International Mobility Program",
        "Review of the offer of employment",
        "Medical/Allied Professionals"
      ],
      "anchor": "#medical-allied-professionals",
      "text": "| Profession | Minimum education requirements and alternative credentials |\n| --- | --- |\n| Dentist | D.D.S., D.M.D.,Doctor en Odontologia or Doctor en Cirugia Dental or Licenciatura en Odontologia; or state/provincial licence Doctor of Dental Surgery; D.M.D.: Doctor of Dental Medicine |\n| Dietitian | Baccalaureate or Licenciatura Degree or Dietista Nutricional(University Title); or state/provincial licence |\n| Medical Laboratory Technologist (Canada)/ Medical Technologist (Chile, Mexico and the United States of America) | Baccalaureate or Licenciatura Degree; or Post-Secondary Diploma or Post-Secondary Certificate, and three years experience |\n| Nutritionist | Baccalaureate or Licenciatura Degree or Nutricionista/Dietista Nutricional(University Title) |\n| Occupational Therapist | Baccalaureate or Licenciatura Degree or Terapeuta Ocupacional(University Title); or state/provincial licence |\n| Pharmacist | Baccalaureate or Licenciatura Degree; or state/provincial licence |\n| Physician (teaching or research only) | M.D. Medical Doctor or Doctor en Medicina or Médico Cirujano/Médico(University Title); or state/provincial licence |\n| Physiotherapist/Physical Therapist | Baccalaureate or Licenciatura Degree or Kinesiólogo/ Kinesioterapeuta(University Title) ; or state/provincial licence |\n| Psychologist | State/provincial licence; or Licenciatura Degree |\n| Recreational Therapist | Baccalaureate or Licenciatura Degree |\n| Registered Nurse | State/provincial licence, or Licenciatura Degree, or Enfermera(University Title) |\n| Veterinarian | D.V.M., Doctor of Veterinary Medicine or Doctor en Veterinaria or Médico Vet erinario(University Title); or state/provincial licence |"
    },
    {
      "heading": "Scientists",
      "heading_path": [
        "Professionals – CCFTA [R204(a) – F22] - Agreements or arrangements - International Mobility Program",
        "Review of the offer of employment",
        "Scientists"
      ],
      "anchor": "#scientists",
      "text": "| Profession | Minimum education requirements and alternative credentials |\n| --- | --- |\n| Agriculturist (including Agronomist) | Baccalaureate or Licenciatura Degree |\n| Animal Breeder | Baccalaureate or Licenciatura Degree |\n| Animal Scientist | Baccalaureate or Licenciatura Degree |\n| Apiculturist | Baccalaureate or Licenciatura Degree |\n| Astronomer | Baccalaureate or Licenciatura Degree |\n| Biochemist | Baccalaureate or Licenciatura Degree |\n| Biologist | Baccalaureate or Licenciatura Degree |\n| Chemist | Baccalaureate or Licenciatura Degree |\n| Dairy Scientist | Baccalaureate or Licenciatura Degree |\n| Entomologist | Baccalaureate or Licenciatura Degree |\n| Epidemiologist | Baccalaureate or Licenciatura Degree |\n| Geneticist | Baccalaureate or Licenciatura Degree |\n| Geologist | Baccalaureate or Licenciatura Degree or Geólogo(University Title) |\n| Geochemist | Baccalaureate or Licenciatura Degree |\n| Geophysicist (including Oceanographer in Mexico and the United States of America) | Baccalaureate or Licenciatura Degree |\n| Horticulturist | Baccalaureate or Licenciatura Degree |\n| Meteorologist | Baccalaureate or Licenciatura Degree |\n| Pharmacologist | Baccalaureate or Licenciatura Degree |\n| Physicist (including Oceanographer in Canada and Chile) | Baccalaureate or Licenciatura Degree for Physicist;Oceanógrafo(University Title) for Oceanographer |\n| Plant Breeder | Baccalaureate or Licenciatura Degree |\n| Poultry Scientist | Baccalaureate or Licenciatura Degree |\n| Soil Scientist | Baccalaureate or Licenciatura Degree |\n| Zoologist | Baccalaureate or Licenciatura Degree |"
    },
    {
      "heading": "Teachers",
      "heading_path": [
        "Professionals – CCFTA [R204(a) – F22] - Agreements or arrangements - International Mobility Program",
        "Review of the offer of employment",
        "Teachers"
      ],
      "anchor": "#teachers",
      "text": "| Profession | Minimum education requirements and alternative credentials (in a related field or profession) |\n| --- | --- |\n| College | Baccalaureate or Licenciatura Degree |\n| Seminary | Baccalaureate or Licenciatura Degree |\n| University | Baccalaureate or Licenciatura Degree |\n\nPage details\n------------\n\n 2025-01-20"
    }
  ],
  "links": {
    "outbound": [
      "https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/foreign-workers/eligibility/employer-specific-labout-market-impact-assessment-exemptions.html",
      "https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/foreign-workers/genuineness.html",
      "https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/foreign-workers/eligibility/eligibility-admissibility-conditions-including-validity-period.html",
      "https://www.canada.ca/en/immigration-refugees-citizenship/services/work-canada/employers-non-compliant.html",
      "https://www.international.gc.ca/trade-commerce/trade-agreements-accords-commerciaux/agr-acc/chile-chili/index.aspx?lang=eng",
      "https://laws-lois.justice.gc.ca/eng/regulations/SOR-2002-227/section-204.html",
      "https://www.international.gc.ca/trade-commerce/trade-agreements-accords-commerciaux/agr-acc/chile-chili/fta-ale/03k.aspx?lang=eng",
      "https://laws-lois.justice.gc.ca/eng/regulations/SOR-2002-227/section-186.html",
      "https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/foreign-workers/international-free-trade-agreements/canada-chile/professionals.html",
      "https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/visitors/place-application-visa-electronic-travel-authorization-study-permit-work-permit/exempt-electronic-applications.html",
      "https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/foreign-workers/persons-who-may-apply-port-entry.html",
      "http://laws-lois.justice.gc.ca/eng/regulations/sor-2002-227/section-199.html",
      "https://noc.esdc.gc.ca/",
      "https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/terms-definitions.html",
      "https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/foreign-workers/regulated-certified-occupations.html",
      "https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/foreign-workers/prohibitions.html",
      "https://laws-lois.justice.gc.ca/eng/regulations/SOR-2002-227/section-200.html",
      "https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/service-delivery/decision-standard-review.html"
    ],
    "internal_children": []
  },
  "quality": {
    "is_toc_like": false,
    "is_low_text": false,
    "notes": []
  }
}