{
  "source_id": "pdi_abdc555993bd",
  "source_type": "guidance_pdi",
  "source_url": "https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/foreign-workers/sawp.html",
  "canonical_url": "https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/foreign-workers/sawp.html",
  "title": "Seasonal Agricultural Worker Program (SAWP) – Temporary Foreign Worker Program (TFWP)",
  "language": "en",
  "manual": "Seasonal Agricultural Worker Program (SAWP) – Temporary Foreign Worker Program (TFWP)",
  "chapter": null,
  "heading_path": [
    "Seasonal Agricultural Worker Program (SAWP) – Temporary Foreign Worker Program (TFWP)"
  ],
  "last_updated": "2025-11-28",
  "crawl_ts": "2026-02-12T00:00:00Z",
  "http": {
    "status_code": 200,
    "content_type": "text/markdown"
  },
  "content_hash": "28256e79ce9454cac6ae1d36ebed1cdca4681cbebe80f655a27c1382a253b005",
  "raw_html_path": null,
  "markdown_path": "scripts/scraper/ircc_data_clean/sawp-abdc555993.md",
  "text": "Published Time: Thu, 12 Feb 2026 00:37:07 GMT\n\nSeasonal Agricultural Worker Program (SAWP) – Temporary Foreign Worker Program (TFWP)\n=====================================================================================\n\nThis section contains policy, procedures and guidance used by IRCC staff. It is posted on the department’s website as a courtesy to stakeholders.\n\nIn these instructions “officers” refers to both employees of Immigration, Refugees and Citizenship Canada (IRCC) and of the Canada Border Services Agency (CBSA).\n\nThe Seasonal Agricultural Worker Program (SAWP) was created through bilateral agreements between Canada and the participating countries. The program falls under subparagraph 200(1)(c)(iii) of the Immigration and Refugee Protection Regulations (IRPR), as a labour market impact assessment (LMIA) is required.\n\nUnder this program, employers can hire temporary foreign workers from participating countries for an accumulated maximum period of 8 months, between January 1 and December 15, provided they are able to offer the workers a minimum of 240 hours of work within a period of 6 weeks or less.\n\nThese instructions should be reviewed in conjunction with the following:\n\n* [Labour market impact assessments](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/foreign-workers/exemption-codes/overview.html)\n* [Labour market impact assessment review](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/foreign-workers/exemption-codes/validity-suspension-duration-employment.html)\n\nOn this page\n------------\n\n* [Eligibility requirements](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/foreign-workers/sawp.html#eligibility)\n* [Documentary evidence](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/foreign-workers/sawp.html#evidence)\n* [Application assessment](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/foreign-workers/sawp.html#assessment)\n * [Labour market impact assessment (LMIA)](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/foreign-workers/sawp.html#lmia)\n * [Place of application](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/foreign-workers/sawp.html#place)\n * [Role of participating foreign governments](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/foreign-workers/sawp.html#role)\n * [Seasonal Agricultural Worker Program (SAWP) contract](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/foreign-workers/sawp.html#swap)\n * [Transfer of seasonal agricultural workers](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/foreign-workers/sawp.html#transfer)\n\n* [Decision](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/foreign-workers/sawp.html#decision)\n * [Port of entry](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/foreign-workers/sawp.html#poe)\n * [Approval: Work permit issuance in the Global Case Management System (GCMS)](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/foreign-workers/sawp.html#approval)\n\n* [Refusal](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/foreign-workers/sawp.html#refusal)\n* [Links](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/foreign-workers/sawp.html#links)\n\nEligibility requirements\n------------------------\n\nTo be eligible for a work permit issued in the SAWP, the foreign national must meet the following requirements:\n\n* be a citizen of a [country](https://www.canada.ca/en/employment-social-development/services/foreign-workers/agricultural/seasonal-agricultural.html) with a SAWP agreement, which include \n * Mexico\n * Caribbean countries, including \n * Anguilla\n * Antigua and Barbuda\n * Barbados\n * Dominica\n * Grenada\n * Jamaica\n * Montserrat\n * St. Kitts and Nevis\n * St. Lucia\n * St. Vincent and the Grenadines\n * Trinidad and Tobago\n\n* have an initial employer with a positive SAWP stream LMIA that meets the following eligibility criteria: \n * Have their work permit application submitted on their behalf by their government organization. As per the agreements, the foreign government must select the SAWP participants.\n * Be able to perform the work sought. For example, they must be physically able to work in harsh conditions and conduct repetitive labour.\n * Are not submitting their application at a port of entry.\n\nDocumentary evidence\n--------------------\n\nWhile the foreign government submits the applications on behalf of the worker, the onus is on the applicant to demonstrate that they meet the eligibility requirements and will be able to perform the work being sought, as stated in the LMIA.\n\nThe application should include:\n\n* [full payment](https://ircc.canada.ca/english/information/fees/index.asp)\n * Applications that do not include full payment should be rejected and returned.\n\n* a copy of the valid LMIA\n* a copy of their job offer, contract or letter from the applicable foreign ministry of labour\n\n**Migration offices may also have certain requirements for workers based on local conditions and considerations. These are listed in the migration office-specific document checklists.** The onus is on the applicant and/or the foreign government applying on their behalf to ensure that any other applicable requirements are met.\n\nApplication assessment\n----------------------\n\nOfficers must be satisfied that all eligibility and admissibility requirements are met at the time of decision on a work permit application.\n\nWhen assessing applications for SAWP, officers must determine whether the applicant can perform the work sought in Canada.\n\nWhen assessing whether the applicant meets the requirements of the occupation they are applying for, officers should review the LMIA, the offer of employment, or the letter from the foreign government.\n\n### Labour market impact assessment (LMIA)\n\nUnder the Employment Details tab, GCMS will also display all relevant [LMIA information](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/foreign-workers/exemption-codes/validity-suspension-duration-employment.html) related to\n\n* LMIA stream\n* LMIA validity period: Applications for work permits must be submitted prior to this date.\n* Employer information: Legal business name and business address of the employer\n* National Occupational Classification (NOC) code and title: This is determined by Employment and Social Development Canada (ESDC) based on the information in the LMIA application. It includes the NOC code and the title as stated in the NOC.\n* Job title: The title of the position, as stated by the employer\n* Number of positions: Total number of people the LMIA covers, and the total number of work permits to be issued based on the specific LMIA\n* Education requirements\n* Language requirements\n* Duration of employment: This is the length of time specified corresponds to the length of the work permit.\n* Location of employment: The physical address of the employment\n* Hours of work per day or per week\n* Requirements\n* ESDC comments: This is the field that ESDC uses to provide notes or comments directed to IRCC. Officers processing work permit applications should review any text in this field for updates.\n\nESDC assesses whether the employment of a foreign national will have a positive or neutral effect on the labour market in Canada.\n\nOnce a SAWP stream LMIA has been approved by ESDC, the foreign government submits a work permit application on behalf of a foreign national. IRCC officers will then assess the documents provided as well as the eligibility and admissibility of the foreign national.\n\nFor LMIA-required categories, the foreign workers’ names must be listed in the LMIA at the time of submission of their application. However, under the SAWP, the processing officer may not see the names listed on the LMIA because for the SAWP, the name matching is done at a later stage. The names of the workers are not required upon the submission of a SAWP work permit application. However, the LMIA provides specific details about the job offer, such as the wages, working conditions and occupations, as well as a system file number.\n\nOnce the positive LMIA letter is received, it is the employer’s responsibility to send a copy of this letter and the employment contract, signed by the employer, to the foreign governments’ ministry of labour.\n\nThe matching between LMIA spots or positions available against the number of workers is done at a later stage. This matching is done based on the number of LMIA positions and applications submitted, once the eligibility has been passed and the application is ready for approval.\n\nIf the province of destination is Quebec, the workers must first obtain the consent of Quebec’s Ministère de l’Immigration, de la Francisation et de l’Intégration (MIFI) to enter Quebec and accept temporary employment in that province. This consent is granted through the issuance of a Quebec Acceptance Certificate (Certificat d’acceptation du Québec [CAQ]). MIFI provides generic CAQs numbers for SAWP for each participant country every year; however, it is possible that some applicants may provide their own. The precedence is given to the generic CAQ provided by MIFI.\n\nIn addition to the LMIA confirmation letter provided to the employer, the LMIA information is entered into the ESDC LMIA/GCMS interface system.\n\n**To see the most up-to-date information related to that LMIA, processing officers must refresh the LMIA GCMS screen each time the LMIA information is reviewed, paying particular attention to the ESDC Comments section.**\n\n### Place of application\n\nGiven that it is the foreign government organization that submits the work permit application on behalf of the foreign national, the application is submitted outside of Canada. Under subsection R198(2), foreign nationals cannot apply at the port of entry if they are applying for the SAWP.\n\n### Role of participating foreign governments\n\nThe SAWP operates according to bilateral agreements between Canada and the participating countries. The agreements outline the [role of these foreign governments](https://www.canada.ca/en/employment-social-development/services/foreign-workers/agricultural/seasonal-agricultural.html) which is to\n\n* ethically recruit and select the temporary foreign worker\n* make sure workers have the necessary documents\n* maintain a pool of qualified workers\n* appoint representatives to assist workers in Canada\n\nIf the applicant arrives at the port of entry, and the border services officer notices something of concern, the officer should assess the applicant and follow the regular instructions in place for this scenario.\n\nWhen the employer advises the foreign government of an approved SAWP LMIA, the foreign government will select the workers to fill the number of positions on the LMIA. The foreign government then provides the foreign workers’ names and ensures that those selected to work temporarily in Canada meet all the requirements of the SAWP. These requirements include being\n\n* physically able to perform the work\n* at least 18 years of age\n* a citizen of one of the participating countries\n* able to satisfy the Canadian immigration laws and the laws of the worker’s home country.\n\n### Seasonal Agricultural Worker Program (SAWP) contract\n\nThe SAWP has a standard, non-modifiable contract. This contract is negotiated yearly between Canada and the participating countries.\n\nThe contract may not always be included with the work permit application. Employers must provide a copy of the employment contract to temporary foreign workers upon arrival to Canada. The temporary foreign workers must sign the copy of this contract on or before their first day of work. Employers are required to have a copy of the contract signed by both the employer and the worker on file in case of an inspection.\n\nThe purpose of the employment contract is to specify each party’s rights and obligations. It also ensures that all parties understand and agree to the working conditions and their respective responsibilities. In the event that differences arise between the employer and the temporary foreign worker, the contract will guide the resolution of disputes. The parties may contact the[Ministry of Labour](https://www.canada.ca/en/services/jobs/workplace/federally-regulated-industries.html#provlist)\n\n* in the event of demonstrable breaches of the employment contract,and\n* where no resolution, including possible compensation, has been made\n\nFor more information, consult[Employment contract in Canada for the SAWP](https://www.canada.ca/en/employment-social-development/services/foreign-workers/agricultural/seasonal-agricultural/requirements.html#:~:text=Employment%2520contract%2520in%2520Canada%2520for%2520the%2520SAWP).\n\n### Transfer of seasonal agricultural workers\n\nThe transfer provision is included in the employment agreements for workers from\n\n* Mexico\n* participating Caribbean countries\n\nIRCC has agreed that employers can transfer a worker from one farm to another without the need to obtain a new work permit, provided the employer has\n\n* the worker’s consent\n* prior written approval from the foreign government representative in Canada\n* prior written approval from ESDC or Service Canada.\n\n**Important:** Employers cannot informally transfer or share temporary foreign workers from one employer to another. These actions contravene [sections 124(1)(c) and 125 of the Immigration and Refugee Protection Act (IRPA)](https://laws.justice.gc.ca/eng/acts/i-2.5/page-15.html#h-275952).\n\nDecision\n--------\n\n### Port of entry\n\nOfficers should be aware that under subsection R198(2), foreign nationals cannot apply at the port of entry if they are applying for the SAWP. For more information on who can apply for a work permit at a port of entry, consult [Temporary Foreign Worker Program (TFWP) and International Mobility Program (IMP): Persons who may apply at a port of entry](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/foreign-workers/persons-who-may-apply-port-entry.html).\n\nA border services officer must not accept and approve a SAWP work permit application that is being made at the port of entry. If one is received, please refer the applicant to IRCC.\n\nApplicants to the SAWP are expected to present letters of introduction at the port of entry, indicating that they have already made an application to IRCC and have been provisionally approved.\n\nThe border services officer should review the Notes tab in GCMS in the work permit for any specific IRCC instructions.\n\nIf a border services officer is satisfied that the foreign national is admissible and will comply with the imposed temporary resident general conditions, including, “Unless authorized, prohibited from engaging in employment in Canada”, the border services officer can authorize the foreign national into Canada as a temporary resident.\n\nFor all officer options on entry, refer to [ENF 4 POE Processing Manual (PDF, 1.82 MB)](https://www.canada.ca/content/dam/ircc/migration/ircc/english/resources/manuals/enf/enf04-eng.pdf).\n\n**Important:** The validity date of a **SAWP work permit** should always be until December 15 unless the passport or biometrics expire before that date. If that is the case, a note should be entered explaining the reason for the limited validity.\n\n### Approval\n\n#### Work permit issuance in the Global Case Management System (GCMS)\n\nInformation in the system and on the approved work permit must match the information found in the **Employment Details tab – LMIA view** in GCMS. Officers must always refresh the screen to view the latest LMIA information before approving an application.\n\nOfficers approving work permits must ensure that correctly coded multiple-entry visas should be issued valid for the same period as the work permit or passport, whichever expires first.\n\n| Field | Selection or input |\n| --- | --- |\n| Case type | 98 |\n| Special program | SAWP |\n| Province of destination | The province of destination is uploaded automatically from the work permit application form. **Officers should ensure that it matches the location of employment in the LMIA view.** |\n| City of destination | The city of destination is uploaded automatically from the work permit application form. **Officers should ensure that it matches the location of employment in the LMIA view.** |\n| NOC | Manually enter the NOC from the**Employment Details – LMIA**tab. |\n| Intended occupation | The job title is uploaded automatically from the work permit application form. **Officers should ensure that it matches the job title in the Employment Details – LMIA tab.** |\n| LMIA number | The LMIA number is uploaded from the application form, or manually entered based on the LMIA approval letter provided by the applicant. |\n| If destination is Quebec | The CAQ “Valid to date” also needs to be populated. It cannot be left blank. For SAWP, the CAQ validity date is set by default to December 15 of each year. |\n| Employer | Approved MEX/CCSAWP employer – **Please ensure that the name of the employer on the work permit remains blank.** (The name of the employer should not be on the work permit). |\n| Duration | SAWP work permits should be issued to December 15 of the agricultural season for which they are applying (not to exceed a maximum duration of employment of 8 months). **If a date other than December 15 is provided, a GCMS note is mandatory.** **The note in GCMS should state, “PPT expires YYYY/MM/DD”. Client will need to extend passport in Canada and show proof if they wish to have a full validity employment period as per work permit User Remarks.** |\n| User remarks (mandatory) | Approved MEX/CCSAWP employer only. Valid to work in all Provinces. Period of cumulative work not to exceed employment duration specified in the LMIA to a maximum of 8 months [R185(b)(iv)]. |\n\n**Note:** Applicants named in LMIAs that are approved in other regular agricultural streams can apply at a port of entry [if they meet all other relevant criteria](https://www.canada.ca/en/immigration-refugees-citizenship/services/work-canada/work-permit/eligibility.html).\n\nRefusal\n-------\n\nOnce an officer has assessed that a foreign national meets the eligibility requirements for a work permit (for example, the applicant has submitted the fees and has a valid passport) they must determine whether there are any [prohibitions](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/foreign-workers/prohibitions.html) on the issuance of the permit.\n\nSubsection R200(3) specifies the situations in which an officer must not issue a work permit.\n\nIf the officer believes for any reason that the foreign national will not be able to perform their duties, they must not issue the work permit based on reasonable grounds [R200(3)(a)].\n\nThe officer must determine whether the foreign national meets the job requirements and whether there are any other factors that may prevent the foreign national from being able to perform the duties of the position.\n\nAn officer requires reasonable grounds to believe that the foreign national will be unable to perform the duties of the job.\n\nIf a SAWP applicant is refused, the foreign government will be notified and they will substitute the applicant in question for a new one out of their pool of pre-screened applicants.\n\nLinks\n-----\n\n* [Agricultural workers – Work temporarily in Canada](https://www.canada.ca/en/immigration-refugees-citizenship/services/work-canada/special-instructions/agricultural.html)\n* [Employers who have been found non-compliant](https://www.canada.ca/en/immigration-refugees-citizenship/services/work-canada/employers-non-compliant.html)\n* [Quebec cases – TFWP and IMP](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/foreign-workers/quebec-cases.html)\n* [Public list of employers who have been non-compliant](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/foreign-workers/eligibility/public-list-employers-who-have-been-non-compliant.html)\n* [Temporary residents – Refusals overview](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/visitors/refusals-overview.html)\n\nPage details\n------------\n\n 2025-11-28",
  "sections": [
    {
      "heading": "Seasonal Agricultural Worker Program (SAWP) – Temporary Foreign Worker Program (TFWP)",
      "heading_path": [
        "Seasonal Agricultural Worker Program (SAWP) – Temporary Foreign Worker Program (TFWP)"
      ],
      "anchor": "#seasonal-agricultural-worker-program-sawp-temporary-foreign-worker-program-tfwp",
      "text": "Published Time: Thu, 12 Feb 2026 00:37:07 GMT\n\nSeasonal Agricultural Worker Program (SAWP) – Temporary Foreign Worker Program (TFWP)\n=====================================================================================\n\nThis section contains policy, procedures and guidance used by IRCC staff. It is posted on the department’s website as a courtesy to stakeholders.\n\nIn these instructions “officers” refers to both employees of Immigration, Refugees and Citizenship Canada (IRCC) and of the Canada Border Services Agency (CBSA).\n\nThe Seasonal Agricultural Worker Program (SAWP) was created through bilateral agreements between Canada and the participating countries. The program falls under subparagraph 200(1)(c)(iii) of the Immigration and Refugee Protection Regulations (IRPR), as a labour market impact assessment (LMIA) is required.\n\nUnder this program, employers can hire temporary foreign workers from participating countries for an accumulated maximum period of 8 months, between January 1 and December 15, provided they are able to offer the workers a minimum of 240 hours of work within a period of 6 weeks or less.\n\nThese instructions should be reviewed in conjunction with the following:\n\n* [Labour market impact assessments](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/foreign-workers/exemption-codes/overview.html)\n* [Labour market impact assessment review](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/foreign-workers/exemption-codes/validity-suspension-duration-employment.html)\n\nOn this page\n------------\n\n* [Eligibility requirements](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/foreign-workers/sawp.html#eligibility)\n* [Documentary evidence](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/foreign-workers/sawp.html#evidence)\n* [Application assessment](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/foreign-workers/sawp.html#assessment)\n * [Labour market impact assessment (LMIA)](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/foreign-workers/sawp.html#lmia)\n * [Place of application](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/foreign-workers/sawp.html#place)\n * [Role of participating foreign governments](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/foreign-workers/sawp.html#role)\n * [Seasonal Agricultural Worker Program (SAWP) contract](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/foreign-workers/sawp.html#swap)\n * [Transfer of seasonal agricultural workers](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/foreign-workers/sawp.html#transfer)\n\n* [Decision](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/foreign-workers/sawp.html#decision)\n * [Port of entry](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/foreign-workers/sawp.html#poe)\n * [Approval: Work permit issuance in the Global Case Management System (GCMS)](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/foreign-workers/sawp.html#approval)\n\n* [Refusal](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/foreign-workers/sawp.html#refusal)\n* [Links](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/foreign-workers/sawp.html#links)\n\nEligibility requirements\n------------------------\n\nTo be eligible for a work permit issued in the SAWP, the foreign national must meet the following requirements:\n\n* be a citizen of a [country](https://www.canada.ca/en/employment-social-development/services/foreign-workers/agricultural/seasonal-agricultural.html) with a SAWP agreement, which include \n * Mexico\n * Caribbean countries, including \n * Anguilla\n * Antigua and Barbuda\n * Barbados\n * Dominica\n * Grenada\n * Jamaica\n * Montserrat\n * St. Kitts and Nevis\n * St. Lucia\n * St. Vincent and the Grenadines\n * Trinidad and Tobago\n\n* have an initial employer with a positive SAWP stream LMIA that meets the following eligibility criteria: \n * Have their work permit application submitted on their behalf by their government organization. As per the agreements, the foreign government must select the SAWP participants.\n * Be able to perform the work sought. For example, they must be physically able to work in harsh conditions and conduct repetitive labour.\n * Are not submitting their application at a port of entry.\n\nDocumentary evidence\n--------------------\n\nWhile the foreign government submits the applications on behalf of the worker, the onus is on the applicant to demonstrate that they meet the eligibility requirements and will be able to perform the work being sought, as stated in the LMIA.\n\nThe application should include:\n\n* [full payment](https://ircc.canada.ca/english/information/fees/index.asp)\n * Applications that do not include full payment should be rejected and returned.\n\n* a copy of the valid LMIA\n* a copy of their job offer, contract or letter from the applicable foreign ministry of labour\n\n**Migration offices may also have certain requirements for workers based on local conditions and considerations. These are listed in the migration office-specific document checklists.** The onus is on the applicant and/or the foreign government applying on their behalf to ensure that any other applicable requirements are met.\n\nApplication assessment\n----------------------\n\nOfficers must be satisfied that all eligibility and admissibility requirements are met at the time of decision on a work permit application.\n\nWhen assessing applications for SAWP, officers must determine whether the applicant can perform the work sought in Canada.\n\nWhen assessing whether the applicant meets the requirements of the occupation they are applying for, officers should review the LMIA, the offer of employment, or the letter from the foreign government."
    },
    {
      "heading": "Labour market impact assessment (LMIA)",
      "heading_path": [
        "Seasonal Agricultural Worker Program (SAWP) – Temporary Foreign Worker Program (TFWP)",
        "Labour market impact assessment (LMIA)"
      ],
      "anchor": "#labour-market-impact-assessment-lmia",
      "text": "Under the Employment Details tab, GCMS will also display all relevant [LMIA information](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/foreign-workers/exemption-codes/validity-suspension-duration-employment.html) related to\n\n* LMIA stream\n* LMIA validity period: Applications for work permits must be submitted prior to this date.\n* Employer information: Legal business name and business address of the employer\n* National Occupational Classification (NOC) code and title: This is determined by Employment and Social Development Canada (ESDC) based on the information in the LMIA application. It includes the NOC code and the title as stated in the NOC.\n* Job title: The title of the position, as stated by the employer\n* Number of positions: Total number of people the LMIA covers, and the total number of work permits to be issued based on the specific LMIA\n* Education requirements\n* Language requirements\n* Duration of employment: This is the length of time specified corresponds to the length of the work permit.\n* Location of employment: The physical address of the employment\n* Hours of work per day or per week\n* Requirements\n* ESDC comments: This is the field that ESDC uses to provide notes or comments directed to IRCC. Officers processing work permit applications should review any text in this field for updates.\n\nESDC assesses whether the employment of a foreign national will have a positive or neutral effect on the labour market in Canada.\n\nOnce a SAWP stream LMIA has been approved by ESDC, the foreign government submits a work permit application on behalf of a foreign national. IRCC officers will then assess the documents provided as well as the eligibility and admissibility of the foreign national.\n\nFor LMIA-required categories, the foreign workers’ names must be listed in the LMIA at the time of submission of their application. However, under the SAWP, the processing officer may not see the names listed on the LMIA because for the SAWP, the name matching is done at a later stage. The names of the workers are not required upon the submission of a SAWP work permit application. However, the LMIA provides specific details about the job offer, such as the wages, working conditions and occupations, as well as a system file number.\n\nOnce the positive LMIA letter is received, it is the employer’s responsibility to send a copy of this letter and the employment contract, signed by the employer, to the foreign governments’ ministry of labour.\n\nThe matching between LMIA spots or positions available against the number of workers is done at a later stage. This matching is done based on the number of LMIA positions and applications submitted, once the eligibility has been passed and the application is ready for approval.\n\nIf the province of destination is Quebec, the workers must first obtain the consent of Quebec’s Ministère de l’Immigration, de la Francisation et de l’Intégration (MIFI) to enter Quebec and accept temporary employment in that province. This consent is granted through the issuance of a Quebec Acceptance Certificate (Certificat d’acceptation du Québec [CAQ]). MIFI provides generic CAQs numbers for SAWP for each participant country every year; however, it is possible that some applicants may provide their own. The precedence is given to the generic CAQ provided by MIFI.\n\nIn addition to the LMIA confirmation letter provided to the employer, the LMIA information is entered into the ESDC LMIA/GCMS interface system.\n\n**To see the most up-to-date information related to that LMIA, processing officers must refresh the LMIA GCMS screen each time the LMIA information is reviewed, paying particular attention to the ESDC Comments section.**"
    },
    {
      "heading": "Place of application",
      "heading_path": [
        "Seasonal Agricultural Worker Program (SAWP) – Temporary Foreign Worker Program (TFWP)",
        "Labour market impact assessment (LMIA)",
        "Place of application"
      ],
      "anchor": "#place-of-application",
      "text": "Given that it is the foreign government organization that submits the work permit application on behalf of the foreign national, the application is submitted outside of Canada. Under subsection R198(2), foreign nationals cannot apply at the port of entry if they are applying for the SAWP."
    },
    {
      "heading": "Role of participating foreign governments",
      "heading_path": [
        "Seasonal Agricultural Worker Program (SAWP) – Temporary Foreign Worker Program (TFWP)",
        "Labour market impact assessment (LMIA)",
        "Role of participating foreign governments"
      ],
      "anchor": "#role-of-participating-foreign-governments",
      "text": "The SAWP operates according to bilateral agreements between Canada and the participating countries. The agreements outline the [role of these foreign governments](https://www.canada.ca/en/employment-social-development/services/foreign-workers/agricultural/seasonal-agricultural.html) which is to\n\n* ethically recruit and select the temporary foreign worker\n* make sure workers have the necessary documents\n* maintain a pool of qualified workers\n* appoint representatives to assist workers in Canada\n\nIf the applicant arrives at the port of entry, and the border services officer notices something of concern, the officer should assess the applicant and follow the regular instructions in place for this scenario.\n\nWhen the employer advises the foreign government of an approved SAWP LMIA, the foreign government will select the workers to fill the number of positions on the LMIA. The foreign government then provides the foreign workers’ names and ensures that those selected to work temporarily in Canada meet all the requirements of the SAWP. These requirements include being\n\n* physically able to perform the work\n* at least 18 years of age\n* a citizen of one of the participating countries\n* able to satisfy the Canadian immigration laws and the laws of the worker’s home country."
    },
    {
      "heading": "Seasonal Agricultural Worker Program (SAWP) contract",
      "heading_path": [
        "Seasonal Agricultural Worker Program (SAWP) – Temporary Foreign Worker Program (TFWP)",
        "Labour market impact assessment (LMIA)",
        "Seasonal Agricultural Worker Program (SAWP) contract"
      ],
      "anchor": "#seasonal-agricultural-worker-program-sawp-contract",
      "text": "The SAWP has a standard, non-modifiable contract. This contract is negotiated yearly between Canada and the participating countries.\n\nThe contract may not always be included with the work permit application. Employers must provide a copy of the employment contract to temporary foreign workers upon arrival to Canada. The temporary foreign workers must sign the copy of this contract on or before their first day of work. Employers are required to have a copy of the contract signed by both the employer and the worker on file in case of an inspection.\n\nThe purpose of the employment contract is to specify each party’s rights and obligations. It also ensures that all parties understand and agree to the working conditions and their respective responsibilities. In the event that differences arise between the employer and the temporary foreign worker, the contract will guide the resolution of disputes. The parties may contact the[Ministry of Labour](https://www.canada.ca/en/services/jobs/workplace/federally-regulated-industries.html#provlist)\n\n* in the event of demonstrable breaches of the employment contract,and\n* where no resolution, including possible compensation, has been made\n\nFor more information, consult[Employment contract in Canada for the SAWP](https://www.canada.ca/en/employment-social-development/services/foreign-workers/agricultural/seasonal-agricultural/requirements.html#:~:text=Employment%2520contract%2520in%2520Canada%2520for%2520the%2520SAWP)."
    },
    {
      "heading": "Transfer of seasonal agricultural workers",
      "heading_path": [
        "Seasonal Agricultural Worker Program (SAWP) – Temporary Foreign Worker Program (TFWP)",
        "Labour market impact assessment (LMIA)",
        "Transfer of seasonal agricultural workers"
      ],
      "anchor": "#transfer-of-seasonal-agricultural-workers",
      "text": "The transfer provision is included in the employment agreements for workers from\n\n* Mexico\n* participating Caribbean countries\n\nIRCC has agreed that employers can transfer a worker from one farm to another without the need to obtain a new work permit, provided the employer has\n\n* the worker’s consent\n* prior written approval from the foreign government representative in Canada\n* prior written approval from ESDC or Service Canada.\n\n**Important:** Employers cannot informally transfer or share temporary foreign workers from one employer to another. These actions contravene [sections 124(1)(c) and 125 of the Immigration and Refugee Protection Act (IRPA)](https://laws.justice.gc.ca/eng/acts/i-2.5/page-15.html#h-275952).\n\nDecision\n--------"
    },
    {
      "heading": "Port of entry",
      "heading_path": [
        "Seasonal Agricultural Worker Program (SAWP) – Temporary Foreign Worker Program (TFWP)",
        "Labour market impact assessment (LMIA)",
        "Port of entry"
      ],
      "anchor": "#port-of-entry",
      "text": "Officers should be aware that under subsection R198(2), foreign nationals cannot apply at the port of entry if they are applying for the SAWP. For more information on who can apply for a work permit at a port of entry, consult [Temporary Foreign Worker Program (TFWP) and International Mobility Program (IMP): Persons who may apply at a port of entry](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/foreign-workers/persons-who-may-apply-port-entry.html).\n\nA border services officer must not accept and approve a SAWP work permit application that is being made at the port of entry. If one is received, please refer the applicant to IRCC.\n\nApplicants to the SAWP are expected to present letters of introduction at the port of entry, indicating that they have already made an application to IRCC and have been provisionally approved.\n\nThe border services officer should review the Notes tab in GCMS in the work permit for any specific IRCC instructions.\n\nIf a border services officer is satisfied that the foreign national is admissible and will comply with the imposed temporary resident general conditions, including, “Unless authorized, prohibited from engaging in employment in Canada”, the border services officer can authorize the foreign national into Canada as a temporary resident.\n\nFor all officer options on entry, refer to [ENF 4 POE Processing Manual (PDF, 1.82 MB)](https://www.canada.ca/content/dam/ircc/migration/ircc/english/resources/manuals/enf/enf04-eng.pdf).\n\n**Important:** The validity date of a **SAWP work permit** should always be until December 15 unless the passport or biometrics expire before that date. If that is the case, a note should be entered explaining the reason for the limited validity."
    },
    {
      "heading": "Work permit issuance in the Global Case Management System (GCMS)",
      "heading_path": [
        "Seasonal Agricultural Worker Program (SAWP) – Temporary Foreign Worker Program (TFWP)",
        "Labour market impact assessment (LMIA)",
        "Approval",
        "Work permit issuance in the Global Case Management System (GCMS)"
      ],
      "anchor": "#work-permit-issuance-in-the-global-case-management-system-gcms",
      "text": "Information in the system and on the approved work permit must match the information found in the **Employment Details tab – LMIA view** in GCMS. Officers must always refresh the screen to view the latest LMIA information before approving an application.\n\nOfficers approving work permits must ensure that correctly coded multiple-entry visas should be issued valid for the same period as the work permit or passport, whichever expires first.\n\n| Field | Selection or input |\n| --- | --- |\n| Case type | 98 |\n| Special program | SAWP |\n| Province of destination | The province of destination is uploaded automatically from the work permit application form. **Officers should ensure that it matches the location of employment in the LMIA view.** |\n| City of destination | The city of destination is uploaded automatically from the work permit application form. **Officers should ensure that it matches the location of employment in the LMIA view.** |\n| NOC | Manually enter the NOC from the**Employment Details – LMIA**tab. |\n| Intended occupation | The job title is uploaded automatically from the work permit application form. **Officers should ensure that it matches the job title in the Employment Details – LMIA tab.** |\n| LMIA number | The LMIA number is uploaded from the application form, or manually entered based on the LMIA approval letter provided by the applicant. |\n| If destination is Quebec | The CAQ “Valid to date” also needs to be populated. It cannot be left blank. For SAWP, the CAQ validity date is set by default to December 15 of each year. |\n| Employer | Approved MEX/CCSAWP employer – **Please ensure that the name of the employer on the work permit remains blank.** (The name of the employer should not be on the work permit). |\n| Duration | SAWP work permits should be issued to December 15 of the agricultural season for which they are applying (not to exceed a maximum duration of employment of 8 months). **If a date other than December 15 is provided, a GCMS note is mandatory.** **The note in GCMS should state, “PPT expires YYYY/MM/DD”. Client will need to extend passport in Canada and show proof if they wish to have a full validity employment period as per work permit User Remarks.** |\n| User remarks (mandatory) | Approved MEX/CCSAWP employer only. Valid to work in all Provinces. Period of cumulative work not to exceed employment duration specified in the LMIA to a maximum of 8 months [R185(b)(iv)]. |\n\n**Note:** Applicants named in LMIAs that are approved in other regular agricultural streams can apply at a port of entry [if they meet all other relevant criteria](https://www.canada.ca/en/immigration-refugees-citizenship/services/work-canada/work-permit/eligibility.html).\n\nRefusal\n-------\n\nOnce an officer has assessed that a foreign national meets the eligibility requirements for a work permit (for example, the applicant has submitted the fees and has a valid passport) they must determine whether there are any [prohibitions](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/foreign-workers/prohibitions.html) on the issuance of the permit.\n\nSubsection R200(3) specifies the situations in which an officer must not issue a work permit.\n\nIf the officer believes for any reason that the foreign national will not be able to perform their duties, they must not issue the work permit based on reasonable grounds [R200(3)(a)].\n\nThe officer must determine whether the foreign national meets the job requirements and whether there are any other factors that may prevent the foreign national from being able to perform the duties of the position.\n\nAn officer requires reasonable grounds to believe that the foreign national will be unable to perform the duties of the job.\n\nIf a SAWP applicant is refused, the foreign government will be notified and they will substitute the applicant in question for a new one out of their pool of pre-screened applicants.\n\nLinks\n-----\n\n* [Agricultural workers – Work temporarily in Canada](https://www.canada.ca/en/immigration-refugees-citizenship/services/work-canada/special-instructions/agricultural.html)\n* [Employers who have been found non-compliant](https://www.canada.ca/en/immigration-refugees-citizenship/services/work-canada/employers-non-compliant.html)\n* [Quebec cases – TFWP and IMP](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/foreign-workers/quebec-cases.html)\n* [Public list of employers who have been non-compliant](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/foreign-workers/eligibility/public-list-employers-who-have-been-non-compliant.html)\n* [Temporary residents – Refusals overview](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/visitors/refusals-overview.html)\n\nPage details\n------------\n\n 2025-11-28"
    }
  ],
  "links": {
    "outbound": [
      "https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/foreign-workers/exemption-codes/overview.html",
      "https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/foreign-workers/exemption-codes/validity-suspension-duration-employment.html",
      "https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/foreign-workers/sawp.html",
      "https://www.canada.ca/en/employment-social-development/services/foreign-workers/agricultural/seasonal-agricultural.html",
      "https://ircc.canada.ca/english/information/fees/index.asp",
      "https://www.canada.ca/en/services/jobs/workplace/federally-regulated-industries.html",
      "https://www.canada.ca/en/employment-social-development/services/foreign-workers/agricultural/seasonal-agricultural/requirements.html",
      "https://laws.justice.gc.ca/eng/acts/i-2.5/page-15.html",
      "https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/foreign-workers/persons-who-may-apply-port-entry.html",
      "https://www.canada.ca/content/dam/ircc/migration/ircc/english/resources/manuals/enf/enf04-eng.pdf",
      "https://www.canada.ca/en/immigration-refugees-citizenship/services/work-canada/work-permit/eligibility.html",
      "https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/foreign-workers/prohibitions.html",
      "https://www.canada.ca/en/immigration-refugees-citizenship/services/work-canada/special-instructions/agricultural.html",
      "https://www.canada.ca/en/immigration-refugees-citizenship/services/work-canada/employers-non-compliant.html",
      "https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/foreign-workers/quebec-cases.html",
      "https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/foreign-workers/eligibility/public-list-employers-who-have-been-non-compliant.html",
      "https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/visitors/refusals-overview.html"
    ],
    "internal_children": []
  },
  "quality": {
    "is_toc_like": false,
    "is_low_text": false,
    "notes": []
  }
}