{
  "source_id": "pdi_c4e3e095a8ba",
  "source_type": "guidance_pdi",
  "source_url": "https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/foreign-workers/eligibility/urgent-referrals.html",
  "canonical_url": "https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/foreign-workers/eligibility/urgent-referrals.html",
  "title": "Urgent referrals process for work permits",
  "language": "en",
  "manual": "Urgent referrals process for work permits",
  "chapter": null,
  "heading_path": [
    "Urgent referrals process for work permits"
  ],
  "last_updated": "2019-05-21",
  "crawl_ts": "2026-02-12T00:00:00Z",
  "http": {
    "status_code": 200,
    "content_type": "text/markdown"
  },
  "content_hash": "8ef66bd40216aa3832ef5a39d8d31dfa5a24e95ded681137a1d7dc54d88ac7f9",
  "raw_html_path": null,
  "markdown_path": "scripts/scraper/ircc_data_clean/urgent-referrals-c4e3e095a8.md",
  "text": "Published Time: Thu, 12 Feb 2026 00:36:23 GMT\n\nUrgent referrals process for work permits\n=========================================\n\nAll in-Canada visitor extension, study permit and work permit applications must be submitted electronically, with some exceptions. Consult the list of[programs that are exempt from the in-Canada mandatory electronic application requirement](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/visitors/place-application-visa-electronic-travel-authorization-study-permit-work-permit/exempt-electronic-applications.html).\n\nThis section contains policy, procedures and guidance used by IRCC staff. It is posted on the department’s website as a courtesy to stakeholders.\n\nApplications for work permits extensions are submitted to the Centralized Network. Local Immigration, Refugees and Citizenship Canada(IRCC) offices are only expected to process complex or exceptional cases. However, certain types of requests for urgent work permit processing may be received by the Centralized Network or referred to local IRCC offices.\n\nThe provision for the urgent processing of work permits is neither a legislated activity nor a delegated decision. Local management is expected to exercise sound judgement to determine the level and manner of service required in a particular situation. Local managers are responsible for service delivery in their areas and should brief local staff on the application of these guidelines.\n\nOn this page\n------------\n\n* [General criteria](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/foreign-workers/eligibility/urgent-referrals.html#gen_crit)\n* [Instructions for the case processing centre](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/foreign-workers/eligibility/urgent-referrals.html#instr_pc)\n* [Refunds at the case processing centre](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/foreign-workers/eligibility/urgent-referrals.html#ref_pc)\n* [Instructions for local IRCC offices](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/foreign-workers/eligibility/urgent-referrals.html#intr_ircc_off)\n* [Refunds at local IRCC offices](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/foreign-workers/eligibility/urgent-referrals.html#ref_ircc_off)\n\nGeneral criteria\n----------------\n\nRequests for urgent processing are most often received when clients contact the Client Support Centre to request urgent processing, when members of Parliament contact the case processing centre to request urgent processing for a constituent or when local offices receive urgent request referrals directly from partners (such as provincial governments).\n\nThe current list provides examples of cases that warrant urgent processing:\n\n* foreign medical doctor involved in the treatment of patients (such as a pathologist involved in the treatment of cancer patients) who is changing employers, relocating to another province or renewing their medical licence (note that a medical doctor who teaches but who is not actively involved in the treatment of patients does not qualify for urgent processing)\n* foreign worker who is travelling urgently for business or due to death in the family or serious illness\n* foreign worker who is qualified under the Alternatives to Detention Community Case Management and Supervision (CCMS) Program led by the Canada Border Services Agency (CBSA) \n * The CCMS Program, implemented in June 2018, aims to facilitate the release of individuals from detention into the community with support from third-party service providers (vendors) versed in providing socio-medical support in an enforcement environment.\n * Released individuals enrolled in CCMS are eligible to apply for an open work permit under paragraph 206(1)(b) of the Immigration and Refugee Protection Regulations (IRPR) (Labour Market Impact Assessment [LMIA] exemption code S62). The applicant is required to pay the processing fee ($155) but is exempt from the requirement to pay the open work permit fee ($100).\n * The applicant is provided with a letter from their vendor to support their work permit application.\n * Applicants can submit their paper application to the Case Processing Centre (CPC) in Edmonton (attention of TL-OSS).\n * Applicants are not required to contact the Client Support Centre, since they have been identified under the CCMS Program led by the CBSA.\n * For tracking purposes, until a special program code is created, the processing agent should add the ORG code CCMS.\n\nClients must provide all the required documents for a work permit application, such as a LMIA or an offer of employment, as well as a Quebec Acceptance Certificate(CAQ), if applicable. Clients must also provide proof of urgency, such as proof of travel, a certificate of death or evidence of serious illness, or proof of CCMS enrolment.\n\n### Role of the Client Support Centre\n\nIf the Client Support Centre agent determines that the client meets the criteria for urgent processing, a note is entered under the client’s unique client identifier(UCI) in the Global Case Management System(GCMS), indicating that the request has been received and that the client will submit an application by mail (attention of TL-OSS) to the case processing centre or that a referral has been sent to the local office for urgent processing.\n\n**Note:** The Client Support Centre must inform clients that the final determination on whether urgent processing will begin rests with the immigration officer.\n\nInstructions for the case processing centre\n-------------------------------------------\n\nIf the client can wait 10 business days, the Client Support Centre agent will inform the client to submit their application to the case processing centre with all the required documents (such as an LMIA or offer of employment, a CAQ if applicable, and evidence of urgency, like proof of travel, a certificate of death or evidence of serious illness, or proof of CCMS enrolment). Urgent requests will be processed within 48 hours to 5 business days (plus additional time for mailing) by the case processing centre. In the event that the case does not warrant urgent processing, it will be put in the queue for regular processing. The agent will add a note in GCMS explaining that the case will not be processed urgently. The client will be notified that their application does not warrant urgent processing.\n\nRefunds at the case processing centre\n-------------------------------------\n\nIf the client submitted an application to the regular processing queue before the onset of the emergency, the client must send a new application for urgent processing with all the required documents, including fees and evidence of the urgency. The agent later processing the initial application will determine if the urgent work permit that has been issued has authorized all of the work that the client wishes to perform. If so, the fees will be refunded for this initial application, as the fees will already have been processed for the urgent processing.\n\nInstructions for local IRCC offices\n-----------------------------------\n\nCases meeting these same referral criteria but where processing must occur in less than 10 business days should be referred to the office responsible for the area in which the client is living.\n\n1. The Client Support Centre agent will do the following: \n 1. confirm that the urgent situation meets the referral criteria and inform clients that it is the local office that determines whether urgent processing will begin\n 2. inform the client that they will be contacted by the local office within 4 business days\n 3. advise the client of the required documentation (such as the LMIA or offer of employment, the CAQ if applicable and evidence of urgency, like proof of travel, a certificate of death or evidence of serious illness) to provide at the local office\n\n2. The Client Support Centre agent will then complete the referral template and send an email referral to the appropriate local office. A note reflecting the outcome of the call as well as the client contact information will be placed under the client’s UCI in GCMS by the Client Support Centre agent.\n3. The local office will monitor the mailbox and may contact the client referred to them for further information (missing documents or phone interview). In cases where an in-person interview is required, the local office will advise the client of the time and location of the interview.\n4. When contacting clients, the local office should once again remind them of the documentation required to issue the work permit, as well as the required evidence of the existence of the emergency. For example, if the request for expedited service is based on the illness or death of a family member, it may be appropriate to request evidence of the illness or a copy of the death certificate. It may also be appropriate to request evidence of travel plans. Supporting documentation requirements will have also been relayed to clients by the Client Support Centre.\n5. If the officer at the local office determines that the case does not meet the criteria for urgent processing, the client will be asked to submit their application to the case processing centre for regular processing. In these cases, officers are requested to indicate in a case note in GCMS that the file was declined for urgent processing and that the client has been referred for regular processing to the case processing centre.\n6. In cases where the client has previously submitted an application to the case processing centre for regular processing, the local IRCC offices should only process the application if the case processing centre cannot reach a decision before the onset of the urgent situation for which the document is required. Refer to [the latest processing times](https://www.canada.ca/en/immigration-refugees-citizenship/services/application/check-processing-times.html) to verify the delay at the case processing centre. If the case processing centre is working on applications received close to the date the client submitted their previous application, the local office should contact the case processing centre to confirm if a decision will be rendered soon.\n\nRefunds at local IRCC offices\n-----------------------------\n\nFor clients who have already submitted an application to the case processing centre for a new work permit or for an extension of their existing work permit, but where the processing of that application has not yet begun, the local IRCC office processing the urgent work permit should confirm with the client that they wish to withdraw the application in queue at the case processing centre and receive a refund of those processing fees. This information is to be noted in a case note in GCMS for the information of the case processing centre.\n\nFor the purpose of withdrawals and refunds arising from the issuance of urgent work permits, verbal confirmation of the client’s desire to withdraw the earlier application at the case processing centre will satisfy the second policy statement in the IRCC refund policy.\n\nFor cases where there is evidence in GCMS that the application is already in process at the case processing centre, clients will not be eligible for a refund of fees.\n\nPage details\n------------\n\n 2019-05-21",
  "sections": [
    {
      "heading": "Urgent referrals process for work permits",
      "heading_path": [
        "Urgent referrals process for work permits"
      ],
      "anchor": "#urgent-referrals-process-for-work-permits",
      "text": "Published Time: Thu, 12 Feb 2026 00:36:23 GMT\n\nUrgent referrals process for work permits\n=========================================\n\nAll in-Canada visitor extension, study permit and work permit applications must be submitted electronically, with some exceptions. Consult the list of[programs that are exempt from the in-Canada mandatory electronic application requirement](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/visitors/place-application-visa-electronic-travel-authorization-study-permit-work-permit/exempt-electronic-applications.html).\n\nThis section contains policy, procedures and guidance used by IRCC staff. It is posted on the department’s website as a courtesy to stakeholders.\n\nApplications for work permits extensions are submitted to the Centralized Network. Local Immigration, Refugees and Citizenship Canada(IRCC) offices are only expected to process complex or exceptional cases. However, certain types of requests for urgent work permit processing may be received by the Centralized Network or referred to local IRCC offices.\n\nThe provision for the urgent processing of work permits is neither a legislated activity nor a delegated decision. Local management is expected to exercise sound judgement to determine the level and manner of service required in a particular situation. Local managers are responsible for service delivery in their areas and should brief local staff on the application of these guidelines.\n\nOn this page\n------------\n\n* [General criteria](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/foreign-workers/eligibility/urgent-referrals.html#gen_crit)\n* [Instructions for the case processing centre](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/foreign-workers/eligibility/urgent-referrals.html#instr_pc)\n* [Refunds at the case processing centre](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/foreign-workers/eligibility/urgent-referrals.html#ref_pc)\n* [Instructions for local IRCC offices](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/foreign-workers/eligibility/urgent-referrals.html#intr_ircc_off)\n* [Refunds at local IRCC offices](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/foreign-workers/eligibility/urgent-referrals.html#ref_ircc_off)\n\nGeneral criteria\n----------------\n\nRequests for urgent processing are most often received when clients contact the Client Support Centre to request urgent processing, when members of Parliament contact the case processing centre to request urgent processing for a constituent or when local offices receive urgent request referrals directly from partners (such as provincial governments).\n\nThe current list provides examples of cases that warrant urgent processing:\n\n* foreign medical doctor involved in the treatment of patients (such as a pathologist involved in the treatment of cancer patients) who is changing employers, relocating to another province or renewing their medical licence (note that a medical doctor who teaches but who is not actively involved in the treatment of patients does not qualify for urgent processing)\n* foreign worker who is travelling urgently for business or due to death in the family or serious illness\n* foreign worker who is qualified under the Alternatives to Detention Community Case Management and Supervision (CCMS) Program led by the Canada Border Services Agency (CBSA) \n * The CCMS Program, implemented in June 2018, aims to facilitate the release of individuals from detention into the community with support from third-party service providers (vendors) versed in providing socio-medical support in an enforcement environment.\n * Released individuals enrolled in CCMS are eligible to apply for an open work permit under paragraph 206(1)(b) of the Immigration and Refugee Protection Regulations (IRPR) (Labour Market Impact Assessment [LMIA] exemption code S62). The applicant is required to pay the processing fee ($155) but is exempt from the requirement to pay the open work permit fee ($100).\n * The applicant is provided with a letter from their vendor to support their work permit application.\n * Applicants can submit their paper application to the Case Processing Centre (CPC) in Edmonton (attention of TL-OSS).\n * Applicants are not required to contact the Client Support Centre, since they have been identified under the CCMS Program led by the CBSA.\n * For tracking purposes, until a special program code is created, the processing agent should add the ORG code CCMS.\n\nClients must provide all the required documents for a work permit application, such as a LMIA or an offer of employment, as well as a Quebec Acceptance Certificate(CAQ), if applicable. Clients must also provide proof of urgency, such as proof of travel, a certificate of death or evidence of serious illness, or proof of CCMS enrolment."
    },
    {
      "heading": "Role of the Client Support Centre",
      "heading_path": [
        "Urgent referrals process for work permits",
        "Role of the Client Support Centre"
      ],
      "anchor": "#role-of-the-client-support-centre",
      "text": "If the Client Support Centre agent determines that the client meets the criteria for urgent processing, a note is entered under the client’s unique client identifier(UCI) in the Global Case Management System(GCMS), indicating that the request has been received and that the client will submit an application by mail (attention of TL-OSS) to the case processing centre or that a referral has been sent to the local office for urgent processing.\n\n**Note:** The Client Support Centre must inform clients that the final determination on whether urgent processing will begin rests with the immigration officer.\n\nInstructions for the case processing centre\n-------------------------------------------\n\nIf the client can wait 10 business days, the Client Support Centre agent will inform the client to submit their application to the case processing centre with all the required documents (such as an LMIA or offer of employment, a CAQ if applicable, and evidence of urgency, like proof of travel, a certificate of death or evidence of serious illness, or proof of CCMS enrolment). Urgent requests will be processed within 48 hours to 5 business days (plus additional time for mailing) by the case processing centre. In the event that the case does not warrant urgent processing, it will be put in the queue for regular processing. The agent will add a note in GCMS explaining that the case will not be processed urgently. The client will be notified that their application does not warrant urgent processing.\n\nRefunds at the case processing centre\n-------------------------------------\n\nIf the client submitted an application to the regular processing queue before the onset of the emergency, the client must send a new application for urgent processing with all the required documents, including fees and evidence of the urgency. The agent later processing the initial application will determine if the urgent work permit that has been issued has authorized all of the work that the client wishes to perform. If so, the fees will be refunded for this initial application, as the fees will already have been processed for the urgent processing.\n\nInstructions for local IRCC offices\n-----------------------------------\n\nCases meeting these same referral criteria but where processing must occur in less than 10 business days should be referred to the office responsible for the area in which the client is living.\n\n1. The Client Support Centre agent will do the following: \n 1. confirm that the urgent situation meets the referral criteria and inform clients that it is the local office that determines whether urgent processing will begin\n 2. inform the client that they will be contacted by the local office within 4 business days\n 3. advise the client of the required documentation (such as the LMIA or offer of employment, the CAQ if applicable and evidence of urgency, like proof of travel, a certificate of death or evidence of serious illness) to provide at the local office\n\n2. The Client Support Centre agent will then complete the referral template and send an email referral to the appropriate local office. A note reflecting the outcome of the call as well as the client contact information will be placed under the client’s UCI in GCMS by the Client Support Centre agent.\n3. The local office will monitor the mailbox and may contact the client referred to them for further information (missing documents or phone interview). In cases where an in-person interview is required, the local office will advise the client of the time and location of the interview.\n4. When contacting clients, the local office should once again remind them of the documentation required to issue the work permit, as well as the required evidence of the existence of the emergency. For example, if the request for expedited service is based on the illness or death of a family member, it may be appropriate to request evidence of the illness or a copy of the death certificate. It may also be appropriate to request evidence of travel plans. Supporting documentation requirements will have also been relayed to clients by the Client Support Centre.\n5. If the officer at the local office determines that the case does not meet the criteria for urgent processing, the client will be asked to submit their application to the case processing centre for regular processing. In these cases, officers are requested to indicate in a case note in GCMS that the file was declined for urgent processing and that the client has been referred for regular processing to the case processing centre.\n6. In cases where the client has previously submitted an application to the case processing centre for regular processing, the local IRCC offices should only process the application if the case processing centre cannot reach a decision before the onset of the urgent situation for which the document is required. Refer to [the latest processing times](https://www.canada.ca/en/immigration-refugees-citizenship/services/application/check-processing-times.html) to verify the delay at the case processing centre. If the case processing centre is working on applications received close to the date the client submitted their previous application, the local office should contact the case processing centre to confirm if a decision will be rendered soon.\n\nRefunds at local IRCC offices\n-----------------------------\n\nFor clients who have already submitted an application to the case processing centre for a new work permit or for an extension of their existing work permit, but where the processing of that application has not yet begun, the local IRCC office processing the urgent work permit should confirm with the client that they wish to withdraw the application in queue at the case processing centre and receive a refund of those processing fees. This information is to be noted in a case note in GCMS for the information of the case processing centre.\n\nFor the purpose of withdrawals and refunds arising from the issuance of urgent work permits, verbal confirmation of the client’s desire to withdraw the earlier application at the case processing centre will satisfy the second policy statement in the IRCC refund policy.\n\nFor cases where there is evidence in GCMS that the application is already in process at the case processing centre, clients will not be eligible for a refund of fees.\n\nPage details\n------------\n\n 2019-05-21"
    }
  ],
  "links": {
    "outbound": [
      "https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/visitors/place-application-visa-electronic-travel-authorization-study-permit-work-permit/exempt-electronic-applications.html",
      "https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/foreign-workers/eligibility/urgent-referrals.html",
      "https://www.canada.ca/en/immigration-refugees-citizenship/services/application/check-processing-times.html"
    ],
    "internal_children": []
  },
  "quality": {
    "is_toc_like": false,
    "is_low_text": false,
    "notes": []
  }
}