{
  "source_id": "pdi_5de710bd685d",
  "source_type": "guidance_pdi",
  "source_url": "https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/foreign-workers/visitor-work-permits.html",
  "canonical_url": "https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/foreign-workers/visitor-work-permits.html",
  "title": "Public policy allowing certain visitors in Canada to apply for an employer-specific work permit",
  "language": "en",
  "manual": "Public policy allowing certain visitors in Canada to apply for an employer",
  "chapter": "specific work permit",
  "heading_path": [
    "Public policy allowing certain visitors in Canada to apply for an employer-specific work permit"
  ],
  "last_updated": "2024-10-03",
  "crawl_ts": "2026-02-12T00:00:00Z",
  "http": {
    "status_code": 200,
    "content_type": "text/markdown"
  },
  "content_hash": "8324fc56a924e46986aae09650fd8784060ca399d541e0ce9d97c4b9c9c0b839",
  "raw_html_path": null,
  "markdown_path": "scripts/scraper/ircc_data_clean/visitor-work-permits-5de710bd68.md",
  "text": "Published Time: Wed, 11 Feb 2026 23:45:54 GMT\n\nPublic policy allowing certain visitors in Canada to apply for an employer-specific work permit\n===============================================================================================\n\nThis section contains policy, procedures and guidance used by IRCC staff. It is posted on the department’s website as a courtesy to stakeholders.\n\nThese instructions apply to IRCC employees. Since applicants cannot submit their applications at ports of entry, the instructions do not apply to border services officers.\n\nA temporary public policy has been issued to allow certain temporary residents to apply for a work permit from within Canada. The eligibility criteria were expanded to allow all visitors who are in Canada with valid temporary resident status to apply for an employer-specific work permit from within Canada, regardless of when they arrived. While all temporary residents can apply for an employer-specific work permit under the public policy, only those who held a work permit in the last 12 months may request interim authorization to work.\n\nThe temporary public policy to allow all visitors who are in Canada with valid temporary resident status to apply for an employer-specific work permit from within Canada came into effect on **August 24, 2020**. This public policy is in effect until **August 28, 2024**.\n\nOn this page\n------------\n\n* [Policy objectives](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/foreign-workers/visitor-work-permits.html#toc1)\n* [Eligibility requirements for visitors to apply for an employer-specific work permit](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/foreign-workers/visitor-work-permits.html#toc2)\n* [Eligibility requirements for interim authorization to work](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/foreign-workers/visitor-work-permits.html#toc3)\n* [Receipt of work permit application](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/foreign-workers/visitor-work-permits.html#toc4)\n* [Foreign national seeking interim work authorization](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/foreign-workers/visitor-work-permits.html#toc5)\n * [Example of template provided in public instructions](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/foreign-workers/visitor-work-permits.html#toc5_1)\n\n* [Processing of public policy requests](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/foreign-workers/visitor-work-permits.html#toc6)\n * [Step 1: Receipt of IRCC Web form](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/foreign-workers/visitor-work-permits.html#toc6.1)\n * [Step 2: Assessment under the public policy](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/foreign-workers/visitor-work-permits.html#toc6.2)\n * [Public policy request is not complete](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/foreign-workers/visitor-work-permits.html#sec62_1)\n * [Public policy request is complete](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/foreign-workers/visitor-work-permits.html#sec62_2)\n * [Public policy eligibility not met: requester has not submitted an employer-specific work permit application](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/foreign-workers/visitor-work-permits.html#sec62_3)\n\n * [Step 3: Work permit application](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/foreign-workers/visitor-work-permits.html#toc6.3)\n * [Work permit application is not complete](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/foreign-workers/visitor-work-permits.html#sec63_1)\n * [Positive public policy decision](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/foreign-workers/visitor-work-permits.html#sec63_2)\n * [Negative public policy decision](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/foreign-workers/visitor-work-permits.html#sec63_3)\n * [Work permit application is complete](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/foreign-workers/visitor-work-permits.html#sec63_4)\n\nPolicy objectives\n-----------------\n\nThis public policy will\n\n* permit eligible foreign nationals with valid temporary resident status as visitors to apply for a job offer-supported work permit from inside Canada\n* exempt eligible foreign nationals from the requirement that a work permit not be issued if they have not complied with certain temporary residence conditions\n* allow eligible former temporary foreign workers to work while a decision on their work permit application is pending\n\nEligibility requirements for visitors to apply for an employer-specific work permit\n-----------------------------------------------------------------------------------\n\nThe foreign national\n\n1. is in Canada with valid temporary resident status as a visitor, including status extensions under subsection 183(5) of the Immigration and Refugee Protection Regulations (IRPR), that is, maintained status, at the time of work permit application submission\n2. has submitted an employer-specific work permit application using the Application to Change Conditions, Extend my Stay or Remain in Canada as a Worker [IMM 5710]\n3. has remained in Canada with status since application submission and intends to remain in Canada throughout the period during which their work permit application is being processed\n4. submitted the application on or before **August 28, 2024**\n\nEligibility requirements for interim authorization to work\n----------------------------------------------------------\n\nIn addition to meeting the eligibility criteria for the work permit, a former work permit holder who converted to visitor status may also be eligible for interim authorization to work if they meet **all the following**:\n\n* have valid temporary resident status at the time of work permit application submission\n* held a valid work permit in the 12 months preceding the date on which they submitted their application for a work permit under this public policy, even though they are now only a visitor\n* intend to work for the employer and occupation specified by the LMIA or LMIA-exempt offer of employment included in their work permit application submitted under the public policy\n* have applied to IRCC for the interim authorization to work as per this public policy using the IRCC Web form\n* have requested that the authorization to work be applicable until a decision is made on their work permit application\n* will remain in Canada throughout the period during which their work permit application is being processed\n\nReceipt of work permit application\n----------------------------------\n\nAll in-Canada work permit applications under this public policy must be submitted electronically.\n\nChanges were made to the Come to Canada question flow to allow for applicants to [apply for their work permit online](https://www.canada.ca/en/immigration-refugees-citizenship/services/work-canada/work-permit/apply.html).\n\n**Applicants** are instructed to take the following specific steps:\n\n* Answer the individual questions correctly. Your present status is as a visitor, and you are applying to work for a term over or under 6 months.\n* When asked “Are you applying under the Canada–USA–Mexico Agreement (CUSMA) or under a Public Policy related to work permits as announced by IRCC for an employer specific work permit?”, answer“yes”.\n\nSubmission of the work permit application by a visitor is sufficient to meet the public policy eligibility for applying.\n\nApplicants must submit a complete employer-specific work permit application, including a Labour Market Impact Assessment (LMIA) or LMIA-exempt offer of employment and, if applicable, a Quebec Acceptance Certificate (CAQ).\n\nThose seeking interim authorization to work must make a further request using the IRCC Web form as per instructions below.\n\nForeign national seeking interim work authorization\n---------------------------------------------------\n\nInterim authorization to work is not automatic.\n\nEligible foreign nationals must request the interim authorization to work using the IRCC Web form. When the Client Support Centre transfers the incoming web forms, officers should see one of the following messages from the applicant in the IRCC Web form. This will flag that the request is to be considered under this public policy.\n\n### Example of template provided in public instructions\n\n**Message for previous work permit holders requesting interim authorization to work**\n\nPriority Code **visit2work 2020**: I am requesting consideration under the **Temporary Public Policy to Exempt Certain Visitors in Canada from Immigration Requirements** and ask that the applicable exemptions be granted until a decision is made on my work permit application or it is withdrawn.\n\nMy previous work permit number U######### expired on [Date].\n\nI have submitted my application for a work permit online. **or** I have submitted my application on paper and the postal/courier tracking number is number.\n\nI intend to work for [employer name] / [occupation] as specified in the aforementioned work permit application.\n\nI understand that providing false, misleading or incorrect information is a violation of the Immigration and Refugee Protection Act and may result in enforcement measures against me.\n\nProcessing of public policy requests\n------------------------------------\n\n### Step 1: Receipt of IRCC Web form\n\nOn receipt of the IRCC Web form, the Client Support Centre (CSC) will separate these requests and move them to a specific folder for the Centralized Network (CN) to access.\n\nCSC may use the following key word to auto-triage requests under this specific public policy: **visit2work 2020**.\n\nCSC agents will not be reviewing or responding to the incoming Web forms to ensure compliance with the public policy. They will simply move the Web forms to the appropriate email folder for CN to assess.\n\n### Step 2: Assessment under the public policy\n\nThere is a 30 business day service standard for assessment of requests under the public policy. Officers should review the public policy consideration request to determine if all of the following apply:\n\n1. there is a request for assessment under this public policy\n2. the request has sufficient information to find the work permit application in the Global Case Management System (GCMS)\n3. the applicant previously held a work permit in the 12 months preceding the application\n\nThe following are the applicable procedures if the public policy\n\n* [request is not complete](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/foreign-workers/visitor-work-permits.html#sec62_1)\n* [request is complete](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/foreign-workers/visitor-work-permits.html#sec62_2)\n* [request does not meet eligibility requirements](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/foreign-workers/visitor-work-permits.html#sec62_3)\n\n#### Public policy request is not complete\n\nThe processing officer may send **a rejection notice** if the IRCC Web form does **not** include any of the following:\n\n* a request for assessment\n* sufficient information to confirm the receipt of an employer-specific work permit application\n* an indication that the applicant held a work permit in the preceding 12 months\n* evidence that the applicant is no longer in Canada\n\nThe rejection notice should use the following template. It is recommended that this simply be a reply to the incoming IRCC Web form request. Officers should attach the incoming request in GCMS under Incoming Correspondence or as a case note.\n\n**Rejection notice template [delete paragraphs that do not apply]**\n\nI have reviewed the information provided in your IRCC Web form request.\n\n[You did not submit a request for consideration under the **Temporary Public Policy to Exempt Certain Visitors in Canada from Immigration Requirements.**]\n\nand\n\n[You have not provided sufficient information to confirm that you have submitted an application for an employer-specific work permit, which is required for eligibility for the public policy.]\n\nand\n\n[You did not provide information on your previous work permit that was valid in the last 12 months.]\n\nYou may submit a request by following the instructions to [Apply online under a public policy](https://www.canada.ca/en/immigration-refugees-citizenship/services/work-canada/work-permit/apply.html).\n\n**Important:** The officer should ensure that the rejection notice is entered in the case notes of the application. If the officer is unable to find the new work permit application but can find the client in GCMS, a client note with the submission and the response should be added.\n\n#### Public policy request is complete\n\nIf the request has all 3 requirements, the processing officer should then review the documentation in the work permit application to determine if the application is complete and a final decision can be rendered.\n\n#### Public policy eligibility not met: requester has not submitted an employer-specific work permit application\n\nIf on review of the work permit application it is determined that the foreign national is not applying for an employer-specific work permit, the request **does not** meet the eligibility requirements. The officer may choose not to process the application on a priority basis and may refuse the public policy request using the template for a [Negative public policy decision](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/foreign-workers/visitor-work-permits.html#sec63_3).\n\n**Important:** A case note should be added to GCMS on the work permit application with the request and response.\n\n### Step 3: Work permit application\n\nThe following are the applicable procedures if the\n\n* [work permit application is not complete](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/foreign-workers/visitor-work-permits.html#sec63_1)\n* [work permit application is complete](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/foreign-workers/visitor-work-permits.html#sec63_4)\n\n#### Work permit application is not complete\n\nIf the work permit application is incomplete, other than biometric enrolment, the processing officer will request the additional documentation and give the applicant 30 days to respond.\n\nThey will **also provide** either a positive or a negative public policy assessment decision as a reply to the IRCC Web form email and add a case note on their decision.\n\nThe following are the applicable procedures in the case of a\n\n* positive public policy decision\n* negative public policy decision\n\n#### Positive public policy decision\n\nIf the request meets the eligibility requirements, the officer will send the following response:\n\nAs per the information provided in your request below, you have been deemed to meet the eligibility criteria under the Temporary Public Policy to Exempt Certain Visitors in Canada from Immigration Requirements.\n\n**Please print a copy of this email and attach it to your existing work permit or authorization to work as proof of ability to work** for your stated employer or occupation until a determination is made on your current work permit application or it is withdrawn.\n\nPlease note that misrepresenting or withholding material facts relating to a relevant matter that causes an error in decision is a violation of the Immigration and Refugee Protection Act.\n\n#### Negative public policy decision\n\nIf the request does **not** meet the eligibility requirements, the officer will send the following response to the IRCC Web form email. The processing officer should delete any requirement that doesn’t apply to the specific request.\n\nI have assessed your request under the Temporary Public Policy to Exempt Certain Visitors in Canada from Immigration Requirements.\n\nYour request for consideration under this public policy has been refused as you do not meet at least one of the eligibility criteria for the public policy, in that\n\n* you do not have current temporary resident status in Canada\n* you are not applying for an employer-specific work permit\n* you have not held a work permit in the 12 months preceding your application for a work permit\n* you have not requested that the public policy exemptions be applicable until a decision is made on your work permit application or it is withdrawn\n* you have left Canada\n\n#### Work permit application is complete\n\nIf application is complete, the processing officer will finalize the work permit application and send the final decision (positive or negative) to the applicant. No further action on the public policy request is needed.\n\n**Important**: Applicants under this public policy are not subject to the prohibition on issuance of a work permit if the applicant worked without authorization [R200(3)(e)]. This prohibition has been waived as part of the public policy.\n\n**If the decision on the work permit is to refuse the application**, the processing officer should indicate in the refusal letter that the public policy assessment is also refused because a decision has been made on their application.\n\n**In addition to the refusal reasons for the work permit**, officers should enter the following under the “Other” refusal reason: Your request for consideration under the public policy is also refused as you do not meet the eligibility requirements.\n\nPage details\n------------\n\n 2024-10-03",
  "sections": [
    {
      "heading": "Public policy allowing certain visitors in Canada to apply for an employer-specific work permit",
      "heading_path": [
        "Public policy allowing certain visitors in Canada to apply for an employer-specific work permit"
      ],
      "anchor": "#public-policy-allowing-certain-visitors-in-canada-to-apply-for-an-employer-specific-work-permit",
      "text": "Published Time: Wed, 11 Feb 2026 23:45:54 GMT\n\nPublic policy allowing certain visitors in Canada to apply for an employer-specific work permit\n===============================================================================================\n\nThis section contains policy, procedures and guidance used by IRCC staff. It is posted on the department’s website as a courtesy to stakeholders.\n\nThese instructions apply to IRCC employees. Since applicants cannot submit their applications at ports of entry, the instructions do not apply to border services officers.\n\nA temporary public policy has been issued to allow certain temporary residents to apply for a work permit from within Canada. The eligibility criteria were expanded to allow all visitors who are in Canada with valid temporary resident status to apply for an employer-specific work permit from within Canada, regardless of when they arrived. While all temporary residents can apply for an employer-specific work permit under the public policy, only those who held a work permit in the last 12 months may request interim authorization to work.\n\nThe temporary public policy to allow all visitors who are in Canada with valid temporary resident status to apply for an employer-specific work permit from within Canada came into effect on **August 24, 2020**. This public policy is in effect until **August 28, 2024**.\n\nOn this page\n------------\n\n* [Policy objectives](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/foreign-workers/visitor-work-permits.html#toc1)\n* [Eligibility requirements for visitors to apply for an employer-specific work permit](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/foreign-workers/visitor-work-permits.html#toc2)\n* [Eligibility requirements for interim authorization to work](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/foreign-workers/visitor-work-permits.html#toc3)\n* [Receipt of work permit application](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/foreign-workers/visitor-work-permits.html#toc4)\n* [Foreign national seeking interim work authorization](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/foreign-workers/visitor-work-permits.html#toc5)\n * [Example of template provided in public instructions](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/foreign-workers/visitor-work-permits.html#toc5_1)\n\n* [Processing of public policy requests](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/foreign-workers/visitor-work-permits.html#toc6)\n * [Step 1: Receipt of IRCC Web form](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/foreign-workers/visitor-work-permits.html#toc6.1)\n * [Step 2: Assessment under the public policy](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/foreign-workers/visitor-work-permits.html#toc6.2)\n * [Public policy request is not complete](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/foreign-workers/visitor-work-permits.html#sec62_1)\n * [Public policy request is complete](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/foreign-workers/visitor-work-permits.html#sec62_2)\n * [Public policy eligibility not met: requester has not submitted an employer-specific work permit application](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/foreign-workers/visitor-work-permits.html#sec62_3)\n\n * [Step 3: Work permit application](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/foreign-workers/visitor-work-permits.html#toc6.3)\n * [Work permit application is not complete](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/foreign-workers/visitor-work-permits.html#sec63_1)\n * [Positive public policy decision](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/foreign-workers/visitor-work-permits.html#sec63_2)\n * [Negative public policy decision](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/foreign-workers/visitor-work-permits.html#sec63_3)\n * [Work permit application is complete](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/foreign-workers/visitor-work-permits.html#sec63_4)\n\nPolicy objectives\n-----------------\n\nThis public policy will\n\n* permit eligible foreign nationals with valid temporary resident status as visitors to apply for a job offer-supported work permit from inside Canada\n* exempt eligible foreign nationals from the requirement that a work permit not be issued if they have not complied with certain temporary residence conditions\n* allow eligible former temporary foreign workers to work while a decision on their work permit application is pending\n\nEligibility requirements for visitors to apply for an employer-specific work permit\n-----------------------------------------------------------------------------------\n\nThe foreign national\n\n1. is in Canada with valid temporary resident status as a visitor, including status extensions under subsection 183(5) of the Immigration and Refugee Protection Regulations (IRPR), that is, maintained status, at the time of work permit application submission\n2. has submitted an employer-specific work permit application using the Application to Change Conditions, Extend my Stay or Remain in Canada as a Worker [IMM 5710]\n3. has remained in Canada with status since application submission and intends to remain in Canada throughout the period during which their work permit application is being processed\n4. submitted the application on or before **August 28, 2024**\n\nEligibility requirements for interim authorization to work\n----------------------------------------------------------\n\nIn addition to meeting the eligibility criteria for the work permit, a former work permit holder who converted to visitor status may also be eligible for interim authorization to work if they meet **all the following**:\n\n* have valid temporary resident status at the time of work permit application submission\n* held a valid work permit in the 12 months preceding the date on which they submitted their application for a work permit under this public policy, even though they are now only a visitor\n* intend to work for the employer and occupation specified by the LMIA or LMIA-exempt offer of employment included in their work permit application submitted under the public policy\n* have applied to IRCC for the interim authorization to work as per this public policy using the IRCC Web form\n* have requested that the authorization to work be applicable until a decision is made on their work permit application\n* will remain in Canada throughout the period during which their work permit application is being processed\n\nReceipt of work permit application\n----------------------------------\n\nAll in-Canada work permit applications under this public policy must be submitted electronically.\n\nChanges were made to the Come to Canada question flow to allow for applicants to [apply for their work permit online](https://www.canada.ca/en/immigration-refugees-citizenship/services/work-canada/work-permit/apply.html).\n\n**Applicants** are instructed to take the following specific steps:\n\n* Answer the individual questions correctly. Your present status is as a visitor, and you are applying to work for a term over or under 6 months.\n* When asked “Are you applying under the Canada–USA–Mexico Agreement (CUSMA) or under a Public Policy related to work permits as announced by IRCC for an employer specific work permit?”, answer“yes”.\n\nSubmission of the work permit application by a visitor is sufficient to meet the public policy eligibility for applying.\n\nApplicants must submit a complete employer-specific work permit application, including a Labour Market Impact Assessment (LMIA) or LMIA-exempt offer of employment and, if applicable, a Quebec Acceptance Certificate (CAQ).\n\nThose seeking interim authorization to work must make a further request using the IRCC Web form as per instructions below.\n\nForeign national seeking interim work authorization\n---------------------------------------------------\n\nInterim authorization to work is not automatic.\n\nEligible foreign nationals must request the interim authorization to work using the IRCC Web form. When the Client Support Centre transfers the incoming web forms, officers should see one of the following messages from the applicant in the IRCC Web form. This will flag that the request is to be considered under this public policy."
    },
    {
      "heading": "Example of template provided in public instructions",
      "heading_path": [
        "Public policy allowing certain visitors in Canada to apply for an employer-specific work permit",
        "Example of template provided in public instructions"
      ],
      "anchor": "#example-of-template-provided-in-public-instructions",
      "text": "**Message for previous work permit holders requesting interim authorization to work**\n\nPriority Code **visit2work 2020**: I am requesting consideration under the **Temporary Public Policy to Exempt Certain Visitors in Canada from Immigration Requirements** and ask that the applicable exemptions be granted until a decision is made on my work permit application or it is withdrawn.\n\nMy previous work permit number U######### expired on [Date].\n\nI have submitted my application for a work permit online. **or** I have submitted my application on paper and the postal/courier tracking number is number.\n\nI intend to work for [employer name] / [occupation] as specified in the aforementioned work permit application.\n\nI understand that providing false, misleading or incorrect information is a violation of the Immigration and Refugee Protection Act and may result in enforcement measures against me.\n\nProcessing of public policy requests\n------------------------------------"
    },
    {
      "heading": "Step 1: Receipt of IRCC Web form",
      "heading_path": [
        "Public policy allowing certain visitors in Canada to apply for an employer-specific work permit",
        "Example of template provided in public instructions",
        "Step 1: Receipt of IRCC Web form"
      ],
      "anchor": "#step-1-receipt-of-ircc-web-form",
      "text": "On receipt of the IRCC Web form, the Client Support Centre (CSC) will separate these requests and move them to a specific folder for the Centralized Network (CN) to access.\n\nCSC may use the following key word to auto-triage requests under this specific public policy: **visit2work 2020**.\n\nCSC agents will not be reviewing or responding to the incoming Web forms to ensure compliance with the public policy. They will simply move the Web forms to the appropriate email folder for CN to assess."
    },
    {
      "heading": "Step 2: Assessment under the public policy",
      "heading_path": [
        "Public policy allowing certain visitors in Canada to apply for an employer-specific work permit",
        "Example of template provided in public instructions",
        "Step 2: Assessment under the public policy"
      ],
      "anchor": "#step-2-assessment-under-the-public-policy",
      "text": "There is a 30 business day service standard for assessment of requests under the public policy. Officers should review the public policy consideration request to determine if all of the following apply:\n\n1. there is a request for assessment under this public policy\n2. the request has sufficient information to find the work permit application in the Global Case Management System (GCMS)\n3. the applicant previously held a work permit in the 12 months preceding the application\n\nThe following are the applicable procedures if the public policy\n\n* [request is not complete](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/foreign-workers/visitor-work-permits.html#sec62_1)\n* [request is complete](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/foreign-workers/visitor-work-permits.html#sec62_2)\n* [request does not meet eligibility requirements](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/foreign-workers/visitor-work-permits.html#sec62_3)"
    },
    {
      "heading": "Public policy request is not complete",
      "heading_path": [
        "Public policy allowing certain visitors in Canada to apply for an employer-specific work permit",
        "Example of template provided in public instructions",
        "Step 2: Assessment under the public policy",
        "Public policy request is not complete"
      ],
      "anchor": "#public-policy-request-is-not-complete",
      "text": "The processing officer may send **a rejection notice** if the IRCC Web form does **not** include any of the following:\n\n* a request for assessment\n* sufficient information to confirm the receipt of an employer-specific work permit application\n* an indication that the applicant held a work permit in the preceding 12 months\n* evidence that the applicant is no longer in Canada\n\nThe rejection notice should use the following template. It is recommended that this simply be a reply to the incoming IRCC Web form request. Officers should attach the incoming request in GCMS under Incoming Correspondence or as a case note.\n\n**Rejection notice template [delete paragraphs that do not apply]**\n\nI have reviewed the information provided in your IRCC Web form request.\n\n[You did not submit a request for consideration under the **Temporary Public Policy to Exempt Certain Visitors in Canada from Immigration Requirements.**]\n\nand\n\n[You have not provided sufficient information to confirm that you have submitted an application for an employer-specific work permit, which is required for eligibility for the public policy.]\n\nand\n\n[You did not provide information on your previous work permit that was valid in the last 12 months.]\n\nYou may submit a request by following the instructions to [Apply online under a public policy](https://www.canada.ca/en/immigration-refugees-citizenship/services/work-canada/work-permit/apply.html).\n\n**Important:** The officer should ensure that the rejection notice is entered in the case notes of the application. If the officer is unable to find the new work permit application but can find the client in GCMS, a client note with the submission and the response should be added."
    },
    {
      "heading": "Public policy request is complete",
      "heading_path": [
        "Public policy allowing certain visitors in Canada to apply for an employer-specific work permit",
        "Example of template provided in public instructions",
        "Step 2: Assessment under the public policy",
        "Public policy request is complete"
      ],
      "anchor": "#public-policy-request-is-complete",
      "text": "If the request has all 3 requirements, the processing officer should then review the documentation in the work permit application to determine if the application is complete and a final decision can be rendered."
    },
    {
      "heading": "Public policy eligibility not met: requester has not submitted an employer-specific work permit application",
      "heading_path": [
        "Public policy allowing certain visitors in Canada to apply for an employer-specific work permit",
        "Example of template provided in public instructions",
        "Step 2: Assessment under the public policy",
        "Public policy eligibility not met: requester has not submitted an employer-specific work permit application"
      ],
      "anchor": "#public-policy-eligibility-not-met-requester-has-not-submitted-an-employer-specific-work-permit-application",
      "text": "If on review of the work permit application it is determined that the foreign national is not applying for an employer-specific work permit, the request **does not** meet the eligibility requirements. The officer may choose not to process the application on a priority basis and may refuse the public policy request using the template for a [Negative public policy decision](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/foreign-workers/visitor-work-permits.html#sec63_3).\n\n**Important:** A case note should be added to GCMS on the work permit application with the request and response."
    },
    {
      "heading": "Step 3: Work permit application",
      "heading_path": [
        "Public policy allowing certain visitors in Canada to apply for an employer-specific work permit",
        "Example of template provided in public instructions",
        "Step 3: Work permit application"
      ],
      "anchor": "#step-3-work-permit-application",
      "text": "The following are the applicable procedures if the\n\n* [work permit application is not complete](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/foreign-workers/visitor-work-permits.html#sec63_1)\n* [work permit application is complete](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/foreign-workers/visitor-work-permits.html#sec63_4)"
    },
    {
      "heading": "Work permit application is not complete",
      "heading_path": [
        "Public policy allowing certain visitors in Canada to apply for an employer-specific work permit",
        "Example of template provided in public instructions",
        "Step 3: Work permit application",
        "Work permit application is not complete"
      ],
      "anchor": "#work-permit-application-is-not-complete",
      "text": "If the work permit application is incomplete, other than biometric enrolment, the processing officer will request the additional documentation and give the applicant 30 days to respond.\n\nThey will **also provide** either a positive or a negative public policy assessment decision as a reply to the IRCC Web form email and add a case note on their decision.\n\nThe following are the applicable procedures in the case of a\n\n* positive public policy decision\n* negative public policy decision"
    },
    {
      "heading": "Positive public policy decision",
      "heading_path": [
        "Public policy allowing certain visitors in Canada to apply for an employer-specific work permit",
        "Example of template provided in public instructions",
        "Step 3: Work permit application",
        "Positive public policy decision"
      ],
      "anchor": "#positive-public-policy-decision",
      "text": "If the request meets the eligibility requirements, the officer will send the following response:\n\nAs per the information provided in your request below, you have been deemed to meet the eligibility criteria under the Temporary Public Policy to Exempt Certain Visitors in Canada from Immigration Requirements.\n\n**Please print a copy of this email and attach it to your existing work permit or authorization to work as proof of ability to work** for your stated employer or occupation until a determination is made on your current work permit application or it is withdrawn.\n\nPlease note that misrepresenting or withholding material facts relating to a relevant matter that causes an error in decision is a violation of the Immigration and Refugee Protection Act."
    },
    {
      "heading": "Negative public policy decision",
      "heading_path": [
        "Public policy allowing certain visitors in Canada to apply for an employer-specific work permit",
        "Example of template provided in public instructions",
        "Step 3: Work permit application",
        "Negative public policy decision"
      ],
      "anchor": "#negative-public-policy-decision",
      "text": "If the request does **not** meet the eligibility requirements, the officer will send the following response to the IRCC Web form email. The processing officer should delete any requirement that doesn’t apply to the specific request.\n\nI have assessed your request under the Temporary Public Policy to Exempt Certain Visitors in Canada from Immigration Requirements.\n\nYour request for consideration under this public policy has been refused as you do not meet at least one of the eligibility criteria for the public policy, in that\n\n* you do not have current temporary resident status in Canada\n* you are not applying for an employer-specific work permit\n* you have not held a work permit in the 12 months preceding your application for a work permit\n* you have not requested that the public policy exemptions be applicable until a decision is made on your work permit application or it is withdrawn\n* you have left Canada"
    },
    {
      "heading": "Work permit application is complete",
      "heading_path": [
        "Public policy allowing certain visitors in Canada to apply for an employer-specific work permit",
        "Example of template provided in public instructions",
        "Step 3: Work permit application",
        "Work permit application is complete"
      ],
      "anchor": "#work-permit-application-is-complete",
      "text": "If application is complete, the processing officer will finalize the work permit application and send the final decision (positive or negative) to the applicant. No further action on the public policy request is needed.\n\n**Important**: Applicants under this public policy are not subject to the prohibition on issuance of a work permit if the applicant worked without authorization [R200(3)(e)]. This prohibition has been waived as part of the public policy.\n\n**If the decision on the work permit is to refuse the application**, the processing officer should indicate in the refusal letter that the public policy assessment is also refused because a decision has been made on their application.\n\n**In addition to the refusal reasons for the work permit**, officers should enter the following under the “Other” refusal reason: Your request for consideration under the public policy is also refused as you do not meet the eligibility requirements.\n\nPage details\n------------\n\n 2024-10-03"
    }
  ],
  "links": {
    "outbound": [
      "https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/foreign-workers/visitor-work-permits.html",
      "https://www.canada.ca/en/immigration-refugees-citizenship/services/work-canada/work-permit/apply.html"
    ],
    "internal_children": []
  },
  "quality": {
    "is_toc_like": false,
    "is_low_text": false,
    "notes": []
  }
}