{
  "file": "/workspaces/legalnew/manuals/enf08-eng.pdf",
  "page_count": 38,
  "pages": [
    {
      "page": 1,
      "chars": 2479,
      "text": "ENF 8 Deposits and Guarantees \n2020-10-07 \n \n \n1 \n \n \n \n1 \nWhat this chapter is about……………………..…………………………..…….... \n  3 \n2 \nProgram objectives…………………………………………………………………. \n  3 \n3 \nThe Act and Regulations…………………………………………………………… \n  3 \n4 \nDefinitions…………………………………………………………………………….. \n  6 \n5 \nForms…………………………………………………………………………………... \n  7 \n6 \nDelegation and Designation Instruments………………………………………... \n  8 \n7 \nDepartmental Policy…………………………………………………………………. \n  9 \n \n7.1 Deposits and guarantees………………………………………………………....      9 \n \n7.2 General requirements…………………………………………………………….. \n10 \n8 \nProcedures…………………………………………………………………………….. \n13 \n \n8.1 General……………………………………………………………………………... \n13 \n \n8.2 Receiving Orders for Release from the Immigration Division (ID) or delegated \nofficer………………………………………………………………………………….… \n15 \n \n8.3 Modifications of conditions of release…………………………………………... \n15 \n \n8.4 Surrendered passports and other documents…………………………………. \n16 \n \n8.5 Deposits – General……………………………………………………………..… \n16 \n \n8.6 Ability to ensure person concerned will comply with deposit conditions……. \n17 \n \n8.7 Establish identity of depositor……………………………………………………. \n17 \n \n8.8 Acceptable forms of payment for deposits……………………………………... \n18 \n \n8.9 Taking the deposit………………………………………………………………… \n18 \n \n8.10 Altering or amending a deposit…………………………………………………. \n21 \n \n8.11 Guarantees – General…………………………………………………………... \n22 \n \n8.12 Ability to ensure the person concerned will comply with conditions of \nguarantee………………………………………………………………………………. \n22 \n \n8.13 Establish identity of guarantor…………………………………………………. \n24 \n \n8.14 Determining solvency for guarantors………………………………………….. \n25 \n  \n8.15 Taking a guarantee……………………………………………………………… \n28 \n   \n8.16 Altering or amending a guarantee……………………………………………... \n28 \n \n8.17 Rejecting a deposit or guarantee………………………………………………. \n29 \n \n8.18 Stay of removal order…………………………………………………………… \n30 \n \n8.19 Withdrawal, refund and forfeiture of a deposit or enforcement of a \nguarantee………………………………………………………………………………. \n30 \n \n8.20 Requests for information………………………………………………………... \nAppendix A:  Sample letter— Notification to Bondsperson re: Refund of Security \nDeposit…………………………………………………………………………………….   \nAppendix B:  Sample letter— Notification to Bondsperson re: Refund of Security \ndeposit and cancellation of performance bond………………………………………. \nAppendix C:  Sample letter— Notification to Guarantor re: Cancellation of \nPerformance Bond……………………………………………………………………….  \n \n35 \n \n36 \n37 \n \n38 \n \n \n"
    },
    {
      "page": 2,
      "chars": 1608,
      "text": "ENF 8 Deposits and Guarantees \n2020-10-07 \n \n \n2 \nUpdates to chapter  \nListing by date:  \n2020-10-07 \n \nSections 3 and 8 have been updated to reflect regulatory changes, including the addition of prescribed \nfactors for consideration under subsection 47(4) of the Immigration and Refugee Protection Regulations. \nUpdates have also been made to reflect new BSF Acknowledgement of conditions form. Content has \nbeen updated to include sample form letters. Minor changes and clarifications have been provided \nthroughout the chapter.    \n \n \n2017-05-15 \nSubstantive and minor changes, as well as clarifications, have been provided throughout the chapter. \n2007-02-01 \nChanges have been made to Section 7.8 and a paragraph has been deleted. In addition, the title of the \nMinister of Public Safety and Emergency Preparedness has been changed to Minister of Public Safety.  \n2005-11-08  \nChanges have been made throughout chapter ENF 8 to reflect the change in responsibilities as a result of \nthe CIC/CBSA transition. All previous versions should be discarded.  \nOf particular note are the following modifications: \n \nchanges have been made throughout this chapter to reflect accurate officer titles within the CBSA \nand CIC.  \n \nsection 4, Instruments and delegations, outlines specific roles and authorities of CIC and CBSA \npersonnel.  \n2004-11-04 \nEditorial modifications have been made throughout this chapter. All previous versions should be \ndiscarded.  \n2004-01-15  \nThe chapter’s name has been changed to “Deposits and Guarantees” to better reflect the terminology of \nIRPA and its Regulations.  \n \n \n"
    },
    {
      "page": 3,
      "chars": 2591,
      "text": "ENF 8 Deposits and Guarantees \n2020-10-07 \n \n \n3 \n1 What this chapter is about  \n \nThis chapter provides functional guidance to the Canada Border Services Agency (CBSA), both at the \nPort of Entry and Inland, as well as Immigration, Refugees and Citizenship Canada (IRCC) officers, \nmanagers and others with the delegated and designated authority to impose the payment of deposits and \nthe posting of guarantees in respect of persons seeking entry to Canada, and permanent residents and \nforeign nationals who are the subject of an inadmissibility report, an admissibility hearing, or a removal \norder.  \n \n \n2 Program objectives  \n \nThe use of deposits and guarantees, also referred to as “bonds”, in the Canadian immigration program is \nintended to: \n \n \nensure that persons seeking temporary entry comply with any conditions that may be imposed on \nthem under the Immigration and Refugee Protection Act (IRPA) and the Immigration and Refugee \nProtection Regulations (IRPR);  \n \n \nensure that persons subject to an inadmissibility report, an admissibility hearing or a removal \norder comply with any conditions that may be imposed under the IRPA and IRPR; and  \n \n \nallow the release of a person held in immigration detention, based on that person's agreement to \nabide by any conditions of release, to ensure compliance with the IRPA and IRPR.  \n \n \n3 The Act and Regulations  \n \nThis part of the chapter provides a guide to the IRPA and IRPR provisions concerning deposits and \nguarantees, for officers’ reference. \nIRPA – Deposits and guarantees  \nSection  \nThe authority to make Regulations regarding conditions \nthat may be imposed on permanent residents and foreign \nnationals and Regulations governing deposits or \nguarantees for the performance of obligations imposed \nA14(2)  \nA14(2)(d) \nA14(2)(f) \nAuthority for a CBSA or IRCC officer or the Immigration \nDivision to impose conditions including the payment of a \ndeposit or posting of a guarantee for compliance with \nconditions imposed by a CBSA or IRCC officer or the \nImmigration Division on a permanent resident or foreign \nnational who is the subject of a report, an admissibility \nhearing or, being in Canada, a removal order \nA44(3)  \nAuthority for a CBSA officer to order the release from \ndetention before the first detention review of a permanent \nresident or foreign national on payment of a deposit or \nposting of a guarantee, if required, for compliance with the \nconditions imposed \nA56  \nAuthority for the Minister to order the release on request \nof a Designated Foreign National aged 16 or older from \nA58.1 \n"
    },
    {
      "page": 4,
      "chars": 2328,
      "text": "ENF 8 Deposits and Guarantees \n2020-10-07 \n \n \n4 \ndetention and to impose any conditions, including the \npayment of a deposit or the posting of a guarantee for \ncompliance with the conditions deemed necessary. \nNote: This authority is not currently delegated, but is held \nby the Minister of Public Safety. \nAuthority for the Immigration Division to impose conditions \nof release on a permanent resident or foreign national, \nincluding the payment of a deposit or the posting of a \nguarantee for compliance with the conditions \nA58(3)  \nAuthority to collect monies that a person has agreed to \npay as a deposit or guarantee of performance is a debt \ndue to the Crown \nA145(1) \nA145(1)(b) \nAuthority to certify debts due that have not been paid, if \neither the Minister of Immigration, Refugees and \nCitizenship (IRCC) or the Minister of Public Safety is of \nthe opinion that the person liable for the amount is \nattempting to avoid payment, or on the expiration of 30 \ndays after the default \nA146(1) \nA146(1)(a) \nA146(1)(b) \nThe certificate, when filed and registered in the Federal \nCourt, has the same force and effect, and all proceedings \nmay be taken, as if the certificate were a judgment \nobtained for a debt of the amount specified in the \ncertificate plus interest to the day of payment \nA146(2) \nAuthority to recover costs of registering the certificate  \nA146(3) \nAuthority for the Minister to garnish all or part of a debt \ndue to the Crown, if the Minister is of the opinion that a \nthird person is or is about to become liable to make a \npayment to a person liable to make a payment under \nIRPA \nA147  \nIRPR – Deposits and guarantees  \nSection  \nAuthority for an officer to require a deposit or guarantee in \nrespect of a person or group of persons seeking entry to \nCanada for compliance with conditions imposed \nR45(1)  \nOfficers are to fix the amount of the deposit or guarantee \non the basis of the following factors: \n \n \nthe financial resources of the person or group; \n \nthe obligations that result from the conditions \nimposed; \n \nthe costs likely to be incurred to locate and arrest \nthe person or group, detain them, hold an \nadmissibility hearing and remove them from \nCanada; and \n \n \nthe costs likely to be incurred to enforce a \nguarantee \nR45(2)  \nR45(2)(a) \nR45(2)(b) \n \nR45(2)(c) \nR45(2)(d) \n"
    },
    {
      "page": 5,
      "chars": 2114,
      "text": "ENF 8 Deposits and Guarantees \n2020-10-07 \n \n \n5 \nA person who pays a deposit or posts a guarantee:  \n \n \nmust not have signed or co-signed another \nguarantee that is in default; and \n \n \nmust have the capacity to contract in the province \nwhere the deposit is paid or the guarantee is \nposted \nR47(1) \nR47(1)(a) \nR47(1)(b) \nA person who posts a guarantee must:  \n \n \nbe a Canadian citizen or a permanent resident, \nphysically present and residing in Canada; \n \n \nbe able to ensure that the person or group of \npersons in respect of whom the guarantee is \nrequired will comply with the conditions imposed; \nand \n \n \npresent to an IRCC or CBSA officer evidence of \ntheir ability to fulfill the obligation arising from the \nguarantee \nR47(2)  \nR47(2)(a) \n \nR47(2)(b) \n \nR47(2)(c) \nMoney illegally obtained: \n \nIf a CIC or CBSA officer believes a sum of money offered \nas a deposit, or a sum of money that a person may be \nobliged to pay under a guarantee was, or would not be \nlegally obtained, the CIC or CBSA officer shall not allow \nthat person to pay a deposit or post a guarantee \n \nR47(3)  \nFactors to consider \n \nAn officer, the Immigration Division or the Minister must \nconsider the following factors in assessing whether the \nperson who posts a guarantee has the ability to ensure \nthat the person or group of persons in respect of whom \nthe guarantee is required will comply with the conditions \nimposed: \n(a) their relationship to the person or group of persons in \nrespect of whom the guarantee is required; \n(b) their financial situation; \n(c) any previous history posting a guarantee; \n(d) their criminal record; and \n(e) any other relevant factor in determining their ability to \nensure that the person or group of persons in respect of \nwhom the guarantee is required will comply with the \nconditions imposed. \nR47(4) \nMandatory conditions to be imposed on the person or \ngroup of persons in respect of which a guarantee is \nrequired:  \n \n \nprovide the IRCC or CBSA with the address of \nthe guarantor and advise the IRCC or CBSA \nbefore any change in that address; and \n \nR48(1) \n \nR48(1)(a) \n"
    },
    {
      "page": 6,
      "chars": 2034,
      "text": "ENF 8 Deposits and Guarantees \n2020-10-07 \n \n \n6 \n \nappear at time and place required by an IRCC or \nCBSA officer or the ID to comply with any \nobligation imposed under IRPA \n \nR48(1)(b) \nMandatory conditions to be imposed on the person or \ngroup of persons in respect of which a deposit is required: \n \n \nprovide address and change of address \n \n \nappear at time and place required to comply with \nan obligation imposed \nR48(2)  \n \nR48(2)(a) \nR48(2)(b) \nMandatory written acknowledgment required from the \nperson who pays a deposit or posts a guarantee: \n \n \nthat they have been informed of the conditions \nimposed; and \n \nThat they have been informed that non-\ncompliance with any conditions imposed will \nresult in forfeiture of the deposit or enforcement \nof the guarantee \nR49(1)  \nR49(1)(a) \nR49(1)(b) \nRequirement on officer to issue a receipt to the depositor \nand guarantor for the deposit or a copy of the guarantee, \nand a copy of the conditions imposed \nR49(2) \nRequirement of the IRCC or CBSA to return the deposit \npaid after an officer notifies the IRCC or CBSA of  \ncompliance with conditions imposed \nR49(3) \nSum of money deposited is forfeited, and guarantee \nbecomes enforceable on the failure of the person or any \nmember of group to comply with any condition imposed \nR49(4)  \n \n \n4. Definitions  \nBond \nDeposits and guarantees paid or posted to ensure compliance of \nthe person concerned with IRPA conditions. \n \nBondsperson \nThe depositor or guarantor who paid or posed a deposit or \nguarantee to ensure compliance of the person concerned with \nIRPA conditions. This term is generic and refers to both depositors \nand guarantors. \n \nCash Bond  \nA cash bond is a deposit. \n \nDepositor \nThe person who pays a deposit to ensure compliance by the \nperson concerned or the group with conditions imposed under \nIRPA or IRPR. \n \nDeposit \nThe payment of a sum of money by a person to the Receiver \nGeneral for Canada for compliance with the conditions imposed on \nthe person concerned’s release from detention. \n \n"
    },
    {
      "page": 7,
      "chars": 2574,
      "text": "ENF 8 Deposits and Guarantees \n2020-10-07 \n \n \n7 \nForfeiture / Forfeit \n \nThe relinquishment of the deposit as a consequence of a breach of \nconditions.  \n \nGuarantee \nA guarantee is an written enforceable undertaking by a third party \n(the guarantor) that the person concerned will abide by the \nconditions imposed by a CBSA or IRCC officer or the Immigration \nDivision and to forfeit or pay a sum of money to the Crown if the \nperson concerned breaches any conditions. The guarantor and the \nperson concerned must both agree to the conditions. They are also \ncalled “performance bonds”. \n \nGuarantee in default \nA guarantee is in default when a formal demand for payment of the \namount guaranteed has been made to the guarantor and the \namount has not yet been paid or otherwise extinguished. \n \nGuarantor \nThe person who posts a guarantee with IRCC or the CBSA to \nensure compliance with conditions imposed under IRPA or IRPR \non the person concerned. \n \nPerformance Bond \nA performance bond has the same meaning as the term \n“guarantee”. \n \nPerson concerned \nThe foreign national or permanent resident or the group of persons \non whom conditions are imposed by an IRCC or CBSA officer or \nthe Immigration Division and who is the subject of the deposit or \nguarantee. \n \nPower of Attorney  \n \nA legal document signed by a person to authorize another person \n(the “attorney”) to act on their behalf in respect of all or some of \ntheir finances and property. The “attorney” does not need to be a \nlawyer.  The document must have been issued in accordance with \nthe laws of the province where it was signed. \n \nLiquid funds  \nCash or any investment that can easily and quickly be converted to \ncash (e.g. money in personal accounts; stocks and bonds).  \n \nReasonable grounds to believe \nCredible evidence that would produce in a normally prudent and \ninformed person bona fide belief in a serious possibility. They are \nnot mere suspicions. \n \nSecurity deposit \nThis term has the same meaning as that for “deposit”. \n \n \n \n5. Forms  \n \nAll forms required for the processing of a deposit or guarantee are listed below and are accessible on \nIRCC Connexion under Forms or on CBSA Atlas under Forms and Templates.  \n \nForms used for deposits and guarantees are generally IMM forms for historical reasons as the authority to \nperform most functions relating to deposits and guarantees is delegated to both IRCC and CBSA officers. \nHowever, some IMM forms now have BSF equivalents. Where an IMM form has a BSF equivalent, CBSA \nofficers shall use the BSF form for the action. \n \n"
    },
    {
      "page": 8,
      "chars": 2114,
      "text": "ENF 8 Deposits and Guarantees \n2020-10-07 \n \n \n8 \nTitle  \nNumber  \nAcknowledgement of Conditions - The Immigration and \nRefugee Protection Act  \nBSF821  \nAmendment to Guarantee for Compliance Issued  \n IMM 5071B  \nGuarantee of Compliance Enforcement Notice  \nIMM 5072B \nGuarantee Bond – The Immigration and Refugee \nProtection Act  (Where there are Co-Signers)  \nPerformance Bond – The Immigration and Refugee \nProtection Act  (Where there are Co-Signers) \nBSF507E \n \nIMM 1259E  \nGuarantee Log  \nIMM 5073B  \nPerformance Bond  – The Immigration and Refugee \nProtection Act  (Guarantee) \nIMM 1230E  \nRequest for a Security Deposit pursuant to R45(1)  \n(at the port of entry only) \nBSF517E \nRequisition for Enforcement of Guarantee  \nImmigration and Refugee Protection Act and Regulations  \nIMM 5345B  \nRequisition for Refund / Forfeiture of Security Deposit  \nIMM 0709B*  \nSecurity Deposit  \n(this form is also the official receipt for deposits) \nBSF579*  \nSolemn Declaration of Solvency by Guarantor  \nBSF564  \nFinancial information related to deposits or guarantees \nassessed during the detention review process \nBSF211 \n* Multiple copy form that must be completed manually.  Online version of this form in Atlas/ \nConnexion is a sample only \n \n6 Delegation and Designation Instruments  \n \nOfficers should refer to the most recent version of the Delegation of Authority and Designation of Officers \nby the Minister of Public Safety and Emergency Preparedness under the Immigration and Refugee \nProtection Act (IRPA) and the Immigration and Refugee Protection Regulations (IRPR) on CBSA Atlas \nand IRCC Connexion to ensure that only delegated and designated officers exercise the authority \nassociated to the functions related to deposits and guarantees.  \n \nImmigration and Refugee Protection Act (IRPA) \n \nDelegated authority \nCBSA and IRCC officers designated as per \ninstruments of delegation \n \nMay require a deposit or a guarantee, or \nboth, for compliance with conditions \nimposed on the release from detention of a \nforeign national or permanent resident who \nis the subject of a report, an admissibility \n"
    },
    {
      "page": 9,
      "chars": 2124,
      "text": "ENF 8 Deposits and Guarantees \n2020-10-07 \n \n \n9 \nhearing, or, in Canada, a removal order. \n[A44(3)] \n \nCBSA officers designated as per the instruments \nof delegation \nMay order, before the first detention review \nby the Immigration Division, the release \nfrom detention of a person and impose \nconditions, including the payment of a \ndeposit or the posting of a guarantee for \ncompliance with the conditions [A56]. \n \nCBSA, IRCC and Canada Revenue Agency \nheadquarters officials as per the instruments of \ndelegation \n \nMay certify an amount or part of an amount \npayable under IRPA as debts due to Her \nMajesty; may order payment to the \nReceiver General [A146]. \nCBSA headquarters staff as per the instruments \nof delegation \n \nMay garnish all or part of a debt due to the \nCrown, if the Minister is of the opinion that a \nthird person is or is about to become liable \nto make a payment to a person liable to \nmake a payment under IRPA [A147]. \nImmigration and Refugee Protection Regulations (IRPR) \nCBSA and IRCC officers as per instruments of \ndelegation \n \nMay require a deposit or guarantee in \nrespect of a person or group seeking to \nenter Canada for compliance with \nconditions imposed [R45(1)]. \n \nMay fix the amount of the deposit or \nguarantee [R45(2)]. \n \nMay refuse to allow a person to pay a \ndeposit or post a guarantee [R47(3)]. \n \nShall impose mandatory conditions when \ndeposit or guarantee required [R48]. \n \nShall issue a receipt for the payment of a \ndeposit or a copy of the guarantee, and a \ncopy of the conditions imposed [R49(2)]. \n \n7 Departmental policy  \n \n7.1 Deposits and guarantees  \n \nThe purpose of requiring deposits and guarantees (collectively referred to as bonds) under the IRPA or \nIRPR is to motivate the person concerned or group to comply with the conditions imposed which are \nintended to ensure that they will appear at the next required IRPA proceeding. They also serve as an \nincentive for the bondsperson to ensure compliance. \n \nCBSA or IRCC officers may request the payment of a deposit or the posting of a guarantee, or both, \nunder the following circumstances: \n \n"
    },
    {
      "page": 10,
      "chars": 3383,
      "text": "ENF 8 Deposits and Guarantees \n2020-10-07 \n \n \n10 \n \nAt a port of entry, a CBSA officer may require a person or group of persons seeking to enter \nCanada to pay a deposit or post a guarantee, or both, for compliance with any conditions \nimposed [R45(1)]. (For the purpose of this section a group of persons refers to a group of persons \nsuch as an entertainment group coming to Canada for the same purpose. This section is not \nmeant to apply to several different individuals believed to be part of an organized smuggling ring. \nIn scenarios such as this, the requirement for a security deposit or guarantee should be assessed \non an individual basis.) \n \n \nAt a port of entry or inland office, a CBSA or IRCC officer may impose conditions and require a \npermanent resident or foreign national who is the subject of an inadmissibility report, admissibility \nhearing or a removal order to pay a deposit or post a guarantee. [A44(3)].                                \n \nNote: the delegated authority to impose conditions on permanent residents is at supervisory level \nor higher. \n \n \nWhere a permanent resident or foreign national has been detained pursuant to the IRPA or IRPR \nand a CBSA officer orders their release before the first detention review by the Immigration \nDivision, the CBSA officer may impose conditions and require that they pay a deposit or that a \nguarantee be posted [A56].  \n \n \nAt a detention review or admissibility hearing, a CBSA Hearings Officer may request the \nImmigration Division to impose conditions, including the requirement to pay a deposit or post a \nguarantee, on a foreign national or permanent resident prior to ordering they be released from \ndetention [A58(3)].  \n \n \n7.2 General requirements  \n \nNote: for procedures, refer to Part 8. \n \nThe following requirements apply to deposits and guarantees: \n \n7.2.1 Delegated Officers \n \n \nWhen imposing the requirement to pay a deposit or post a guarantee under A44(3) or A56, \ndelegated officers are responsible to ensure that a person who pays a deposit (depositor) or \nposts a guarantee (guarantor) meets the regulatory requirements. The officers should thoroughly \nassess any potential bondsperson who offers to pay a deposit or post a guarantee and, where \nthat person does not satisfy the regulatory requirements, they shall not be permitted to pay a \ndeposit or post a guarantee. \n \n \nOnly delegated officers may make decisions regarding deposits and guarantees, including the \nassessment of whether the person proposing to post a deposit or guarantee meets any regulatory \nrequirements and is otherwise suitable.  \n \n7.2.2 Immigration Division (ID)  \n \n \nThe Immigration Division (ID) may, at detention review, order the person concerned released \npending continuation of an examination, an admissibility hearing, or removal, and may impose \nconditions, including the payment of a deposit or a guarantee. \n \n \nInland Enforcement Officers may provide valuable input concerning specific requirements under \nR47 (e.g. the proposed bondsperson is in default of a previous guarantee; money offered as a \ndeposit was not legally obtained, the proposed bondsperson is not a Canadian citizen or \npermanent resident, not physically present and residing in Canada; the proposed bondsperson is \nnot able to ensure that the person concerned will comply with conditions, etc.) or if a proposed \n"
    },
    {
      "page": 11,
      "chars": 4132,
      "text": "ENF 8 Deposits and Guarantees \n2020-10-07 \n \n \n11 \nresidential address for the release is of concern. In these cases, Inland Enforcement Officers \nshould articulate their concerns to the Hearings Officer who can address them with the ID. \n \n \nDuring a detention review when counsel presents an alternative to detention involving a \nbondsperson, the ID and Hearings Officers will assess the suitability of the bondsperson by \nquestioning them about their relationship with the person concerned, their knowledge of the \nperson concerned’s immigration status and, if applicable, criminal history, potential \nbondsperson’s income, assets, their ability to pay a cash deposit or fulfill the obligation from the \nguarantee, their living situation, their willingness to provide shelter to the person concerned and \ntheir ability to ensure the person concerned will comply with conditions imposed on their release. \nIn this context, the ID is also required to assess the factors for consideration prescribed under \nR47(2)(d) with respect to persons coming forward as potential guarantors.   \n \n \nIf release on conditions including a requirement of a deposit or guarantee is warranted, the \nImmigration Division will name the bondsperson and set the amount of the deposit or guarantee \nrequired. \nNote: Generally, ability to pay and solvency are not assessed during detention review as \ndocuments from guarantors may not be available and/or there is insufficient time to do so. A \nbondsperson may sometimes be proposed before a detention review which may lead to the \nassessment of the ability to pay or solvency being done during the detention review process  \n \n \nIf a Hearings Officer has assessed the ability of the bondsperson to pay a cash deposit and/or \nfulfil his/her obligation from a guarantee, and the Hearings Officer is satisfied that the \nbondsperson has the ability to pay the cash deposit and/or fulfil the guarantee, the Hearings \nOfficer will document this information on form BSF211.  In those instances, Inland Enforcement \nOfficers may not re-assess the ability to pay or the solvency of the named bondsperson when \nthey seek to pay the deposit or post the guarantee (refer to section 8.14 Determining Solvency for \nGuarantors for further details). This is subject to the following exceptions: \n \n \nOfficers uncover information after the fact that the bondsperson has signed or co-\nsigned another guarantee that is in default; \n \nOfficers uncover after the fact that the bondsperson does not have the capacity \nto contract in the province where the deposit is paid or the guarantee is posted; \nor \n \nOfficers uncover information after the fact that there are reasonable grounds to \nbelieve that a sum of money offered by the bondsperson to pay a cash deposit \nwas not legally obtained or a sum of money that the bondsperson is obliged to \npay under a guarantee was not legally obtained; \n \nThe Hearings Officer should communicate these exceptions to the tribunal, detainee and counsel.  \n \n \nGenerally, the suitability of a bondsperson is assessed during the detention review without \nassessing their ability to pay a cash deposit or to fulfil a guarantee as no evidence or insufficient \nevidence was presented during the detention review process on the financial situation of the \nbondsperson and/or there is insufficient time to do so. This may occur for instance in situations \nwhere the bondsperson was not proposed in advance of the detention review. In those cases, \nthe Hearings Officer should clearly indicate to the tribunal, the detainee, and counsel (if \napplicable), that another officer will determine whether the bondsperson has ability to pay the \ncash deposit and/or fulfil the guarantee before release can occur.  Hearings Officers may use \nBSF211 to provide comments to the officer who will be responsible to take the bond or if they \nwish to bring specific information to their attention.  \n \n \nOnce the ID has made a decision to release and specified conditions, an officer processing the \nbond has no legal authority to reject or change the conditions; however if the officer has specific \n"
    },
    {
      "page": 12,
      "chars": 2992,
      "text": "ENF 8 Deposits and Guarantees \n2020-10-07 \n \n \n12 \nconcerns regarding the deposit or guarantee requirements, the officer should communicate their \nconcerns to the Hearings Officer who can address them, if appropriate, with the ID.  \n \n7.2.3 Choice of deposit or guarantee: \n \n \nWhen the imposition of a deposit or guarantee is warranted, deposits are always preferred to \nguarantees, but a combination of both may be acceptable.  \n \n \nIf the person who will be paying a deposit or posting a guarantee has sufficient liquid funds (see \nDefinitions) for the amount of deposit deemed appropriate, a deposit should be required.  \n \n7.2.4 Minimum qualifications for bondspersons: \n \n \nBondspersons must not have signed or co-signed another guarantee that is in default [R47(1)(a)]; \nand  \n \n \nBondspersons must have the capacity to contract in the province where the deposit is paid or the \nguarantee posted [R47(1)(b)]. Bondspersons must not suffer from any serious mental disability \nthat would render them incapable of understanding the bond. In addition, they should be at the \nage of majority according to the law of the relevant province or older. \nNote: A guarantee that is “in default” means that a formal demand for payment of the amount \nguaranteed has been made to the guarantor and the amount owing has not yet been paid or \notherwise extinguished. Where a person concerned under a guarantee has breached conditions \nand no formal demand for payment of the guarantee has been issued, the guarantee is not in \ndefault and the guarantor would not be disqualified under R47(1)(a). \n \n \nGuarantors must be Canadian citizens or permanent residents, physically present and residing in \nCanada [R47(2)(a)]; and  \n \nNote: The requirement that the guarantor be a Canadian citizen or a permanent resident does not \napply to cash bonds. \n \n \nGuarantors must be able to ensure that the person concerned will comply with the conditions \nimposed. \n \n7.2.5 Conditions \n \n \nIt is imperative that the CBSA and IRCC officers ensure that the person concerned and the \nbondsperson understand the conditions of the deposit or guarantee and the repercussions for \nviolating the conditions.  \n \n \nThe bondsperson is required to acknowledge in writing (BSF579 for security deposits or \nBSF507E for guarantees) that they have been informed of the conditions imposed and that non-\ncompliance with any of the conditions will result in forfeiture of the deposit or enforcement of the \nguarantee [R49(1)]. \n \n \nCBSA Inland Enforcement Officers are normally responsible for monitoring of compliance of \nconditions for deposits and guarantees.  \n \n \nWhere the person concerned fails to comply with any of the conditions imposed, the deposit will \nbe declared forfeited or the guarantee will be enforced.  \n \n \nWhen the conditions under which the deposit or guarantee was posted are revoked or met, the \nobligation under the deposit or guarantee becomes null and void and the deposit shall be \nrefunded.  \n"
    },
    {
      "page": 13,
      "chars": 2943,
      "text": "ENF 8 Deposits and Guarantees \n2020-10-07 \n \n \n13 \n8 Procedures \n \n8.1 General \n \n8.1.1 Conditions in officer release cases where a bond is required \n \nIn addition to any other conditions, the following conditions shall be imposed on a person or a group of \npersons for whom a deposit or guarantee is required (the person concerned):  \n \n \nWhere a guarantee is being posted: \n \na) to provide IRCC or CBSA with the address of the guarantor; and to advise the appropriate \noffice before any change in that address [R48(1)(a)]; and  \n \nb) to present themselves at the time and place an IRCC or CBSA officer or the ID requires them \nto appear to comply with any obligation imposed on them under the IRPA. [R48(1)(b)].  \n \n \n \nWhere a deposit is being paid: \n \na) to provide IRCC or CBSA with their address; and to advise the appropriate office before a \nchange in that address [R48(2)(a)]; and  \n \nb) to present themselves at the time and place an IRCC or CBSA officer or the ID requires \nthem to appear to comply with any obligation imposed on them under the IRPA. \n[R48(2)(b)]. \n \nWhen a person is released by an officer from detention under a deposit or a guarantee with the condition \nto appear at an admissibility hearing, the bond will become void after the appearance of the person at the \nadmissibility hearing. To avoid this situation, the conditions of the deposit or guarantee should include the \nfollowing wording:  \n \n \nthat (name of person concerned) shall appear at the time and place required for the purpose of \nscheduling an admissibility hearing under the Immigration and Refugee Protection Act for \nadmissibility hearing, and at each subsequent sitting of such admissibility hearing, for removal, or \nwhenever required. \n \nAn immigration admissibility hearing is not terminated by the effect of a subject of a deposit or guarantee \ndeparting and seeking to re-enter Canada [Ravinder Kaur v. Minister of Employment and Immigration, \nFCA, Doc. No. A-295-84, September 25, 1984; Harnek Singh Grewal v. Minister of Employment and \nImmigration, FCA, Doc. No. A-42-80, May 7, 1980]:  \n a guarantee is valid if the person who is the subject of the guarantee has not violated any of the \nconditions; \n should the subject of a guarantee leave Canada and seek to re-enter to attend the continuation of \nthe immigration admissibility hearing, the CBSA officer at the port of entry (POE) should examine \nthe person to determine whether a new report and guarantee would be required; \n a guarantor may be liable for the amount of the guarantee.  \n \nWhen officers release a person concerned from detention on payment of a deposit or posting of \nguarantee they shall use the Acknowledgement of Conditions – the IRCC form] BSF821 to record any \nadditional conditions imposed. \n \nFor information on cases where the ID releases a person concerned and imposes a bond, see Part 7.2.2 \nabove, for policy and Part 8.2 below, for procedures. \n \n"
    },
    {
      "page": 14,
      "chars": 3413,
      "text": "ENF 8 Deposits and Guarantees \n2020-10-07 \n \n \n14 \n8.1.2 Amount of deposit and/or guarantee: \n \nThe amount of the deposit or guarantee is fixed by an officer in consideration of:  \n \n \nthe financial resources of the person concerned or group;  \n \nthe obligations resulting from the conditions imposed;  \n \nthe costs of enforcement should a condition be breached; and  \n \nthe costs that would be incurred to enforce a guarantee.   \n \nWhere risk of non-compliance with conditions is high (e.g. history of non-compliance, serious \ninadmissibility, etc.), a large deposit or guarantee may be a more appropriate incentive for compliance \nwith conditions.  \n \nWhere the risk of non-compliance with conditions is low, financial resources may be the main factor in \ndetermining amount. \n \nA smaller amount may be appropriate when: \n \n \ndetention has been for a prolonged period due to circumstances beyond the CBSA’s control \n(e.g. inability to obtain travel document where person concerned has cooperated, or inability to \nremove to certain countries due to country conditions) and the person concerned has been \ncooperative; or \n \n \nprospects of conclusion of the case are very limited in the short term due to reasons outside of \nthe control of the CBSA or IRCC and not due to the person concerned’s failure to cooperate \nwith the CBSA and IRCC. \n \n8.1.3 Illegally obtained money \n \nIf a CBSA or IRCC officer has reasonable grounds to believe (i.e. a belief based on credible evidence) \nthat a sum of money that a person would be obliged to pay as a deposit or under a guarantee was not or \nwould not be legally obtained, i.e. obtained in a manner in accordance with the law, the officer shall not \nallow that person to pay a deposit or post a guarantee [R47(3)].  \n \n \nFor the purposes of R47(3), illegally obtained money is money that has been either:  \n \na) obtained or derived directly or indirectly as a result of the commission of an offence in \nCanada; or \n \nb) by an act or omission that occurred outside Canada that was an offence in the place that it \noccurred and if it had occurred in Canada, would have also constituted an offence.  \n \nOfficers may seek out sources of additional information regarding the source of the money offered for the \ndeposit if further corroboration is needed. For example, a credible explanation from the bondsperson may \neither negate or justify the need for an officer to obtain further information. Additionally, the officer must \nuse discretion as to the severity of the circumstances and whether further enquires are warranted in the \ncircumstances. An example of this type of situation would be if a bondsperson is paying a $1,000 deposit \nor posting a $1,000 guarantee, the officer might make some enquiries and if reasonable answers are \nforthcoming, go no further; however if the bond is $20,000, the officer’s enquiries are expected to be more \nthorough because the amount would reasonably be more of a burden to the bondsperson. \n \nWhile one possible indicator of illegally obtained money is where the bondsperson indicates that they do \nnot file tax returns, it does not necessarily follow that their income was obtained in an illegal manner. For \nexample, if the bondsperson admits to not paying income tax, that does not necessarily equate to the \noffence of tax evasion; however if the bondsperson admits to the offence of tax evasion, the officer should \n"
    },
    {
      "page": 15,
      "chars": 3510,
      "text": "ENF 8 Deposits and Guarantees \n2020-10-07 \n \n \n15 \nnot accept the funds. If the bondsperson indicates that they do not pay taxes or file tax returns, officers \nshould engage in a more thorough inquiry to ensure that the money presented was not illegally obtained. \n \n8.1.4 Importance of fully documenting each process, decision and rationale  \n \nOfficers involved in the determination of whether to require a deposit or guarantee, or both; whether a \nproposed bondsperson is suitable; whether a breach of a condition has occurred; and whether forfeiture \nof the deposit or guarantee will be pursued must fully detail the reasons, including the factors considered, \nfor their recommendations and decisions on file. A rigorous approach to documenting actions and \ndecisions will assist others, including Hearings Officers and litigators, to understand and defend those \ndecisions.  \n \n8.2 Receiving Orders for Release from the Immigration Division (ID) or \ndelegated officer \n \nUpon receipt, the CBSA officer shall review the Order for Release which sets out the conditions of \nrelease. The Order for Release can prescribe release on: \n \n \na Cash Bond (deposit); \n \na Performance Bond (guarantee); \n \nan Acknowledgement of Conditions; or \n \na combination of any of the above.  \n \nWhere the Order for Release is to release on the Acknowledgement of Conditions only, officers shall \naction the Order immediately on receipt, provided there are no outstanding conditions to be satisfied such \nas the surrender of an identification or travel document. \n \nOfficers shall complete the Acknowledgement of Conditions [BSF821] in all cases, with the appropriate \nconditions, and have the person concerned sign it. The person concerned is given a copy and the original \nis placed on the client file with all associated release paperwork (copies of all bonds, bondsperson’s \nidentification documents, faxes, receipts, solemn declarations, applicable letters, proof of funds, \nconditions of release, the Authority to Release from Detention form, etc.) \n \nIf release is ordered by the ID, have the person concerned sign conditions of release specified by the ID.  \n \nWhere the person is to be released on the Acknowledgement of Conditions form plus the payment of a \ndeposit or the posting of a guarantee, officers shall comply with the procedures for deposits in Sections \n8.5 to 8.9, or for guarantees in Sections 8.11 to 8.15, as applicable. \n \n8.3 Modifications of conditions of release \n \nWhere release from detention was ordered by a CBSA officer under A56 before the first detention review, \na CBSA delegated officer may modify the conditions of release, including the deposit or guarantee.  \n \nWhere the conditions were imposed by the ID under A58, only the ID may modify the conditions it \nimposed. \n \nWhen a person concerned’s conditions of release from detention have been modified and there is an \nexisting deposit or guarantee, the bondsperson must be notified and agree to the modifications in order \nfor them to continue to be legally bound by the deposit or guarantee. If they do not agree, the conditions \nshould not be modified or if the modification is deemed necessary, a new deposit or guarantee shall be \nrequired if deemed appropriate in the circumstances for compliance with the conditions.  \n \nIn cases where modification of conditions are considered and it comes to light that the bondsperson \ncannot be notified as they are no longer at their last known address and the person concerned cannot \n"
    },
    {
      "page": 16,
      "chars": 3447,
      "text": "ENF 8 Deposits and Guarantees \n2020-10-07 \n \n \n16 \nprovide their current address, the person concerned has breached the mandatory condition imposed \nunder R48(1)(a) to advise the IRCC or the CBSA of changes in the address of the bondsperson. \nForfeiture may be considered and actioned, if deemed appropriate in the circumstances. Should the \ncondition modification be deemed necessary, a new deposit or guarantee shall be required. \n \n8.4 Surrendered passports and other documents \n \n \nWhere the surrender of the person concerned’s passport or other identity or travel document is \na condition of release, the passport or other document shall be placed in a Property Envelope, \nclearly marked with the person concerned’s name and GCMS Unique Client Identifier (UCI) and \nplaced on the case file. \n \n \nOfficers shall provide the person concerned with a Notice of Seizure of Identity Document(s) \nBSF698 form and update NCMS and GCMS with the information on the document seizure.  \n \n8.5 Deposits - General \n \nThe following guidelines apply to deposits (detailed procedures follow this section):  \n \n    A deposit is a sum of money required to ensure compliance by the person concerned with \nconditions imposed by an IRCC or CBSA officer or the ID under IRPA or IRPR. \n \n A deposit may be provided by the person concerned or by a third party. \n \n A depositor: \n \no must not have signed or co-signed a guarantee that is in default [R47(1)(a)]; and  \n \no must be of legal age with the capacity to contract in the province where the deposit is paid \n[R47(1)(b)]. This means that the depositor must not suffer from a serious mental disability that \nrenders them unable to understand the conditions of the deposit and other conditions. \n \nThe CBSA or IRCC officer should consider whether the person concerned, who is the subject of a \nremoval order, will likely be removed from Canada within a reasonable time.  \n \nWhen considering taking a deposit from the person concerned, CBSA and IRCC officers should consider \nwhether the amount of deposit is sufficiently high that the possibility of its forfeiture will motivate the \nperson concerned to comply with all conditions. If it is reasonably unlikely that the person concerned’s \ncompliance will be ensured by the potential loss of the deposit, officers may consider requiring that any \ndeposit be paid by a suitable third party. \n \nDeposits by the lawyer for the person concerned or group may be made “in trust” for their client and, as \nsuch, are a debt by the client to the lawyer. They should not be considered a deposit by a third party. The \nconsideration should be whether the requirement to pay that debt to the lawyer, should the deposit be \nforfeited, will be sufficient motivation for the person concerned or group to comply with the conditions. \n \nAlthough the IRPR does not require that the depositor be a Canadian citizen or a permanent resident, \nCBSA and IRCC officers taking a deposit from a third party should require that the depositor have legal \nstatus under IRPA and be physically present and reside in Canada, and be able to ensure that the person \nconcerned or group will comply with the conditions imposed if these requirements are deemed necessary \nin the circumstances to achieve the compliance objective of the deposit. \n \nIf the person concerned defaults on or breaches any of the conditions, legal proceedings may be taken to \nforfeit the deposit (see Part 8.19).  \n \n"
    },
    {
      "page": 17,
      "chars": 2466,
      "text": "ENF 8 Deposits and Guarantees \n2020-10-07 \n \n \n17 \nWhen the conditions under which the deposit was paid are revoked or met, the deposit must be refunded \n(see Part 8.19).  \n \n8.6 Ability to ensure person concerned will comply with deposit \nconditions  \nWhen exercising their authority to impose a deposit, officers may assess whether a proposed depositor is \nable to ensure that the person concerned complies with conditions imposed. Under A56(1) this will form \npart of a CBSA officer’s requirement to consider alternatives to detention. To clarify, where the matter is \nbefore the ID, the ID member will be responsible for conducting this assessment during the detention \nreview.  \nIn the assessment, officers may consider factors such as: \n \nthe length and closeness of relationship of the depositor with the person concerned or group;   \n \n \nwhether they are related;   \n \n \nwhether the depositor has real influence over the person concerned or group;  \n \n \nwhether they live in close proximity and the frequency of their contact; \n \n \nwhether the existence of the deposit and the possibility of its forfeiture will serve as an \nincentive towards compliance by the person concerned   \n \n \nthe financial means of the depositor. \nIf the officer in the circumstances  determines that the depositor is unlikely to be able to ensure \ncompliance with the conditions, the officer may refuse the depositor, except when the release is ordered \nby the ID. Officers may consider accepting another person as a depositor in these cases, if one is \navailable and willing to post the bond. Officers shall fully document this decision and the reasons in the \ncase file. \n \nFor further details regarding the assessment of risk and evaluating alternatives to detention, officers \nshould refer to ENF 20 Detentions and ENF 34 Alternatives to detention. \n \n8.7 Establish identity of depositor \n \nThe IRCC or CBSA should require that the depositor provide the following original genuine \ndocumentation to prove their identity, status and residence: \n \n \nGovernment-issued photo identification (e.g. passport; driver’s license; permanent resident card) \nshowing the image of the depositor, their name, and age or date of birth; \n \nProof of status in Canada (e.g., passport; permanent resident card; birth certificate, citizenship \ncard); and  \n \nA document stating the depositor’s current residential address (e.g., driver’s license, water bill, \nhydro bill, cable bill). \n \n"
    },
    {
      "page": 18,
      "chars": 2783,
      "text": "ENF 8 Deposits and Guarantees \n2020-10-07 \n \n \n18 \nCopies of the original identity, status and residency documentation provided for the establishment of the \ndepositor’s identity shall be placed on file and shall accompany the security deposit information when \nsent to the Revenue Accounting and Reporting Division.  \n \nFailure to provide requested identity, status and residency documents may result in the rejection of the \ndepositor or a direction to the proposed depositor to return at a later time with the requested \ndocumentation. \n \n8.8 Acceptable forms of payment for deposits \n \nDeposits must be paid by the individual listed on the Order for Release. \n \nAcceptable forms of payment, payable to the Receiver General for Canada, are: \n \n \nBank draft; \n \nMoney order; \n \nCertified cheque; \n \nDebit cards; \n \nCredit cards, so long as the credit card holder is the same person as the depositor listed on the \norder for release;  \n \nTravellers cheques; and  \n \nCash – only in offices with capability of processing cash payments. \n \n \nPre-paid credit cards are not acceptable. \n \nWhen payment is via credit card, officers shall copy the front and back of the credit card used and forward \nit with the deposit package to the Revenue Accounting and Reporting Division for the CBSA and if the \ndeposit is taken by an IRCC officer, to:  Accounting Operations, Revenue Unit, NHQ, at the completion of \nthe deposit process.  \n \nPayment may be made only in Canadian funds, or in the exceptional port of entry case described below, \nin U.S. funds: \n \n \nU.S. funds shall be accepted only at the port of entry where the depositor does not have sufficient \nCanadian funds. CBSA officers shall indicate in the Security Deposit form [BSF579] that U.S. \ncurrency was accepted. The depositor shall be advised that refunds will be paid in Canadian \nfunds and that no interest is paid on the deposit.  \n \n \nCBSA officers should refer to Acceptable Forms of Payment in Chapter 10, Section 1 of the \nComptrollership Manual, Finance Volume, for more detailed information \n \n8.9 Taking the deposit \n \nTwo employees are needed to take a deposit, one of whom must be a delegated officer.  This is to ensure \nthat there is a witness so that there is protection against accusations of mishandling funds. \n \nThe Security Deposit form [BSF579] must be completed and, unless the ID has issued the order for \nrelease using their own form, the Acknowledgement of Conditions form [BSF821] must also be \ncompleted.  Officers must ensure that the information is complete (including the mailing address) and \neasy to read. \n \nFor R45(1) port of entry cases, the CBSA officer will begin the process by completing the Request for \nSecurity Deposit [BSF517E] pursuant to subsection 45(1) of the IRPR. \n  \n"
    },
    {
      "page": 19,
      "chars": 3215,
      "text": "ENF 8 Deposits and Guarantees \n2020-10-07 \n \n \n19 \nThe CBSA or IRCC officer:  \n \n \nrecords the personal information of the depositor (full name, date of birth, address, phone \nnumbers, driver’s license number, status, name, address and phone number of employer, \nrelationship to person concerned, etc.) for the file; \n \n \nverifies that the information on the money order, bank draft, or certified cheque is correct. For \ncash handling procedures, see below; \n \n \ncompletes the Security Deposit form [BSF579] after receiving the sum of money; \n \n \nadvises the depositor that should conditions be met, the deposit will be refunded in the form of a \ncheque (Canadian currency), which may take several months to be processed and that no \ninterest will be paid;  \n \n \nadvises the depositor that it is imperative that they advise the CBSA if they change addresses as \nthe deposit will be refunded to the address listed on the Security Deposit form; \n \n \ncompletes the Acknowledgement of Conditions form [BSF821], (unless the ID has ordered \nrelease and issued their own form to impose conditions); \n \n \nexplains the conditions and the consequences of non-compliance to the person concerned and \ndepositor, ensuring that they understand their responsibilities and the consequences should the \nperson concerned not comply with any of the conditions imposed; \n \n \nensures that the person concerned and a witness sign the Acknowledgement of Conditions form \n[BSF821] (where applicable) and in port of entry cases, the Request for Security Deposit form \n[BSF517E]; \n \n \ngives copy 1 (white copy) of the Security Deposit Form (which is also the official receipt) and a \ncopy of the signed Acknowledgement of Conditions to the depositor; in port of entry cases, \nprovide a copy of the Request for Security Deposit form to the depositor; \n \n \nIf the depositor has presented a signed and sealed Power of Attorney document for an \nassignment for the refund of the deposit, CBSA officers shall send the original copy of the \ndocument, not a photocopy, to Revenue Accounting and Reporting Division at the address below; \nand for IRCC officers, to: Accounting Operations, Revenue Unit, NHQ; \n \n \nadvises the person concerned that failure to confirm departure from Canada may result in the \nforfeiture of the deposit if conditions of the deposit require departure from Canada on or before a \nspecified date; \n \n \nprovides detailed reasons in file notes for the decision to require a deposit;  \n \n \nCBSA staff shall follow the procedures for depositing payments into a financial institution set out \nin Receipts, Deposits and Safeguarding of Public Money and Monetary Assets in Chapter 10, \nSection 11 of the Comptrollership Manual, Finance Volume; \n \n \nThe deposit information needs to be entered into the financial systems.  The Corporate \nAdministrative System (CAS) document number, or if using TEPs/G11, the K21 or K10 document \nnumber needs to be recorded on the Security Deposit form [BSF579]; \n \n \nAfter ensuring the financial systems are updated, CBSA staff shall forward the following \ndocumentation to the CBSA Revenue Accounting and Reporting Division, 355 North River Road, \n18th Floor, Ottawa, ON K1A 0L8: \n"
    },
    {
      "page": 20,
      "chars": 2747,
      "text": "ENF 8 Deposits and Guarantees \n2020-10-07 \n \n \n20 \no \na copy of both sides of the credit card, if payment is by credit card; \no \ncopy 2 of the Security Deposit form [BSF579]; \no \na copy of the K10 document if deposit entered in G11; \no \noriginal of any valid Power of Attorney signed by the depositor. \n \nIRCC officers shall forward the following documentation to the  Accounting Operations, Revenue Unit, \nNHQ, 70 Crémazie Street, Gatineau, QC, K1A 1L1:  \n \n \ndepositor’s personal information (full name, date of birth, address, phone numbers, driver’s \nlicense number, status, name, address and phone number of employer, relationship to person \nconcerned, etc.); \n \na copy of both sides of the credit card, if payment is by credit card; \n \nfor payment methods other than credit card, all funds collected must be sent to the Revenue Unit, \nNHQ to be deposited in NHQ bank account; \n \ncopy 2 of the Security Deposit form [BSF579]; \n \noriginal of any valid Power of Attorney signed by the depositor. \n \nHard copies of the bank deposit slip and the internal deposit slip shall be placed in the person \nconcerned’s file. \n \nCash handling procedures \nWhen a deposit is paid in cash, the following procedures will be incorporated into the procedures above: \n \n \nThe officer and the second employee shall separately count the currency in the presence of each \nother to verify accuracy, noting the currency denominations on the Security Deposit form [BSF579];  \n \n \nThey shall each sign the Security Deposit form; \n \n \nThey shall seal the BSF579 form along with the cash in an envelope and shall initial it over the \nseal; \n \n \nThe envelope must be labelled with the person concerned’s name, client I.D., deposit number and \nthe amount of the deposit; \n \n \nThe deposit information is recorded in the office log for bonds, and the officer and employee \nwitness shall initial the entry; \n \n \nThe officer shall notify the manager via email that a cash deposit has been received, specifying the \namount of the deposit, the name of the depositor and the document number of the deposit; \n \n \nThe officer and employee witness shall deposit the sealed envelope and corresponding documents \ninto the safe in the office; \n \n  The employee responsible for handling cash payments in the office will retrieve the sealed envelope \nwith accompanying documentation from the drop safe in the presence of a CBSA manager and \nverify the cash amount in the envelope, then secure the cash and documentation in the petty cash \nsafe in the presence of a witness;  \n \n \nThe employee responsible for regional finance transactions will enter the deposit information into \nCAS and record the numbers generated by CAS on the security deposit form [BSF579]. \n \n \n \n \n \n"
    },
    {
      "page": 21,
      "chars": 2408,
      "text": "ENF 8 Deposits and Guarantees \n2020-10-07 \n \n \n21 \n8.10 Altering or amending a deposit \n \nAn amended deposit may be warranted if any of the conditions of the original deposit have been altered \nor amended; \n \nWhen the subject of a deposit makes a request to the CBSA, IRCC or the ID to have any reporting \nconditions modified and the request is granted, the depositor must be made aware of the new conditions \nimposed on the subject. The depositor is required to appear at the CBSA or IRCC office as applicable \nand sign the amendment to the conditions of the deposit; \n \nThe original office involved in the original imposition of the deposit, should whenever possible, be advised \nof any alterations, amendments, extensions, and refunds. \n \nProcedures to increase the amount of the original deposit \n \nTo increase the amount of the original deposit, the IRCC or CBSA officer:  \n \n \nadvises the depositor that an additional deposit is required; \n \n \ncompletes a second Security Deposit form [BSF579] to replace the original form;  \n \n \nprovides reasons for the increased amount of the deposit in NCMS or GCMS (as appropriate);  \n \n \nticks off 'Replaces previous security deposit no...' in the Official Receipt box of the Security Deposit \nform, and add the previous deposit number; \n \n \nfor the CBSA, forward copy 2 of the BSF579 to CBSA Revenue Accounting and Reporting Division, \n355 North River Road, 18th Floor, Ottawa, ON K1A 0L8; and  \n \n \nfor IRCC, forward copy 2 of the BSF579 to Accounting Operations, Revenue Unit, NHQ, 70 \nCrémazie Street, Gatineau, QC, K1A 1L1  . \n \n \nProcedures to reduce the amount of the original deposit \n \nTo reduce the amount of the original deposit, the CBSA or IRCC officer:  \n \n \ncompletes a Requisition for Refund / Forfeiture of Security Deposit form [IMM 0709B] to request a \npartial refund of the original deposit; \n \n \nprovides reasons for the decreased amount of the deposit in NCMS; \n \n \nfor the CBSA, forwards copies 1 and 2 of the IMM 0709B and documentation showing the current \naddress and the proper full name of the depositor (copies of identity documents; proof of address, \netc.) to CBSA Revenue Accounting and Reporting Division, 355 North River Road, 18th Floor, \nOttawa, ON K1A 0L8; and \n \nFor IRCC, forwards copies 1 and 2 of the IMM 0709B to Accounting Operations, Revenue Unit, NHQ, 70 \nCrémazie Street, Gatineau, QC, K1A 1L1. \n \n \n \n \n \n \n"
    },
    {
      "page": 22,
      "chars": 2815,
      "text": "ENF 8 Deposits and Guarantees \n2020-10-07 \n \n \n22 \n8.11 Guarantees - General \n \nA guarantee is a written enforceable undertaking by a third party that the person who is the subject of the \nguarantee (the person concerned) will abide by the conditions imposed by a CBSA or IRCC officer or by \nthe ID and to forfeit or pay a sum of money to the Crown if the person concerned breaches any \nconditions. The guarantor and the person concerned must both agree to the conditions.  \nA guarantor is not required to provide the sum of money, unless the subject of the guarantee does not \ncomply with the conditions, hence, a guarantee is also referred to as a conditional bond.  \nOfficers must ensure that prospective guarantors: \n \no \nare Canadian citizens or permanent residents; \n \no \nare physically present;  \n \no \nreside in Canada; \n \no \nhave not signed or co-signed another guarantee that is in default; \n \no \nhave capacity to contract in the province where the guarantee is posted, i.e. be of legal age \nand capable of understanding the guarantee and its possible consequences; \n \no \nbe able to ensure that the person concerned will comply with the conditions imposed; and  \n \no \npresent evidence of their ability to fulfil the obligation arising from the guarantee, i.e. pay the \ndebt if the guarantee is forfeited. This is the determination of solvency. \n \nWhen multiple guarantors are required, all must be present and all must qualify as guarantors.  Failure of \none to qualify will result in the rejection of the guarantee. \n \nRole of the Hearings Officer relating to guarantees \n \nThe Hearings Officer will generally recommend to the member of the ID that a minimum set of conditions \nbe imposed on the person concerned, including the following:  \n \n \nthat the person concerned shall present themselves at the time and place that an officer, the \nImmigration Division, the Minister or the Federal Court requires them to appear to comply with any \nobligation imposed on them under the IRPA; \n \nthat the person concerned shall  inform the Canada Border Services Agency (CBSA) and/or \nImmigration Refugees and Citizenship Canada (IRCC) in writing of their address and, in advance, of \nany change in that address; \n \nthat the person concerned shall not commit an offence under an Act of Parliament or an offence that, \nif committed in Canada, would constitute an offence under an Act of Parliament. \n \nThe Hearings Officer provides detailed reasons in the file notes for the recommendation that a \nguarantee be imposed. \n \n8.12 Ability to ensure the person concerned will comply with conditions \nof guarantee \n \nWhen exercising their authority to impose a guarantee, officers shall assess whether a proposed \nguarantor is able to ensure that the person concerned complies with conditions imposed [R47(2)(b)]. To \n"
    },
    {
      "page": 23,
      "chars": 3617,
      "text": "ENF 8 Deposits and Guarantees \n2020-10-07 \n \n \n23 \nclarify, where the matter is before the ID, the ID member will be responsible for conducting this \nassessment during the detention review. \n \nR47(4) lists the prescribed factors that must be considered in assessing whether the person who posts \na guarantee has the ability to ensure that the person or group of persons in respect of whom the \nguarantee is required will comply with the conditions imposed.  These are to be considered in addition to \nexisting regulatory requirements under R47(1) and (2): \n \na) their relationship to the person or group of persons in respect of whom the guarantee is \nrequired; \nb) their financial situation; \nc) any previous history posting a guarantee; \nd) their criminal record; and \ne) any other relevant factor in determining their ability to ensure that the person or group of \npersons in respect of whom the guarantee is required will comply with the conditions imposed. \n \nThe application of these prescribed factors under R47(4) will turn on the facts of each case.  \n \nThe following is a non-exhaustive list of specific considerations that may assist an officer who is \nconsidering imposing a guarantee, in considering whether a guarantor has the ability to ensure \ncompliance pursuant to the requirement under R47(2)(b) and the prescribed factors under R47(4): \n \n \nNature and duration of relationship to the person concerned and the strength of that relationship; \n \nWhether proposed guarantor was aware of the person’s status in Canada; \n \nWhether proposed guarantor was aware that the person was coming to Canada; \n \nWhen was the last time the guarantor had contact with or spoke to the person concerned;  \n \nCurrent employment of guarantor and number of years with that employer; \n \nAnnual income of guarantor based on last notice of assessment; \n \nWhether guarantor owns a home or other property and value of that property; \n \nWhether guarantor is the sole owner of that property; \n \nWhether the guarantor supports any dependents; \n \nWhether the guarantor has ever posted an immigration bond before and, if so, the outcome; \n \nWhether the guarantor has any criminal record in Canada or elsewhere and, if so, whether the \nnature of any criminal conviction(s) would cast doubt on their ability to ensure compliance with \nconditions (e.g. breach of a court order). \n \nOther potential relevant considerations (non-exhaustive) relating to R47(4)(e): \n \n \nWhether the person concerned will reside with the guarantor if a guarantee is signed on their \nbehalf and, if not, whether the guarantor will be living in physical proximity to the person for whom \nthey are signing a guarantee; \n \nWhether the guarantor ever posted bail in relation to a criminal matter in Canada and, if so, the \noutcome; \n \nWhether the bondsperson ever employed the person concerned illegally while in Canada;   \n \nWhat arrangements would be in place for the guarantor to be able to exercise control and \ninfluence over the actions of the person concerned; and \n \nWhether the proposed guarantor had knowledge of, or harboured the person concerned while \nthat person was illegally in Canada \n \nWhere necessary, officers may conduct checks in the Global Case Management System (GCMS), \nNational Case Management System (NCMS) and other relevant databases regarding the potential \nguarantor(s) and make appropriate and reasonable enquiries as deemed necessary and appropriate as \nlong as it is for the purpose of assessing the prescribed factors under R47(4) for determining the ability of \na proposed guarantor to ensure compliance. \n \n"
    },
    {
      "page": 24,
      "chars": 4016,
      "text": "ENF 8 Deposits and Guarantees \n2020-10-07 \n \n \n24 \nOfficers should keep in mind that the factors under R47(4) are considerations, but are not in and of \nthemselves determinative of whether the guarantor has the ability to ensure compliance with a guarantee. \nFor example, if it is discovered that the guarantor has a criminal record, it does not automatically \ndisqualify the person from acting as a guarantor, but may lead the officer to question the person’s \nsuitability as a guarantor and determine that, in the circumstances of the case, the criminal conviction \nwould cast doubt on the person’s ability to ensure compliance with conditions (e,g., conviction for breach \nof a court order). \n \nIf the officer considering whether to impose a guarantee determines that the proposed guarantor is \nunlikely to be able to ensure compliance with the conditions, the officer may refuse the guarantor (see \nPart 8.17 below for procedures on rejecting a guarantee). Officers may then consider other potential \nguarantors  in these cases, unless the release was ordered by the ID, if others are available and willing to \npost the guarantee. Officers shall fully document this decision and the reasons in the case file. In cases \nwhere there has been an arrest under A55, this decision will be reflected in their consideration of \nalternatives to detention.  For further details regarding the assessment of risk and evaluating alternatives \nto detention, officers should refer to ENF 20 Detentions and 34 Alternatives to detention. \n \nThe prescribed factors under R47(4) are also applicable to decisions of the ID at detention reviews. \nCBSA Hearings Officers are to monitor the application of these provisions by ID Members at detention \nreviews and make submissions where necessary. Failure by the ID Members to assess a potential \nguarantor by applying the prescribed factors under R47(4) would constitute an error in law reviewable at \nthe Federal Court.  \n \nWhile CBSA officers (including Inland Enforcement Officers, Hearings Officers and Hearings Advisors) \nare free to conduct appropriate system checks as deemed necessary for the purpose of detention reviews \nand the assessment of the guarantor’s solvency when processing an ID order for release, such checks \nshould not be conducted upon request of the IRB. The CBSA is not the enforcement arm of the IRB.  \n \nOfficers are reminded that, once the ID has made a decision to release on specified conditions, an officer \nhas no legal authority to change the conditions at the time of processing the bond and may not reject the \nbond based on R47(2)(b). If, during bond processing, concerns arise regarding the bondsperson named \nby the ID (e.g. it is discovered through system checks following the issuance of the ID release order that \nthe named guarantor provided false information to the ID regarding one of the R47(4) considerations), the \nofficer should communicate their concerns without delay to the Hearings Officer who can address them, \nas appropriate, with the ID. In such situations, it remains the case that officers may not reject the \nguarantee based on factors other than the requirements under R47(1), R47(2)(a), the solvency \nassessment under R47(2)(c) or the application of R47(3).   \n \n \n8.13 Establish identity of guarantor \n \nGuarantors must provide the IRCC or CBSA officer taking the guarantee with the following original, \ngenuine documentation to prove their identity, age, status and residence: \n \n government-issued photo identification (e.g. driver’s license, passport, permanent resident card) \nshowing the image of the guarantor, their name, and age or date of birth; \n \n proof of status in Canada (e.g. passport; birth certificate, citizenship certificate, certificate of Indian \nstatus, permanent resident card); and \n \n a document showing the guarantor’s current residential address (e.g. driver’s license, utility bill, bank \nstatement, pay stub).  \n \n copies of the original identity documentation will be placed on file. \n \n"
    },
    {
      "page": 25,
      "chars": 3647,
      "text": "ENF 8 Deposits and Guarantees \n2020-10-07 \n \n \n25 \n failure to provide identity, status and residency documents will result in the rejection of the application \nto post a guarantee or a direction to the proposed guarantor to return at a later time with the required \ndocumentation. \n \n8.14 Determining solvency for guarantors \n \nThe requirement that a guarantor be solvent, i.e. have sufficient liquid funds to pay the guarantee if it is \nenforced, is intended to ensure that the Government is able to collect on the debt should the guarantor go \ninto default upon non-compliance by the person concerned with conditions.  \n \nThe following principles should guide the determination of solvency: \n \n \nthe guarantor’s annual income should be assessed first. The annual income minus liabilities on \nincome should be three (3) times the total of the guarantee. For example, a requirement of a \nguarantee in the amount of $5,000 would require net income of at least $15,000 (3 x $5,000). A \nperson with annual income of $50,000 and annual liabilities totalling $20,000 leaving $30,000 net \nincome would qualify to post the guarantee. If the guarantor’s annual net income is insufficient, then \nthe guarantor’s assets shall be assessed. \n \n \nwhen assessing income alone, the liabilities to take into account are the total of the annual liabilities, \nnot the total liability. For example, a loan of $15,000 payable monthly in the amount of $200 would \nconstitute a $2,400 annual liability for the guarantor. A rent or mortgage payment of $1000 per month \nwould constitute a $12,000 annual liability.  \n \n \nassets alone without any income are a strong indication that the individual is likely not solvent, \nhowever, officers may consider individual circumstances of the case before making a decision.  \n \n \nwhen the amount of the guarantee is too high for the guarantor to qualify on annual income alone, \nboth income and assets are assessed; the guarantor’s solvency is calculated by totalling the \nguarantor’s annual income and current assets minus existing total liabilities.  \n \n \nofficers should ask for income and assets in an amount approximately three times the total amount \nof the guarantee to be posted.   \n \n \nexisting liabilities should be subtracted from the total of the guarantor’s combined income and assets \nfor the calculation of solvency. For example, if the guarantor’s annual income is $65,000 and they \nown a house valued at $300,000, and they have no other qualifying assets, their total income and \nassets would be $365,000. If the guarantor’s mortgage on the house is $280,000, their car loan \nbalance is $20,000, their student loan balance is $25,000 and they have a line of credit balance in \nthe amount of $15,000, then their total liabilities are $340,000. They have the net amount of $25,000 \n($365,000 - $340,000) available for a guarantee, however, if the guarantee required was $10,000, \nthey would be deemed insolvent as a $10,000 guarantee requires $30,000 in available income and \nassets. \n \n \nliabilities or debts include mortgage balances; outstanding loan balances; student loan balances; \ncredit card balances; line of credit balances; annual rent obligations; and the average yearly cost of \nmonthly utility payments (e.g. phone, internet, cable, hydro, water, gas/oil).  \n \n original documentation of source of funds must be provided, and if accepted towards the \ndetermination of solvency, copies shall be taken and placed on file.  \n \n \nwhere reasonable in the circumstances, to assist in the determination of solvency, officers may \nrequest proposed guarantors to provide a recent credit report.  \n \n"
    },
    {
      "page": 26,
      "chars": 2740,
      "text": "ENF 8 Deposits and Guarantees \n2020-10-07 \n \n \n26 \nAssessing income \n \nIncome which is not eligible for solvency determination:  \n \n \nwelfare, social assistance, family allowances, child tax benefits, child support payments, medical \ndisability, and worker’s compensation should not be considered in the solvency determination given \nthat these payments are made in the public interest and it is unlikely that the Crown would seek to \nrecover the amount of the guarantee from these payments to pay the debt on default; \n \nIncome which is eligible for solvency determination includes:  \n \n \nemployment income, proven by the three most recent Canada Revenue Agency (CRA) Notices of \nAssessment, pay stubs; \n  \n \nEmployment Insurance benefits, including maternity leave benefits and parental leave benefits, \nproven by EI statements, or the T4E;  \n \n \nCanada Pension Plan payments / Quebec Pension Plan payments, proven by pension statements or \nfinancial institution statements showing these deposits; \n \n \nOld Age Security payments, proven by OAS statements or financial institution statements showing \nthese deposits;  \n \n \nother pension payments, proven by pension statements or financial institution statements showing \nthese deposits; \n \n \ninvestment income such as dividends or interest, proven by the T5 Statement of Investment Income; \n \n \ntrust income, proven by T3 Statement of Trust Income; \n \n \nrental income, proven by recent income tax forms submitted to the CRA, or financial institution \nstatements showing these payments as deposits combined with proof of title to the rental property \nand rental agreements; \n \n \nearnings on a life insurance policy, proven by statements from the life insurance company; \n \n \nspousal support (alimony) payments, proven by most recent income tax form filed, or by financial \ninstitution statements showing the deposits combined with the agreement/court order showing the \namount to be paid; \n \n \nbusiness income, proven by the most recent tax filings, or by financial institution professional \nbusiness account statements.  \n \nRegularly documented cash deposits into a guarantor’s accounts may be proof of income; however \nofficers should require credible evidence of the origin of these deposits and their continuing nature, as \nwell as reasonably satisfying themselves that they are not illegally obtained. \n \nIn cases where officers deem it reasonably appropriate in the circumstances, they may accept alternative \ndocumentary proof of income or require additional corroborating proof.  \n \nAssessing assets: \n \n assets acceptable for a guarantee should be capable for easy liquidation by the Crown. \n \n equity in property is acceptable as long as the property is in Canada. \n"
    },
    {
      "page": 27,
      "chars": 2532,
      "text": "ENF 8 Deposits and Guarantees \n2020-10-07 \n \n \n27 \n \n where the guarantor owns an asset with another person or persons, only the percentage of equity \nowned by the guarantor will be considered for proof of solvency;  \n \n letters of credit, credit limits on credit cards, and unused or available lines of credit are not considered \nassets;  \n \nAssets which should not be accepted for solvency determination: \n \n \nassets held in foreign locations (e.g. offshore accounts) due to the difficulty of seizing these assets \nupon forfeiture; \n \n \nassets held in forms of ownership so complicated that enforcing the debt would be overly time \nconsuming and difficult, for example, a commercial building held by a number of owners; \n \n \nRegistered Retirement Savings Plans (RRSP); \n \n \nRegistered Educational Savings Plans (RESP); \n \n \nvalue of pension plans, including personal locked-in or prescribed plans such as Locked In \nRetirement Accounts (LIRA), Life Income Funds (LIF), Life Registered Income Funds (LRIF), etc. \n(Note: all provinces provide unconditional protection against creditors for money held in a pension plan or when \ntransferred out to a personal locked or prescribed plan such as a LIRA, LIF, LRIF) \n \n \nCanada savings bonds and bonds issued by entities other than the Government of Canada; \n \n \nvehicles of any type; \n \n \ntools; \n \n \nmachinery; \n \n \npersonal property such as furniture, antiques, collectibles, jewelry, artwork, clothing, and other \npersonal effects. \n \nEligible assets for solvency determinations include: \n \n \nsavings, proven by the previous 12 month period of financial institution statements; \n \n \nGuaranteed Investment Certificates (GICs), proven by financial institution statements; \n \n \nTreasury bills, proven by financial institution statements; \n \n \nbonds issued by the Government of Canada which are transferrable (Canada Savings Bonds are not \nacceptable because they are not transferable), proven by bond certificates; \n \n \nstocks, proven by stock certificates, where the principle investment is at least 12 months old; \n \n \nequity in real estate, proven by the registered title or deed to the property, the mortgage balance \nstatement or mortgage discharge, where applicable, and the most recent municipal property tax \nassessment or property evaluation done by the bank or other reputable institution;  \n \nOfficers may accept other documentary proof of assets, or require additional corroborating proof in cases \nwhere they deem it appropriate in the circumstances.  \n \n"
    },
    {
      "page": 28,
      "chars": 2489,
      "text": "ENF 8 Deposits and Guarantees \n2020-10-07 \n \n \n28 \n8.15 Taking a guarantee  \n \nTo take a guarantee, the IRCC or CBSA officer shall: \n \n \nensure that information showing that the guarantor meets regulatory requirements is recorded \nand placed on file; \n \n \nphotocopy all documents produced to prove income and assets as well as identification \ndocuments, and place on file; \n \n \ncomplete the Solemn Declaration of Solvency by Guarantor form [BSF564]; \n \n \ncomplete the Guarantee form IMM1230E;  \n \n \ncomplete the Guarantee (where there are Co-signers) Bond, where applicable [BSF 507]; \n \n \ncomplete the Guarantee Log form to maintain control of guarantees issued and for statistical \npurposes [IMM 5073B]; \n \n \ncomplete the Acknowledgement of Conditions form [BSF821] which shall be written in a clear and \nprecise manner in order to render the guarantee enforceable;  \n \nexplain the conditions and the consequences of non-compliance to the person concerned and the \nguarantor, ensuring that the guarantor understands their responsibilities and the consequences \nshould the person concerned not respect any of the conditions imposed;  \n \n \nensure that the person concerned and a witness sign the Acknowledgement of Conditions form \n[BSF821]. (Under R49(1), the guarantor must acknowledge in writing that they have been \ninformed of the conditions imposed and that non-compliance with any of the conditions will result \nin forfeiture of the deposit or enforcement of the guarantee); \n \n \nprovide a copy of the guarantee, the Declaration of Solvency, and the Acknowledgement of \nConditions form to the guarantor; and a copy of the Acknowledgement of Conditions to the person \nconcerned; \n \n \nplace the original guarantee and Declaration of Solvency, and a copy of all other signed forms on \nfile; \n \n \nprovide detailed reasons in the file notes for the recommendation that a guarantee be imposed; \nand \n \n \nupdate GCMS and NCMS, as applicable. \n \n8.16 Altering or amending a guarantee \n \nAny unilateral attempt to alter or amend the conditions upon which a guarantee was posted shall not be \nenforceable. The original guarantee will remain valid and enforceable. \n \nThe conditions of a guarantee cannot be altered without the consent of all parties, e.g., an IRCC or \nCBSA officer or a member of the ID, signatory to the guarantee as well as the guarantor. \n \nAn amended guarantee is required if any of the conditions of the original guarantee have been altered \nor amended. \n \n"
    },
    {
      "page": 29,
      "chars": 2833,
      "text": "ENF 8 Deposits and Guarantees \n2020-10-07 \n \n \n29 \nWhen the person concerned makes a request to the CBSA, IRCC or the ID to have any reporting \nconditions modified and the request is granted, the guarantor must be made aware of the new \nconditions imposed on the person concerned; and the guarantor is required to appear at the CBSA or \nIRCC office as applicable and sign the Amendment to Guarantee for Compliance Issued form \n[IMM 5071B] outlining the amended conditions. The person concerned is also required to sign the form. \n \nThe original office involved in the taking of the original guarantee must be advised of any alterations, \namendments, and extensions. \n \n \nProcedures to increase the amount of the original guarantee: \n \nTo increase the amount of the original guarantee, a CBSA or IRCC officer shall: \n \n \nadvise the guarantor that the change in conditions means that the guarantee amount is being \nincreased; \n \n \nreassess the solvency of the guarantor for the increased amount, following the process outlined in \n8.14 above, complete the Solemn Declaration of Solvency by Guarantor form [BSF564] and the \nGuarantee Log [IMM 5073B];  \n \n \ncomplete the Amendment to Guarantee for Compliance form [IMM 5071B], explain amended \nconditions to the guarantor and ensure that the guarantor and a CBSA or IRCC witness sign the \nform;  \n \n \nprovide a copy of the form IMM 5017B to the guarantor and place the original on file; and \n \n \nupdate GCMS and NCMS, as applicable. \n \nProcedures to reduce the amount of the original guarantee: \n \nTo reduce the amount of the original guarantee, the CBSA or IRCC officer shall:  \n \n complete the Amendment to Guarantee for Compliance form [IMM 5071B], explain the amended \nconditions to the guarantor and ensure that the guarantor and a CBSA or IRCC witness sign the \nform;  \n \n provide a copy of the form [IMM 5071B] to the guarantor and place the original on file; and \n \n update GCMS and NCMS, as applicable. \n \n \n8.17 Rejecting a deposit or guarantee \n \nIf the bondsperson fails to provide personal documentation to prove identity, status, residency and their \ncurrent address, or fails to provide evidence of their ability to ensure that the person concerned will \ncomply with the conditions imposed, the officer will advise them to return with more documentation or to \nrequest a change of conditions. Officers will document this action and the reasons on the file as the \nperson concerned will continue to be detained in the meantime. \n \nFor guarantees, if income and assets presented are insufficient to post a guarantee, the officer will advise \nthe guarantor to return with more documentation or to request a change of conditions. Officers will \ndocument this action and the reasons on the file as the person concerned will continue to be detained in \nthe meantime. \n \n"
    },
    {
      "page": 30,
      "chars": 3533,
      "text": "ENF 8 Deposits and Guarantees \n2020-10-07 \n \n \n30 \nDelegated officers may make a decision to reject a deposit or guarantee except in cases where the ID \nhas imposed the guarantee and named the bondsperson. In these cases, officers shall not assess the \nsuitability of the bondsperson and may not reject the bond or guarantee on the basis of R47(2)(b) \nconsiderations.  Officers can only consider solvency issues if the assessment was not completed by the \nHearings Officer or one of the exceptions listed in 7.2.2 applies. If justified, the officer may then reject the \ndeposit or guarantee and will document this action and the reasons on file.  Since the person will remain \nin detention, the officer must inform the Hearings Officer who will then present this information to the ID, \nclient and their counsel. \n \nOnce the ID has made a decision to release and specified conditions, an officer has no legal authority to \nreject or change the conditions; however if they have concerns regarding the bondsperson named by the \nID, they should communicate their concerns to the Hearings Officer who can address them, if appropriate, \nwith the ID.  \n \nThis continues to be the case with respect to the prescribed factors under R47(4): an officer has no legal \nauthority to change the conditions at the time of processing the bond and may not reject the bond unless \nit is based on the requirements under R47(1), R47(2)(a), the solvency assessment under R47(2)(c) or the \napplication of R47(3). If, during bond processing, concerns arise regarding the bondsperson named by \nthe ID (e.g., it is discovered through system checks following the issuance of the ID release order that the \nnamed guarantor provided false information to the ID regarding one of the R47(4) considerations), the \nofficer should follow the procedure for communicating their concerns without delay to the Hearings Officer \nwho can address them, as appropriate, with the ID.  \n \nFor the CBSA, Inland Enforcement Assistants may review the documentation received and prepare the \nfile for officer review, but may not make the decision on whether a proposed bondsperson meets the \nrequirements and is suitable to post a bond.  \n \nOfficers shall fully document decisions to reject a bond and their reasons in the case file and NCMS or \nGCMS, as applicable. \n \n8.18 Stay of removal order \n \nDeposits: A stay of removal by the Immigration Appeal Division has the effect of cancelling a deposit \n[A68(2)(b)]. Deposits are to be refunded unless the conditions were breached before the stay was \nordered. \n \nGuarantees: A stay of removal by the Immigration Appeal Division has the effect of rendering the \nguarantee null and void. A guarantee should be left on file and, apart from the requirement to update \nNCMS/GCMS systems in order to register the effect of the stay on the guarantee, no further action is to \nbe taken unless the conditions were breached before the stay was ordered.  \n \n8.19 Withdrawal, refund and forfeiture of a deposit or enforcement of a \nguarantee  \n \nWithdrawal: \n \n \nif the bondsperson wishes to replace or be relieved of the deposit or a guarantee, another deposit \nor guarantee must be signed or the bondsperson must make arrangements with the CBSA to \ndeliver the person into CBSA custody.  \n \n \nthe onus is on the bondsperson to arrange to deliver the person concerned into CBSA custody. \nCBSA officers will not locate and arrest the person concerned so that a bondsperson may be \nrelieved of the obligation of the deposit or guarantee. \n \n"
    },
    {
      "page": 31,
      "chars": 3153,
      "text": "ENF 8 Deposits and Guarantees \n2020-10-07 \n \n \n31 \n \nthe death of a bondsperson does not render the deposit or guarantee unenforceable. The rights \nand liabilities flowing from security deposits and guarantees are passed on to the executors or \nadministrators of the estate of the depositor or guarantor. \n \n \nofficers’ decisions on compliance and forfeiture are subject to a judicial review application to the \nFederal Court of Canada. \n \n \nprocedures must be in place in each office to review deposits for refund or forfeiture at the \nconclusion of the case before the file is sent to archives. \n  \n \na bondsperson, including a co-signer, may request to be released from the obligation of the deposit \nor guarantee.  \n \n \na bondsperson, including a co-signer, cannot be relieved of their obligation by simply stating the \ndesire to be relieved, or by simply requesting it. \n \n \nthe bondsperson must apply to a CBSA or IRCC officer, depending on which officer imposed the \ndeposit or guarantee, or to a member of the ID if a member of the ID imposed the deposit or \nguarantee. Before relieving the bondsperson of the bond, and if the bond was posted as an offer of \nrelease by the ID, an application must be made to the ID and the ID must approve the change. If a \nsuitable new bondsperson is not available, the existing bondsperson must surrender the person \ninto CBSA custody as the person no longer meets the conditions of release. \n \nRefund of a deposit: \n \nWhen the person concerned subject to a deposit has complied with the conditions of the deposit, as set \nout on the Security Deposit form [BSF579], the deposit will be refunded to the depositor. \n \nThe IRPA does not provide specific authority for refunds, but R49(3) provides the authority to return funds \nheld in the Consolidated Revenue Fund to the depositor. \n \nOfficers shall review the file to determine if the deposit should be refunded. \n \nIf the deposit should be refunded, the officer shall cancel the deposit and arrange for the return of the \nmoney deposited. \n \nThe officer shall complete a Requisition for Refund/Forfeiture of Security Deposit form [IMM 0709B] and \nforward it to the authorized manager/supervisor for signature. \n \nWhen completing the IMM 0709B form, officers shall: \n \n \nconfirm the latest address for the depositor and insert it in the “Current mailing address of the \ndepositor- Addresse postale actuelle du déposant” field; \n \n \ninsert the security deposit number into the “Receipt No. – Reçu no” field in the IMM 0709B. The \nFIN 0007B or the K21 form number is not to be inserted into this field; \n \n \nprint the name of the authorizing officer (signing authority) in the “Name of authorizing officer – \nNom du fondé de pouvoir” field. Initials are unacceptable; and \n \n \nprint out authorizing (signing) officer’s title in the “Title as per delegation instrument – Titre \nconformément au document officiel de delegation de pouvoir” field.  \n \nOnly a manager/supervisor with delegated authority for section 34 of the Financial Administration Act is \ndelegated to sign the IMM 0709B, as per the procedures set out in Chapter 2 - Financial Signing \n"
    },
    {
      "page": 32,
      "chars": 3761,
      "text": "ENF 8 Deposits and Guarantees \n2020-10-07 \n \n \n32 \nAuthorities of the Comptrollership Manual, Finance Volume. \n \nThe manager/supervisor will return to the officer the signed IMM 0709B \n.  \nPage 3 (pink copy) is placed on file.  \n \nFor the CBSA, the regional Financial Administration officer and/or Administrative officers, depending on \nregional processes, shall forward the following documentation to CBSA Revenue Accounting and \nReporting Division, 355 North River Road, 18th Floor, Ottawa, ON K1A 0L8: \n \n \npage 1 (white copy) and page 2 (yellow copy) of the a Requisition for Refund/Forfeiture of Security \nDeposit [IMM 0709B];  \n \ncopy of the Security Deposit form [BSF579]; \n \ncopy of any form completed by officers recording the depositor’s information – sometimes referred \nto as the bondsperson’s information sheet or the personal information sheet (full name; date of \nbirth; address; phone numbers; driver’s license number; status; name, address and phone number \nof employer; relationship to person concerned, etc.); \n \ncopy of any form or request submitted by the depositor or the person concerned requesting a \nrefund of the deposit (this is valuable as it would most likely have a more current address for the \ndepositor than the original Security Deposit form);  \n \ncopies or scans of the identification documents provided by the depositor when the deposit was \ntaken (needed to ensure correct spelling of the name for the refund cheque and also to perform a \nname query in GCMS in an attempt to verify the bondsperson’s current address); and \n \ncopy of the proof of address when the deposit was taken. \n \n \nIRCC officers shall forward the documentation for action to: Accounting Operations, Revenue Unit, \nNHQ, 70 Crémazie Street, Gatineau, QC, K1A 1L1. \n \n \nonce the documentation has been sent as noted above, written notification shall be sent to the \ndepositor that the deposit has been forwarded to CBSA Revenue Accounting and Reporting \nDivision in Ottawa; or if IRCC, to Accounting Operations, Revenue Unit, NHQ for refund and that \nthey should allow ten to twelve weeks for cheque processing. \n \nIf information becomes available to cause a CBSA or IRCC officer to recommend that the deposit be \nrefunded, rather than forfeited, after a forfeiture has been processed, the refund procedures described \nabove shall be followed, detailing the reasons for the reversal in the Remarks section of the IMM 0709B. \n \nOnce the bond refund decision has been made and in addition to the completion of required forms, \nwritten notification may also be sent to the bondsperson at the discretion of officers/managers (see \nAppendix A:   Sample letter— Notification to Bondsperson re: Refund of Security Deposit). Such \nwritten notification may serve to provide confirmation of the end of the bondsperson’s obligations pending \nreceipt of the official refund from CBSA Revenue Accounting and Reporting Division in Ottawa, especially \nwhere the bondsperson has requested such confirmation from CBSA.  Where the bondsperson is also \nbeing relieved of a guarantee posted for the same client, the notification can include both bonds (see \nAppendix B:   Sample letter— Notification to Bondsperson re: Refund of Security deposit and \ncancellation of performance bond). In correspondence with a bondsperson, it is important that CBSA \nofficials do not disclose case details/status due to privacy concerns. \n \nPowers of Attorney:  \n \nA depositor may give power of attorney to another person to act as the depositor’s agent with respect to \nall or part of the depositor’s finances and property. In order to refund a deposit to an individual who is not \nthe depositor, a validly executed Power of Attorney document must be provided by the depositor;  \n \n"
    },
    {
      "page": 33,
      "chars": 3646,
      "text": "ENF 8 Deposits and Guarantees \n2020-10-07 \n \n \n33 \nFor the CBSA, the original copy of the Power of Attorney or Consent document, not a photocopy, must be \nforwarded to CBSA Revenue Accounting and Reporting Division, 355 North River Road, 18th Floor, \nOttawa, ON K1A 0L8, before a deposit can be refunded to an attorney. \n \nFor IRCC, the original copy of the Power of Attorney or Consent document, not a photocopy, must be \nforwarded to Accounting Operations, Revenue Unit, NHQ, 70 Crémazie Street, Gatineau, QC, K1A 1L1. \n \nCancellation of a guarantee/performance bond: \n \nWhere a guarantee is no longer required as it has been determined that the bond has been complied \nwith, it may be appropriate for CBSA officials to advise the guarantor in writing that the conditions of the \nperformance bond have been complied with. Without disclosing further case details, the letter will serve to \nnotify the guarantor that their obligations specified in the performance bond are null and void and confirm \nthe fulfillment of their obligations. Such written confirmation is most likely to be requested by the \nguarantor in cases where the guarantee was not signed in conjunction with a security deposit (see \nAppendix C:   Sample letter— Notification to Guarantor re: Cancellation of Performance Bond). \n \nAssignment of deposit or guarantee: \n \nA deposit or guarantee, is not assignable to a third party.  \n \nIf a bondsperson wants to “assign” the deposit or guarantee to a third party willing to assume the deposit \nor guarantee obligation, the original deposit must be refunded and the original guarantee must be \ncancelled/considered null and void and then a new deposit or guarantee must be issued, following the \nprocedures for the taking of deposits or guarantees.  \n \nForfeiture of a deposit or enforcement of a guarantee: \n \nThe CBSA generally makes the decisions on forfeitures of deposits and enforcement of guarantees.  \n \nForfeiture of a deposit is to the Receiver General for Canada. \n \nIf the person concerned for whom a deposit has been paid or a guarantee posted breaches any condition, \na CBSA or an IRCC officer will review the circumstances of the breach.  \n \nAlthough R49(4) does not provide for officer discretion in determining if a breach of condition has \noccurred, jurisprudence (Hamid v. Canada, 2015 FC 1208) indicates that officers have a limited discretion \nto decide whether a breach of conditions is severe enough to warrant the forfeiture of the deposit or \nenforcement of the guarantee. \n \nRecommendations that the deposit be forfeited or the guarantee enforced will be directed to the officer’s \nmanager with delegated authority for section 34 of the Finance Administration Act.  \n \nThe manager, on receiving the officer’s recommendation for forfeiture of the deposit or enforcement of the \nguarantee, shall determine whether the breach is sufficient in the circumstances of the case to warrant \nforfeiture of the deposit or enforcement of the guarantee. \n \nThe Regulations do not provide express authority for officers to reduce or otherwise alter the amount of \nthe deposit or guarantee. In the absence of express authority, it is CBSA’s position that if an officer \ndecides to forfeit the deposit or guarantee, the bondsperson will be held accountable for the entire \namount of the deposit or guarantee. \n \nThe rules of procedural fairness apply when a deposit or guarantor is under consideration for forfeiture or \nenforcement due to a breach by the person concerned of a condition imposed. Bondspersons will be \nprovided with notification of the breach of conditions and offered an opportunity to provide written \n"
    },
    {
      "page": 34,
      "chars": 3179,
      "text": "ENF 8 Deposits and Guarantees \n2020-10-07 \n \n \n34 \nrepresentations with respect to whether there was, in fact, a breach of condition and whether the breach \nwas so minor as to not warrant forfeiture.  \n \nIf forfeiture or enforcement is warranted, the manager shall have written notification of the specifics of the \nbreach and possible forfeiture or enforcement action sent to the bondsperson by registered mail, \nproviding them with an opportunity to make a written representations as noted above within 30 days of \nreceipt concerning the decision to be made; \n \nAll written representations or submissions from the bondsperson shall be considered by the manager in \nreaching the decision; \n \nIf the bondsperson has not responded within 37 days of the written notification, they will be sent written \nnotification of the decision and reasons by registered mail; \n \nGuarantors are notified of the decision to enforce the guarantee via the Guarantee of Compliance \nEnforcement Notice form [IMM 5072B]. \n   \nIf the decision is to forfeit the deposit or enforce the guarantee, the manager will direct an officer to \ncomplete a Requisition for Refund/Forfeiture of Security Deposit form [IMM 0709B] for a deposit forfeiture \nand the Requisition for Enforcement of Guarantee [IMM 5345B] for a guarantee enforcement. \n \nThe officer shall complete a Requisition for Refund/Forfeiture of Security Deposit form [IMM 0709B] for a \ndeposit, or a Requisition for Enforcement of a Guarantee form [IMM 5345B] and forward it to the \nauthorized manager/supervisor for signature. \n \nOnly a manager/supervisor with delegated authority for section 34 of the Financial Administration Act is \ndelegated to sign the IMM 0709B and the IMM 5345B as per procedures set out in Chapter 2 - Financial \nSigning Authorities of the Comptrollership Manual, Finance Volume. \n \nThe manager/supervisor will return to the officer the signed IMM 0709B or IMM 5345B forms.  \n \nFor deposits, the CBSA regional Financial Administration office and/or officers, depending on regional \nprocesses, shall forward the following documentation to CBSA Revenue Accounting and Reporting \nDivision, 355 North River Road, 18th Floor, Ottawa, ON K1A 0L8: \n \n \npage 1 (white copy) and page 2 (yellow copy) of the IMM 0709B;  \n \ncopy of the Security Deposit form [BSF579]; and \n \ncopy of the decision letter to the depositor. \n \nIRCC officers shall forward the IMM 0709B for action to:  Accounting Operations, Revenue Unit, NHQ, 70 \nCrémazie Street, Gatineau, QC, K1A 1L1. \n \nPage 3 (pink copy) of the IMM 0709B is placed on file.  \n \nFor guarantees, the officer or regional financial administration office, according to regional processes, will \nsend the guarantor, by registered mail, the original signed Requisition for Enforcement of a Guarantee \nform [IMM 5345B], and place a copy on file.  \n \nFollowing document shall be sent to CBSA Revenue Accounting and Reporting Division, 355 North River \nRoad, 18th Floor, Ottawa, ON, K1A 0L8: \n \n copies of the Requisition for Enforcement of a Guarantee form [IMM 5345B],  \n the Declaration of Solvency [BSF564; IMM 1416B],  \n a copy of the Guarantee/Performance Bond [IMM 1230E],  \n"
    },
    {
      "page": 35,
      "chars": 1242,
      "text": "ENF 8 Deposits and Guarantees \n2020-10-07 \n \n \n35 \n a copy of the letter of decision sent to the guarantor / the Guarantee of Compliance Enforcement \nNotice form [IMM 5072B] sent to the guarantor, and  \n copies or scans of the guarantor’s identification documents taken at the time of posting the \nguarantee. \n   \nFor IRCC, the documentation shall be sent to Accounting Operations, Revenue Unit, NHQ, 70 Crémazie \nStreet, Gatineau, QC, K1A 1L1. \n \nThe officer shall update the file as well as GCMS and NCMS. Officers should refer to the NCMS and \nGCMS user guides for further details. \n \n \n8.20 Requests for information  \n \n \nRegional offices should not refer requests from the person concerned or depositors and guarantors for \ninformation about forfeiture or refunds directly to National Headquarters.  \n \nA CBSA regional office may contact CBSA Revenue Accounting and Reporting Division, on behalf of the \nperson concerned, and the bondsperson.  \n \nAn IRCC regional office may contact IRCC Accounting Operations, Revenue Unit, NHQ, on behalf of the \nperson concerned and the bondsperson. \n \nFor any financial coding or financial system transactional issues, the IRCC or CBSA officers should \ncontact their regional headquarters.  \n \n \n \n"
    },
    {
      "page": 36,
      "chars": 1049,
      "text": "ENF 8 Deposits and Guarantees \n2020-10-07 \n \n \n36 \nAppendix A:   Sample letter— Notification to Bondsperson re: Refund of Security \nDeposit \n \n \n \nClient ID: xx-xxxx-xxxx \n \n \n(Name of Guarantor \nAddress) \n \n \n(Date)  \n \n \n \nDear Mr/ Ms.XXXXXX: \n \nRE: (Name of client) - Security Deposit XXXXX (Bond #) \n \n \nThis is to notify you that (Name of client for whom cash bond posted) has complied with the  \nconditions of Security deposit (bond #) in the amount of $XXX (amount of bond) signed  \nby you on XXX (date). \n \nA requisition for refund for the Cash Bond has been forwarded to Revenue Accounting section \nin Ottawa.  Please allow eight to ten (8–10) weeks for processing. \n \n \nYours truly, \n \n \n \nName and signature of designated CBSA official  \nCanada Border Services Agency \n \n \n \n \nNote: This is a sample letter with suggested wording. Preference as to final wording, or the use of pre-\nprinted as opposed to micro-produced “originals” is left to the discretion of local managers provided the \ncontent remains consistent with the intent. \n \n \n"
    },
    {
      "page": 37,
      "chars": 1256,
      "text": "ENF 8 Deposits and Guarantees \n2020-10-07 \n \n \n37 \nAppendix B:   Sample letter— Notification to Bondsperson re: Refund of Security \ndeposit and cancellation of performance bond \n \n \n \n \nClient ID: xx-xxxx-xxxx \n \n \n(Name of bondsperson \nAddress) \n \n \n(Date) \n \n \nDear Mr./Ms. XXXXXX: \n \nRE:  Name of client - Security deposit XXX (Bond #) and Performance Bond XXX (Bond #) \n \nThis is to notify you that the $XXX(amount of bond) Security deposit XXX (bond #) \nand Performance Bond XXX (bond #) in the amount of $XXX (amount of bond)   \nboth signed by you on XXX (date) are no longer required. \n \nA requisition for refund for the Cash Bond has been forwarded to Revenue Accounting section \nin Ottawa.  Please allow eight to ten (8–10) weeks for processing. \n \nFurthermore, your obligations specified in the Performance Bond in the amount of $XXX  \n(amount of bond) are now null and void. \n \nYours truly, \n \n \nName and signature of designated CBSA official  \nCanada Border Services Agency \n \n \n \n \n \nNote: This is a sample letter with suggested wording. Preference as to final wording, or the use of pre-\nprinted as opposed to micro-produced “originals” is left to the discretion of local managers provided the \ncontent remains consistent with the intent. \n \n"
    },
    {
      "page": 38,
      "chars": 983,
      "text": "ENF 8 Deposits and Guarantees \n2020-10-07 \n \n \n38 \nAppendix C:   Sample letter— Notification to Guarantor re: Cancellation of \nPerformance Bond \n \n \n \nClient ID: xx-xxxx-xxxx \n \n \n(Name of Guarantor) \n(Address) \n \n \n(Date)  \n \n \n \nDear Mr/ Ms.XXXXXX: \n \nRE: (Name of client) - Performance Bond XXXXX (Bond #) \n \n \nThis is to notify you that (Name of client for whom guarantee posted) has complied with the  \nconditions of  Performance Bond (bond #) in the amount of $XXX (amount of bond) signed  \nby you on XXX (date). \n \nFurther, your obligations specified in the Performance Bond are now null and void. \n \n \nYours truly, \n \n \n \nName and signature of designated CBSA official  \nCanada Border Services Agency \n \n \n \n \n \n \n \n \nNote: This is a sample letter with suggested wording. Preference as to final wording, or the use of pre-\nprinted as opposed to micro-produced “originals” is left to the discretion of local managers provided the \ncontent remains consistent with the intent. \n"
    }
  ]
}