{
  "file": "/workspaces/legalnew/manuals/enf18-eng.pdf",
  "page_count": 31,
  "pages": [
    {
      "page": 1,
      "chars": 6503,
      "text": "ENF 18 Human or international rights violations \n2020-06-03 \n \n1 \nContents \n1 \nWhat this chapter is about ..................................................................................................................... 3 \n2 \nCanada’s Crimes Against Humanity and War Crimes Program objectives .......................................... 3 \n2.1 Remedies ........................................................................................................................................ 3 \n3 \nRelated Legislation ................................................................................................................................ 4 \n3.1 The Crimes Against Humanity and War Crimes Act ...................................................................... 4 \n3.2 The Extradition Act ......................................................................................................................... 4 \n3.3 The Immigration and Refugee Protection Act ................................................................................ 5 \n3.4 The Citizenship Act ......................................................................................................................... 6 \n4 \nForms .................................................................................................................................................... 6 \n5 \nInstruments and delegations ................................................................................................................. 6 \n6 \nDefinitions .............................................................................................................................................. 7 \n \n6.1  Differences between genocide and a crime against humanity..……………………………………..8 \n6.2 Differences between a war crime and a crime against humanity ................................................... 8 \n6.3 Differences between a crime against humanity, war crime and a terrorist act: .............................. 9 \n7 \nProgram Objectives – CBSA ................................................................................................................. 9 \n8 \nProcedure: Establishing inadmissibility under A35(1)(a) of the Immigration and Refugee Protection \nAct or exclusion under 1F(a) of the United Nations Refugee Agency’s Convention and Protocol \nrelating to the status of refugees. ........................................................................................................ 10 \n8.1 Establishing complicity.................................................................................................................. 10 \n8.2 The contribution-based test .......................................................................................................... 10 \n8.3 6 Factors – Contribution-based test for establishing complicity: .................................................. 11 \n8.4 Establishing complicity—brutal (limited purpose) organizations .................................................. 12 \n8.5 Other forms of complicity .............................................................................................................. 12 \n8.6 Defences ....................................................................................................................................... 13 \n8.7 Cases involving prior exclusion by the Refugee Protection Division (RPD) ................................. 16 \n9 \n Procedure: Establishing inadmissibility under A35(1)(b) ................................................................... 16 \n9.1 Designation of regimes ................................................................................................................. 17 \n9.2 Designated regimes pursuant to Section A35(1)(b) ..................................................................... 17 \n9.3 Requirements to establish inadmissibility ..................................................................................... 17 \n9.4 Opportunity for person to be heard ............................................................................................... 19 \n9.5 Consultation with CBSA HQ ......................................................................................................... 19 \n10 Procedure: How to assess A35 or 1F(a) cases ................................................................................... 19 \n10.1 Determining the general profile ................................................................................................... 19 \n10.2 Security vetting of Temporary and Permanent Resident visa applicants.................................... 20 \n11 Inadmissibility under paragraphs A35(1)(c), A35(1)(d) and A35(1)(e) ................................................ 20 \n11.1 A35(1)(c) Restricted entry / Imposed sanctions on a country ..................................................... 20 \n11.2 Inadmissibility under paragraphs A35(1)(d) and A35(1)(e) ......................................................... 20 \n12 Roles and responsibilities .................................................................................................................... 22 \n12.1 National Security Screening Division (NSSD) ............................................................................. 22 \n12.2 Intelligence Collection, Analysis and Production (ICAP) ............................................................. 22 \n12.3 Immigration Enforcement Division ............................................................................................... 23 \n12.4 Case Review Unit (CRU) ............................................................................................................. 23 \nAppendix A - War crimes amendments to the Immigration Act and Regulations ....................................... 24 \nAppendix B – Crimes Against Humanity an War Crimes Act ...................................................................... 25 \nAppendix C - Rome Statute of the International Criminal Court ................................................................. 26 \n(a) \nArticle 6—Genocide .................................................................................................................. 26 \n(b) \nArticle 7—Crimes against humanity .......................................................................................... 26 \n(c) \nArticle 8—War crimes ............................................................................................................... 27 \n \n \n \n"
    },
    {
      "page": 2,
      "chars": 1584,
      "text": "ENF 18 Human or international rights violations \n2020-06-03 \n \n2 \nUpdates to chapter \n \n \nListing by date: \n \nDate: 2020-06-03 \n \nTitle change of manual chapter: previous title of “War crimes and crimes against humanity” changed to \n“Human or international rights violations” \n \nList of designated regimes in section 9.2 amended to specify end-date for the interim government in \nRwanda as July 18, 1994 in order to reflect the change in regime which took place on July 19th, 1994. \n \nChanges made to section 8.6 to reflect Minister’s policy position on defence of duress.  \n \nSection 11:  content added to reflect legislative changes and addition of new inadmissibilities under \nparagraphs 35(1)(c), 35(1)(d) and 35(1)(e) of the IRPA. \n \nTitle of Canada’s War Crimes Program amended to Canada’s Crimes Against Humanity and War Crimes \nProgram (CAHWC). \n \nDate: 2016-12-01 \n \nChanges were made to ENF 18 to reflect the contribution test for complicity  \nSubstantive and minor changes as well as clarifications have been provided throughout the chapter  \n \nDate:  2005-12-15 \n \nChanges were made to ENF 18 to reflect the IRCC and CBSA policy and service delivery roles. \n \nAppendix E has been removed and a web site address has been given to direct the reader to the list of \ndesignated regimes online. Appendix F was renamed accordingly.  \n \nDate:  2004-01-23 \n \nA bullet was added to Appendix E of chapter ENF 18 and now reads as follows: \n \ndesignated November 21, 2003, the government of Ethiopia under Mengistu Haile Mariam for the period \nof September 12, 1974 to May 21, 1991. \n"
    },
    {
      "page": 3,
      "chars": 3195,
      "text": "ENF 18 Human or international rights violations \n2020-06-03 \n \n3 \n1 \nWhat this chapter is about \n \nThis Chapter describes Canada’s Crimes Against Humanity and War Crimes (CAHWC) Program and the \nCBSA’s role in the Program.  The chapter further outlines the inadmissibility provisions under section 35 \nof the Immigration and Refugee Protection Act (IRPA) for human or international rights violations and \nprovides guidance on how to determine if persons are inadmissible to Canada for alleged involvement in \nwar crimes, crimes against humanity and/or genocide.  \n \n \n2 \nCanada’s Crimes Against Humanity and War Crimes Program objectives \n \nThe goal of Canada’s CAHWC Program is to deny safe haven in Canada to war criminals and persons \nbelieved to have committed or been complicit in these crimes. \n \nThe Program is delivered as a partnership between the Canada Border Services Agency (CBSA), \nImmigration, Refugees and Citizenship Canada (IRCC), Department of Justice (Justice) and the Royal \nCanadian Mounted Police (RCMP).   \n \nThe CBSA administers and enforces the IRPA and the Immigration and Refugee Protection Regulations \n(IRPR) in denying inadmissible persons access to Canada at ports of entry, excluding claimants from \nrefugee protection, and removing inadmissible and excluded persons from Canada. \n \nIRCC applies the IRPA and IRPR when determining the admissibility of temporary and permanent \nresidents to Canada. IRCC also conducts the initial screening as part of the visa assessment process to \ndetermine if there are reasonable grounds to believe that the applicant has committed or was complicit in \nthe commission of war crimes, crimes against humanity and/or genocide.  IRCC, in coordination with \nJustice are responsible for citizenship revocation of individuals who have committed or were complicit in \nwar crimes, crimes against humanity and/or genocide.   \n \nUnder the Extradition Act legislation, Justice leads on cases involving extradition to foreign states or \nsurrender to international tribunals.  Justice also works with the Public Prosecution Service of Canada \n(PPSC) in criminal proceedings led by the PPSC.  Criminal proceedings are, in turn, based on \ninvestigations conducted by the RCMP under the Crimes Against Humanity and War Crimes Act . \n \n2.1 Remedies \n \nCanada’s CAHWC Program has several remedies available to deal with alleged war criminals and \nindividuals suspected of involvement in crimes against humanity and/or genocide: \n \n designation of governments and regimes considered to have engaged in gross human rights \nviolations under A35(1)(b) of the Immigration and Refugee Protection Act; \n \n denial of visas to persons outside of Canada under the Immigration and Refugee Protection Act; \n \n exclusion from refugee protection of the 1951 United Nations Convention Relating to the Status of \nRefugees; \n \n admissibility hearing and removal from Canada under the Immigration and Refugee Protection Act; \n \n prosecution in Canada under the Crimes Against Humanity and War Crimes Act;  \n \n revocation of citizenship under the Citizenship Act;  \n \n extradition upon request of a foreign government under Canada's Extradition Act; and,  \n"
    },
    {
      "page": 4,
      "chars": 1947,
      "text": "ENF 18 Human or international rights violations \n2020-06-03 \n \n4 \n \n surrender to an international tribunal (upon request) under Canada's Extradition Act.  \n \nThese remedies are available to the Government of Canada through its various bodies and not \nspecifically the CBSA.  Each department or agency is mandated under different legislation further \ndescribed below. \n \n \n3 \nRelated Legislation \n \nThe following is the list of applicable legislation and government of Canada departments mandated with \nthe enforcement against individuals who have committed or were complicit in the commission of war \ncrimes, crimes against humanity and/or genocide.  A description of the relevant provisions is also \nincluded.  \n \n3.1 The Crimes Against Humanity and War Crimes Act  \n \nMandate:  Justice and the RCMP \n \nThis Act:  \n \nprovides for the prosecution of any individual present in Canada for any offence stated in the Act \nregardless of where the offence occurred;  \n \n organizes offences of genocide, crimes against humanity, war crimes, and breach of responsibility by \nmilitary commanders and civilian superiors;  \n \n creates offences to protect the administration of justice at the International Criminal Court (ICC) \nincluding the safety of judges and witnesses; \n \n recognizes the need to provide restitution to victims of offences; and \n \n provides a mechanism to do so.  \n \n \n3.2 The Extradition Act  \n \nMandate:  Justice and the RCMP \n \nThis Act: \n \n provides Canada with the legal basis on which to extradite persons located in Canada, who are \nsought for extradition by one of Canada's \"extradition partners\".  \n \nExtradition partners are: \n \n countries with which Canada has an extradition agreement (bilateral treaties or multilateral \nconventions); \n \n countries with which Canada has entered into a case-specific agreement; or \n \n countries or international courts whose names appear in the schedule to the Extradition Act. \n \n"
    },
    {
      "page": 5,
      "chars": 2476,
      "text": "ENF 18 Human or international rights violations \n2020-06-03 \n \n5 \nJustice handles all of the extradition cases under their mandate.  The extradition process is \nprovided for reference only; this is not an avenue for the CBSA to pursue. \n \n3.3 The Immigration and Refugee Protection Act  \n \nMandate:  CBSA and IRCC  \n \nThis Act: \n \n provides for refusal of visas and Temporary and Permanent Resident status of persons found \ninadmissible abroad, including those inadmissible for war crimes, crimes against humanity and/or \ngenocide; \n  \n provides for the legal authority to investigate an allegation, review and report the allegation and issue \na removal order when the allegation is founded against individuals seeking entry or already in \nCanada.  Provides the opportunity for the Minister to grant relief for those found inadmissible under \nA35(1)(b); \n \n provides for the exclusion from the refugee determination process of persons who are inadmissible \nunder A35, including those involved in war crimes, crimes against humanity and/or genocide; \n \n provides for the designation of regimes considered to have engaged in gross human rights \nviolations, war crimes or crimes against humanity and/or genocide; and, \n \n limits appeal rights of persons involved in war crimes, crimes against humanity and/or genocide.   \n \n allows for the removal of A35 inadmissible persons to countries, even when there is a temporary stay \nof removal (TSR) and allows Canada to remove to a third country willing to take the individual even \nwhen it is not their former country of permanent residence/citizenship or a country from which the \nentered Canada.  \n \n \nTable:  Sections of the IRPA and the IRPR applying to human or international rights violations \n \nProvision \nAct and Regulations \nHuman or international rights violations \nA35 \nCommitting an act outside Canada that constitutes \na Crime Against Humanity or War Crimes Act; \nA35(1)(a) \nPrescribed senior official \nA35(1)(b) \nRestricted entry/imposed sanctions on a country \nA35(1)(c) \nSubject of order under Special Economic Measures \nAct (SEMA) \nA35(1)(d) \nListed under Justice for Victims of Corrupt Foreign \nOfficials Act (Sergei Magnitsky Law) \nA35(1)(e) \nMinisterial relief \nA42.1 \nException to non-refoulement \nA115(2)(b) \nPrescribed conclusive findings of fact for \ndetermining inadmissibility under A35(1)(a) \nR15 \nPrescribed conclusive findings of fact for \ndetermining inadmissibility under A35(1)(b) \nR16 \n \n \n \n \n"
    },
    {
      "page": 6,
      "chars": 2987,
      "text": "ENF 18 Human or international rights violations \n2020-06-03 \n \n6 \nExclusion from the Principle of Non-refoulement (A115(2)b)) \n \nIn most cases Convention refugees in Canada are protected from removal pursuant to 115(2)(a) of the \nIRPA.  An exception may, however, be made when a Convention refugee has been found inadmissible to \nCanada for the commission of human rights violations and a Minister’s Delegate at IRCC is of the opinion \nthat either the danger the person presents to the security of Canada or the nature and severity of their \nactions is greater than the risk they would face upon removal. \n \nIf an officer identifies a case where they feel it may be appropriate to seek an opinion under A115(2)(b), \nthey should consult the manual ENF 28 and contact the CBSA’s Danger Assessment Section.  \n \n \n3.4 The Citizenship Act   \n \nMandate:  IRCC and the RCMP \n \nThis Act: \n \n provides for the not granting of citizenship for security or criminality cases and also allows for the \nrevocation of citizenship obtained by fraud or misrepresentation for a number of reasons including \nmisrepresentation concerning war crimes, crimes against humanity and/or genocide. \n \n provides that citizenship shall not be granted while the person is under investigation by the Minister \nof Justice, the RCMP or the Canadian Security Intelligence Service (CSIS) for, or is charged with, on \ntrial for, subject to or a party to an appeal relating to, an offence under any of sections 4 to 7 of the \nCrimes Against Humanity and War Crimes Act. \n \n  \n4 \nForms \n \nNil. \n \n \n5 \nInstruments and delegations \n \nA4 sets out which Minister is responsible for the administration of the IRPA. The Minister of Citizenship \nand Immigration [also known as Immigration, Refugees and Citizenship Canada (IRCC)] and the Minister \nof Public Safety and Emergency Preparedness (PS) are jointly responsible for the administration and \nenforcement of the IRPA, however there are some differences. The IRCC Minister is responsible for the \noverall administration of the IRPA, unless otherwise specified. The Minister of PS has the primary \nresponsibility for the administration of the IRPA as it relates to the following:  \n \nport of entry examinations; \n \nenforcement of the IRPA including arrest, detention and removal; \n \nestablishment of policies respecting the enforcement of the IRPA and inadmissibility under \nA34/35/37; and \n \ndeclarations referred to under A42.1 (Ministerial Relief provision) \n \nPursuant to A6(1), the responsible Minister has the authority to designate any persons or classes of \npersons as officers to carry out any purpose of any provision of the IRPA, and to specify the powers and \nduties of the officers so designated. This is referred to as the designation of authority.  In addition, \nA6(2) authorizes that anything that may be done by the Minister under the Act may be done by a person \nthat the Minister authorizes in writing. This is referred to as delegation of authority.  \n"
    },
    {
      "page": 7,
      "chars": 3167,
      "text": "ENF 18 Human or international rights violations \n2020-06-03 \n \n7 \nEach Minister who has responsibilities under the IRPA has written an instrument of delegation and \ndesignation that is periodically updated. The Delegation of Authority and Designations of Officers (D & D) \ninstruments stipulate who has the authority to perform specific immigration-related functions. CBSA and \nIRCC personnel are designated by position to perform all delegated or designated authorities.  It is to be \nnoted that the IRPA D & D instruments have a hierarchical link which means only the lowest level of \nauthority is included in the D & D instruments as every position above this one (with a direct hierarchical \nlink) has the same authority to perform specific immigration-related functions. \n \nCBSA and IRCC officers should always review both the CBSA and the IRCC D & D instruments as they \nhave authorities delegated and designated under both instruments, which can be found on the IL 3-  \nDesignation of Officers and Delegation of Authority.  \n \nIt is important to note that while IRCC officers have been designated the authority to deny an application \nmade under the IRPA based on inadmissibility under A34 (security), A35 (violating human or international \nrights) and A37 (organized criminality), only CBSA officers may prepare and review A44(1) reports for \nthese inadmissibilities.  \n \nA35(1)(b) of the IRPA stipulates that the Minister (Public Safety) may designate a regime.  This authority \nis not delegated to any other person. \n \n \n6 \nDefinitions \n \nAs defined in the Crimes Against Humanity and War Crimes Act: \n \nWar Crime \nAn act or omission committed during an armed conflict that, at the time and \nin the place of its commission, constitutes a war crime according to \ncustomary international law or conventional international law applicable to \narmed conflicts, whether or not it constitutes a contravention of the law in \nforce at the time and in the place of its commission.    \n \nCrimes against \nhumanity \nMeans murder, extermination, enslavement, deportation, imprisonment, \ntorture, sexual violence, persecution or any other inhumane act or \nomission that is committed against any civilian population or any \nidentifiable group and that, at the time and in the place of its commission, \nconstitutes a crime against humanity according to customary international \nlaw or conventional international law or by virtue of its being criminal \naccording to the general principles of law recognized by the community of \nnations, whether or not it constitutes a contravention of the law in force at \nthe time and in the place of its commission. \nGenocide \nMeans an act or omission committed with intent to destroy, in whole or in \npart, an identifiable group of persons, as such, that, at the time and in the \nplace of its commission, constitutes genocide according to customary \ninternational law or conventional international law or by virtue of its being \ncriminal according to the general principles of law recognized by the \ncommunity of nations, whether or not it constitutes a contravention of the \nlaw in force at the time and in the place of its commission. \n"
    },
    {
      "page": 8,
      "chars": 2095,
      "text": "ENF 18 Human or international rights violations \n2020-06-03 \n \n8 \n6.1 Differences between genocide and a crime against humanity \n \n \nGenocide \n \nCrime against humanity \n \n \nAn act committed to destroy a group. \n \nAn act committed as part of a widespread or \nsystematic attack. \n \n \nThe perpertrator intended to destroy a group. \n \nThe perpertrator was aware of the widespread or \nsytematic attack and intended to commit the \ncriminal conduct. \n \n \nThe circle of victims, as defined by the Rome \nStatute, is relatively small and includes the \nfollowing groups defined by:  nationality, \nethnicity, race and religion.  In addition, the \nfollowing distinction was added in \nCanada:  any other identifiable group. \n \n \nThe circle of victims, as defined by the Rome \nStatute, is relatively small and includes the \nfollowing groups defined by:  nationality, ethnicity, \nrace and religion.  In addition, the following \ndistinction was added in Canada:  any other \nidentifiable group. \n \n \nGenocide always falls within the broader \ncategory of crimes against humanity. \n \n \n \n6.2 Differences between a war crime and a crime against humanity  \n \n \nWar Crime \n \nCrime against humanity \n \n \nCan be limited to a single criminal act. \n \nA single criminal act can only be considered \na crime against humanity if it is shown that \nthis one act was the result of the \nimplementation of a widespread or \nsystematic policy (Rome Statute of the \nInternational Criminal Court art. 7). \n \nCan only occur when a certain threshold of \nintensity is reached between parties in the conflict \n(Rome Statute of the International Criminal Court \nart. 8, 2(d)).   \n \nFor example,  police officers conducting \nthemselves in a violent manner during riots would \nnot necessarily constitue a war crime, but could \nbe a crime against humanity. \n \n \nCan occur in any setting: during international \nwar, civil war, and in times of peace.   \n \n \nFor example,  a particular atrocity such as \nthe killing of a civilian during a civil war can \nbe both a war crime and a crime against \nhumanity. \n \nCan be a crime against property. \n \n \n"
    },
    {
      "page": 9,
      "chars": 2816,
      "text": "ENF 18 Human or international rights violations \n2020-06-03 \n \n9 \n6.3 Differences between a crime against humanity, war crime and a terrorist act: \n \nA terrorist act generally has a wider application than a war crime, a crime against humanity and/or \ngenocide because:  \n \n it is different than a crime against humanity in that it can be committed against both persons and \nproperty; \n \n it can be an isolated incident — it does not have to be committed in a widespread or systematic \nmanner; \n \n it can be committed both in times of war and peace; \n \nCriminal conduct pertaining to terrorist acts tends to be limited to very serious acts against persons and \nproperty (see section 83.01(1)(b)(ii) of the Criminal Code Criminal Code).  Terrorist acts also have been \ncommitted to achieve a particular purpose and with a specific intention (see section 83.01(1)(b)(i) and \n83.01(1)(b)(ii) of the Criminal Code of Canada).  \n \nThis wider application is also reflected in section 34 of the IRPA, which makes any person who is or was \na member of a terrorist organization inadmissible.  \n \nAn officer may have an applicant who fits the description of all three crimes.  An example scenario would \nbe: \n  \n that a person was found to be a member of a group;   \n that the group the person belonged to conducted a bombing campaign;  \n that the incident occurred during a civil war.  \n \nIn this scenario it would be preferable to find such a person described in A34(1)(f) rather than in \nA35(1)(a).  The concept of membership to apply A35(1)(a) would not be sufficient as a result of the \ndecision by the Supreme Court of Canada in Rachidi Ekanza Ezokola v Minister of Citizenship and \nImmigration (2013) SCC40 (i.e. it would need to be proven that the person made a voluntary, knowing \nand significant contribution to the organization’s crime or criminal purpose) further described in Section 8 \nof this chapter.  \n \nNote:  Refer to Appendix C which lists articles 6, 7 and 8 of the Rome Statute of the International Criminal \nCourt. These articles provide further clarification and examples of what constitutes war crimes, crimes \nagainst humanity and/or genocide. \n \n \n7 \nProgram Objectives – CBSA \n \nPersons who have committed or including those who are complicit in the commission of a war crime, a \ncrime against humanity, genocide or any other reprehensible act, regardless of when or where these \ncrimes occurred, are not welcome in Canada. \n \nA four-pronged approach is taken when dealing with modern-day war criminals: \n \n refusing their overseas applications as permanent residents, refugees, or temporary residents; \n denying their entry to Canada at ports of entry; \n excluding them from the refugee determination process in Canada; and, \n finding them inadmissible and removing them from Canada \n \n \n"
    },
    {
      "page": 10,
      "chars": 2596,
      "text": "ENF 18 Human or international rights violations \n2020-06-03 \n \n10 \n8 \nProcedure: Establishing inadmissibility under A35(1)(a) of the Immigration \nand Refugee Protection Act or exclusion under 1F(a) of the United Nations \nRefugee Agency’s Convention and Protocol relating to the status of refugees. \n \nA35(1)(a) under the Immigration and Refugee Protection Act reads as follows:  \n \n35. (1)  A permanent resident or a foreign national is inadmissible on grounds of violating human rights or \ninternational rights for: \n \n(a) committing an act outside Canada that constitutes an offence referred to in sections 4 to 7 of \nthe Crimes Against Humanity and War Crimes Act; \n \nArticle 1F(a) of the United Nations Refugee Agency’s Convention and Protocol relating to the \nstatus of refugees reads as follows: \n \n1F The provisions of this Convention shall not apply to any person with respect to whom there are serious \nreasons for considering that: \n \n(a) he has committed a crime against peace, a war crime, or a crime against humanity as defined \nin the international instruments drawn up to make provision in respect of such crimes \n \nThis includes the following:  \n \n individuals who personally commit an offence;  \n \n individuals who attempt to commit an offence;  \n \n individuals who aid and abet, encourage, or are involved in the planning of an offence; \n \n individuals who occupy a position of command or superior responsibility with regards to those who \ncommitted the offense; \n \n \nindividuals who are complicit when an offence is committed.  \n \n \n8.1 Establishing complicity  \n \nThe Supreme Court of Canada (SCC) decision in the matter of Rachidi Ekanza Ezokola v Minister of \nCitizenship and Immigration (2013) changed how complicity in war crimes, crimes against humanity \nand/or genocide is to be assessed.  The court introduced the contribution-based test as the applicable \nlegal test to be applied by the Immigration Refugee Board (IRB) or immigration officers in-Canada or \noverseas. Eliminated components of the United Nations Refugee Agency’s Convention and Protocol \nrelating to the status of refugees 1F(a) jurisprudence, which are also applicable to IRPA A35(1)(a) \nanalysis, are: \n \n the elimination of complicity by mere association; and, \n \n the elimination of the presumption that mere membership in an organization with a limited brutal \npurpose is sufficient for an individual to be excluded from refugee protection or found inadmissible \nunder A35(1)(a). \n \n \n8.2 The contribution-based test \n \nThe key components of the contribution-based test jurisprudence are: \n"
    },
    {
      "page": 11,
      "chars": 2961,
      "text": "ENF 18 Human or international rights violations \n2020-06-03 \n \n11 \n \n Voluntary contribution to the group’s crime or criminal purpose: \n \nDecision makers are to consider the method of recruitment by the organization and any safe and early \nopportunity the person has had to dissassociate from the organization.  The voluntariness requirement \ncaptures the defense of duress.  The contribution to the crime or criminal purpose must be voluntarily \nmade; it cannot be made under duress. \n \n Significant contribution to the group’s crime or criminal purpose: \n \nThe mere association factor has now been replaced with a culpable complicity factor when a person \nmakes a significant contribution to the crime or criminal purpose of a group.  The degree of contribution \nmust be carefully assessed to prevent an unreasonable extension of criminal participation in international \ncriminal law.   \n \n Knowing contribution to the group’s crime or criminal purpose: \n \nThe person must be aware of the group’s crime or criminal purpose and aware that his or her conduct will \nassist in the furtherance of the crime or criminal purpose. \n \n8.3 6 Factors – Contribution-based test for establishing complicity: \n \nTo determine whether a person’s conduct meets the test for complicity, the following 6 factors should be \nconsidered in the decision maker’s analysis: \n \n The size and nature of the organization, including whether the organization was one with a brutal, \nlimited purpose; \n \n The part of the organization with which the person was most directly concerned: \n \nDecision makers should be aware that persons may not have been affiliated with all parts of the \norganization and could have been excluded from affiliating with the part that was involved in the crime or \ncriminal purpose.  The decision maker should drill down as far as possible in the organization so as to \nmore properly define the group to which the person is said to belong, especially with organizations that \nare hybrid or multi-faceted. \n \n The person’s duties and activities within the organization: \n \nThis factor is significant because it goes to the heart of a person’s day-to-day participation.  The decision \nmaker should look at the person’s day-to-day participation in regards to the duties and activities and \nconsider the link between these and the crimes and criminal purpose of the organization. \n \n The person’s position or rank in the organization; \n \n The length of time the person was in the organization, particularly after acquiring knowledge of the \ngroup’s crime or criminal purpose; and,  \n \n The method by which the personwas recruited and the person’s opportunity to leave the \norganization, \n \nThese factors are not exhaustive and are not given the same weight in all cases.  The focus must remain \non the person’s contribution to the crime or criminal purpose and the analysis.  The weight of each factor \nwill depend on the facts and context of each case. \n \n"
    },
    {
      "page": 12,
      "chars": 3724,
      "text": "ENF 18 Human or international rights violations \n2020-06-03 \n \n12 \n8.4 Establishing complicity—brutal (limited purpose) organizations  \n \nIn the decision of Rachidi Ekanza Ezokola v Minister of Citizenship and Immigration (2013) SCC40, the \nSupreme Court of Canada has stated that when looking at establishing complicity, the contribution-based \ntest should be applied.   \n \nA first step is to look at the size and nature of the organization. If the main purpose of the organization is \nthe involvement in war crimes, crimes against humanity and/or genocide, the factor with respect to such \nan organization may weigh more heavily than some of the other factors set out above.  A characterization \nof an organization as brutal only has an effect in relation to the other factors in the contribution-based test \nbut by itself can never lead to complicity.  The Supreme Court stated in the Ezokola decision of that “In \ncontrast, where the group is identified as one with a limited and brutal purpose it will be easier to establish \ncomplicity.  In such circumstances, a decision maker may more readily infer that the accused had \nknowledge of the group’s criminal purpose and that his conduct contributed to that purpose.” \n \n  \n8.5 Other forms of complicity   \n \nWhile the new contribution-based test for complicity set out in Ezokola replaces the former “personal and \nknowing participation test”, it also allows for the continued and direct application of international criminal \nlaw including modes of partial liability for the commission of international crimes, such as aiding and \nabetting based on article 25 of the Rome Statute, and also command or superior responsibility based on \narticle 28 of the Rome Statute. \n \nThe Canadian courts have determined that the following activities constitute aiding and abetting (as 1    \nform  of complicity):    \n \n handing over people to organizations (brutal or non-brutal) with the knowledge that these people \nwould come to harm; \n  \n providing information to organizations on individuals which result in harm to these individuals; \n \n providing support functions, such an being an intelligence officer, a driver or a bodyguard to \nmembers of the organization;  \n \n assisting in increasing the effectiveness of a limited brutal purpose organization, for example, by \nbeing a policeman in charge of political prisoners at a military hospital or being in charge of legal \ntraining with a police force.  \n \nIf the above examples of aiding and abetting do not fit the situation at hand, international criminal law can \nbe helpful in this regard. The aider and abettor carries out acts specifically directed to assist, encourage \nor lend moral support to the perpetration of a certain specific crime (murder, extermination, rape, torture, \nwanton destruction of civilian property, etc.), and this support has a substantial effect upon the \nperpetration of the crime. (Tadić (IT-94-1-A), Appeals Chamber, 15 July 1999 at para. 229.) \n \n While the concepts of command responsibility and superior responsibility have been introduced into \nCanadian criminal law and are now part of the Crimes Against Humanity and War Crimes Act (which is in \nturn based on article 28 of the Rome Statute) there has been no jurisprudence in Canada as of yet.  \nCommand responsibility applies to military hierarchies and superior responsibility applies to civilian \norganizations. \n \nHowever, international criminal law has been instrumental in providing clarifications for its various \nelements.  For example, a superior will be subject to individual criminal liability if the following elements \ncan be demonstrated: a superior-subordinate relationship; the superior knew or had reason to know \n"
    },
    {
      "page": 13,
      "chars": 3169,
      "text": "ENF 18 Human or international rights violations \n2020-06-03 \n \n13 \nthat a criminal act was about to be, was being or had been committed (the requisite mens rea); and a \nfailure to take necessary and reasonable measures to prevent or punish the conduct in question. \n \n8.6 Defences \n \nThe burden of proof with respect to defences lies with the person concerned, i.e. it has to be raised and \nproven by that person.  Two common defences in immigration/refugee law are superior orders and \nduress. \n \nSuperior Orders:    \n \nA common defence of a person who committed a war crime, genocide, or a crime against humanity is \nbased on the concept of superior orders; i.e., the position held required the individual to follow orders \nfrom the government or a superior officer.  Although this defence may be used in arguing for a lighter \nsentence in a criminal prosecution, it is not relevant for the purposes of the IRPA and cannot overcome \ninadmissibility under A35(1)(a) or 1F(a) exclusion, except if the person concerned can show that the order \nfollowed was not manifestly unlawful; a difficult test to meet.   \n \n \nDuress:  \n \nThe Ministers' policy position regarding the appropriate test for the defence of duress, when it is raised in \nthe context of assessments under A35(1)(a) or 1F(a) exclusion under A98, is one which adopts a \nharmonized approach based on Canadian criminal law, Canadian immigration law and international \ncriminal law. \n1. When assessing the defence of duress for inadmissibility under paragraph 35(1)(a) of the IRPA or \nfor a 1F(a) exclusion under section 98 of the IRPA, we must rely on international criminal law. \nThis was articulated by the Federal Court of Appeal in Ramirez v. Canada (Minister of \nEmployment and Immigration), 1992 CanLII 8540 (FCA) \n2. However, the defence of duress under international criminal law has changed since Ramirez was \nrendered. The current state of the test is codified in article 31(1)(d) of the Rome Statute of the \nInternational Criminal Court . The test for duress set out in article 31(1)(d) of the Rome Statute \ntherefore applies. \n3. The Canadian criminal law test for the defence of duress set out by the Supreme Court of \nCanada in in R v. Ryan, 2013 SCC 3 should only be relied upon as an interpretive aid (see “For \ncross-reference purposes only: Test under Ryan” below). \nThe following is a summary of the elements of the test to be applied: \n1. There must be a threat of imminent death or of continuing or imminent serious bodily harm; \n2. Such threat is required to be made by other persons or constituted by other circumstances \nbeyond the control of the person concerned; \n3. The threat must be directed against the person concerned or some other person; \n4. The person concerned must act necessarily and reasonably to avoid this threat; \n5. In so acting the person concerned does not intend to cause a greater harm than the one sought to \nbe avoided. \n \nDetails of Minister's harmonized interpretation: \nThe Minister's position is that the elements of the international criminal law test for the defence of \nduress are in harmony with the elements found in the domestic criminal law test. \n"
    },
    {
      "page": 14,
      "chars": 3902,
      "text": "ENF 18 Human or international rights violations \n2020-06-03 \n \n14 \nIn accordance with the Minister's interpretation, both tests recognize that responsibility for the commission \nof a crime disappears when: \n \nthe \"accused person\" (the person who is alleged to have committed the crime) committed the \ncrime in circumstances which removed the \"accused's\" ability to exercise free will (i.e., the act was \nno longer voluntary / the \"accused\" was compelled to act), because of  \no \na threat of death or serious bodily harm to the \"accused\" or another person which \noutweighed the harm which the \"accused\" was being forced to inflict. \nBoth tests consist of stringent elements which must be met in order for the defence to apply. Those \nelements are harmonized as follows: \n1. There must have been a \"threat of death or serious bodily harm\";  \ni. \nthe threat must have been made by other persons or constituted by other circumstances \nbeyond the control of the \"accused\"; \nii. \na merely abstract danger or simply an elevated probability that a dangerous situation \nmight occur will not suffice; \niii. \nthe threat must have been objectively present and not merely exist in the perpetrator's \nmind (the \"accused\" must reasonably have believed that the threat would be realized); \niv. \nthe threat must have been directed against the \"accused\" or some other person. \n2. There must have been a \"close temporal connection\" between the threat and the harm \nthreatened;  \ni. \na \"close temporal connection\" is sufficient to show that the threat was not too far removed \nin time or too vague in terms of its timing; \nii. \na \"close temporal connection\" supports a finding that it is reasonable to believe that the \ndegree of pressure placed on the \"accused\" was sufficient for the \"accused\" to lose the \nability to act freely (the \"accused\" therefore acted in an involuntary manner); \niii. \n\"close temporal connection\" does not require that the harm threatened occurred \nimmediately (threats of future harm may be considered). Future harm is evaluated in the \ncontext of whether there still remained a sufficiently close temporal connection to the \nthreat; \niv. \n\"imminent\" under the Rome Statute is understood to mean \"close temporal connection\" as \nthis phrase is used by the SCC in Ryan. \n3. There must have been a \"close temporal connection\" between the threat and the act of the \n\"accused\" in order to determine whether there was any legal way of averting the act;  \ni. \na \"close temporal connection\" is sufficient to show that the threat was not too far removed \nin time or too vague in terms of its timing; \nii. \na \"close temporal connection\" supports a finding that it is reasonable to believe that the \ndegree of pressure placed on the \"accused\" was sufficient for the \"accused\" to lose the \nability to act freely (to have acted in an involuntary manner); \niii. \n\"imminent\" under the Rome Statute is understood to mean \"close temporal connection\" as \nthis phrase is used by the SCC in Ryan. \n4. There must have been no legal way of averting the act based on a modified objective standard \n(this reflects both the position in Ryan and the Rome Statute's requirement to have acted \nnecessarily and reasonably to avoid the threat)  \ni. \na threat results in duress only if it is not otherwise avoidable (i.e., if a reasonable person \nin comparable circumstances would not have submitted and would not have been \ndriven to the relevant criminal conduct; no other available alternative course of evasive \naction that could reasonably have been expected to be taken; could not have fairly \nbeen expected to withstand or assume the risk); \nii. \nacting necessarily and reasonably to avoid a threat does not require special valour, \nprowess or heroism which, by definition, go beyond the call of a reasonable person; \niii. \npart of this analysis includes an evaluation of whether there was a safe avenue of \nescape; \n"
    },
    {
      "page": 15,
      "chars": 3623,
      "text": "ENF 18 Human or international rights violations \n2020-06-03 \n \n15 \niv. \npart of this analysis includes an evaluation of whether the predicament in which the \n\"accused\" finds himself or herself was of his or her own making or consistent with his or \nher own will (e.g., where the \"accused\" becomes (or remains) a party to an association \nin which he or she knowingly accepted a risk that, as a result of such association, he or \nshe could be compelled to commit such a crime). Voluntarily associating oneself \n(joining or remaining associated) with such knowledge would not meet the requirement \nto act necessarily and reasonably; \nv. \nthe \"modified objective standard\" refers to assessing how a reasonable person in the \nsame situation as the \"accused\" and with the same personal circumstances and \nexperiences as the \"accused\" would have acted (e.g., concluding whether or not there \nwas no legal way of averting the act, such as a safe avenue of escape). \n5. There must have been a measure of proportionality between the harm threatened and the harm \nwhich the \"accused\" inflicted on the victim(s). The harm threatened must outweigh the harm \ninflicted. This should be based on a modified objective standard;  \ni. \npart of this analysis includes an evaluation of the severity of the bodily harm that was \nthreatened; \nii. \nthe \"modified objective standard\" refers to assessing how a reasonable person in the \nsame situation as the \"accused\" and with the same personal circumstances and \nexperiences as the \"accused\" would have acted (e.g., concluding whether or not the \nharm being threatened outweighed the harm inflicted on the victim(s)). \n \nFor cross-reference purposes only: Test under Ryan \nThe Supreme Court of Canada in R. v Ryan, 2013 SCC 3 (CanLII), at paragraph 55, set out the test for \nthe defence of duress in Canadian criminal law as follows: \n1. an explicit or implicit threat of death or bodily harm proffered against the \"accused\" or a third \nperson. The threat may be of future harm. Although, traditionally, the degree of bodily harm was \ncharacterized as \"grievous\", the issue of severity is better dealt with at the proportionality stage, \nwhich acts as the threshold for the appropriate degree of bodily harm; \n2. the \"accused\" reasonably believed that the threat would be carried out; \n3. the non-existence of a safe avenue of escape, evaluated on a modified objective standard; \n4. a close temporal connection between the threat and the harm threatened; \n5. proportionality between the harm threatened and the harm inflicted by the \"accused\". This is also \nevaluated on a modified objective standard; \n6. the \"accused\" is not a party to a conspiracy or association whereby the \"accused\" is subject to \ncompulsion and actually knew that threats and coercion to commit an offence were a possible \nresult of this criminal activity, conspiracy or association. \n \nApplication of the defence of duress: \n \nWhen an allegation under A35(1)(a) or 1F(a) of the Refugee Convention is made before the \nImmigration and Refugee Board of Canada (IRB), and the person concerned has raised the issue \nof duress, it will be an IRB member who decides whether the defence has been sufficiently \nestablished. \n \nWhen the defence of duress is raised, CBSA Hearings Officers, who represent the relevant \nMinister before the IRB (either for an allegation under A35(1)(a) or an allegation under 1F(a) of \nthe Refugee Convention), should argue whether the defence of duress has been sufficiently \nestablished based on the facts of the case and the Minister's position on the applicable test for \nthe defence of duress. \n"
    },
    {
      "page": 16,
      "chars": 3600,
      "text": "ENF 18 Human or international rights violations \n2020-06-03 \n \n16 \n \nIn the context of considering writing a report under A44(1) or referring a report under A44(2) for \ninadmissibility under A35(1)(a), or in the context of a claim being made for refugee protection \nwhere article 1F(a) of the Refugee Convention is a possible issue, and when the defence of \nduress is raised, the officer should record and document any evidence of duress that has been \nraised. In these circumstances, officers/ Minister’s Delegates  are not to make a decision on \nwhether the defence of duress has been made out. \n \n \nIn the context of considering an application for permanent residence from inside Canada, Senior \nImmigration Officers, when deciding whether the person concerned has or has not satisfied the \nofficer that the person concerned is not inadmissible to Canada under A35(1)(a), should record \nand document any evidence of duress. \n \nWhen A35(1)(a) is at issue during the processing of a visa application, and the person concerned \nhas raised the defence of duress, it will be an IRCC Migration Officer who decides whether the \ndefence has been sufficiently established. IRCC Migration Officers should record and document \nany evidence of duress that has been raised. \nIRCC Migration Officers should consider the policy position on the appropriate test for the \ndefence of duress as articulated in this manual chapter. \n \n8.7 Cases involving prior exclusion by the Refugee Protection Division (RPD)  \n \nSection R15(b) of the Immigration and Refugee Protection Regulations (IRPR) has established that the \nfindings of fact pursuant to section F of Article 1 of the United Nations Refugee Agency’s Convention and \nProtocol relating to the status of refugees [1F(a)] are conclusive during an IRPA A35(1)(a) assessment.  \n \nAn example would be where the person has previously been in Canada and the officer has evidence that \nthe Refugee Protection Division has excluded the person from refugee determination under 1F(a).  In \nmost instances there would be no need to conduct any further investigation to establish further facts \nunder A35(1)(a), as long as the decision maker can demonstrate that these facts would stand up using \nthe new contribution-based test. In most cases, RPD decisions made before the Ezokola decisions can \nbe utilized without having to apply the new complicity test. \n \nThere will be situations where the person provides the officer with additional information that was not \navailable at the time of the Refugee Protection Division exclusion. The decision maker must take into \naccount any new and credible evidence regarding the inadmissibility.  Any such additional information \nmust be accepted and has to be assessed to demonstrate the contribution-based test.  \n \nBoth submissions by the applicant as well as the CBSA can be found to be new evidence, provided that \nthey were not before the Refugee Protection Division.  Where relevant and credible evidence is brought \nforward that requires consultation with CBSA HQ, officers may contact the Case Review Unit. \n \nR15 also considers a decision by any international criminal tribunals established by resolution of the \nSecurity Council of the United Nations or by the ICC as a conclusive finding of fact for the purposes of \ninadmissibility under A35(1)(a), as well as a decision by a Canadian court pursuant to the Criminal Code \nof Canada or the Crimes against Humanity and War Crimes Act.   \n \nFor case law on complicity, refer to ENF24 Appendix H. \n \n \n9 \n Procedure: Establishing inadmissibility under A35(1)(b)  \n \n \n"
    },
    {
      "page": 17,
      "chars": 2719,
      "text": "ENF 18 Human or international rights violations \n2020-06-03 \n \n17 \n9.1 Designation of regimes  \n \nA person cannot be described in A35(1)(b) unless the government concerned has been designated by the \nMinister of Public Safety as a regime that has been involved in terrorism, systematic or gross human \nrights violations, a war crime, crime against humanity or genocide within the meaning of subsections 6(3) \nto (5) of the Crimes Against Humanity and War Crimes Act.  \n \n9.2 Designated regimes pursuant to Section A35(1)(b) \n \nDesignated June 16, 1993, extended on August 15, 1997: the Bosnian Serb regime between March 27, \n1992 and October 10, 1996. \n \nDesignated October 12, 1993: the Siad Barré regime in Somalia between 1969 and 1991. \n \nDesignated April 8, 1994: the former military governments in Haiti between 1971 and 1986, and between \n1991 and 1994, except the period August to December 1993. \n \nDesignated October 21, 1994: the former Marxist regimes of Afghanistan between 1978 and 1992. \n \nDesignated September 3, 1996, amended September 9, 2004: the governments of Ahmed Hassan Al–\nBakr and Saddam Hussein in power in Iraq between 1968 and May 22, 2003. \n \nDesignated April 27, 1998: the Government of Rwanda under President Habyarimana between October \n1990 and April 1994, as well as the interim government in power between April 1994 and July 18, 1994. \n \nDesignated June 30, 1999, amended March 14, 2001: the governments of the Federal Republic of \nYugoslavia and the Republic of Serbia (Milosevic) between February 28,1998, and October 7, 2000. \n \nDesignated March 14, 2001, amended September 9, 2004: the Taliban regime in Afghanistan between \nSeptember 27, 1996 and December 22, 2001. \n \nDesignated November 21, 2003: the Government of Ethiopia under Mengistu Haile Mariam between \nSeptember 12, 1974 and May 21, 1991. \n \nThe CBSA, in consultation with Immigration, Refugee, Citizenship Canada’s (IRCC) International Region \nand Global Affairs Canada (GAC), provides a recommendation to the Ministers that a particular \ngovernment should be designated. The following are among the factors that will be considered in deciding \nwhether a regime should be designated:  \n \n condemnation by other countries and organizations;  \n \n the overall position of the Canadian government, including whether accepting a refugee claim by a \nsenior member of the government would undermine Canada's strong position on human rights;  \n \n the nature of the human rights violations; and \n \n immigration concerns such as the number of persons coming from that specific country and whether \nthere might be a concern for the protection of Canadian society. \n \n \n \n9.3 Requirements to establish inadmissibility  \n \n \n"
    },
    {
      "page": 18,
      "chars": 3042,
      "text": "ENF 18 Human or international rights violations \n2020-06-03 \n \n18 \nPersons who are described in A35(1)(b) may be broken down into three categories, each with its own \nevidentiary requirements, as set out in the following table:  \n \n \nCategory \n \nEvidence required \nNotes \n1. Persons described \nin R16(a), R16(b), \nR16(f) \n(ambassadors only), \nand R16(g) \nDesignation of regime  \n \nProof of position  \nA person in this group is presumed to be or to have \nbeen able to exert significant influence on the \nexercise of that government's power. This is a non-\nrebuttable presumption which has been upheld by the \nFederal Court of Appeal. In other words, the fact that \na person is or was an official in this category is \ndeterminative of the allegation. Aside from the \ndesignation and proof that the person holds or held \nsuch a position, no further evidence is required to \nestablish inadmissibility. \n \n2. Persons described \nin R16(c), R16(d), \nR16(e), and R16(f) \n(senior diplomatic \nofficials only)  \nDesignation of regime  \n \nProof of position held \n \nProof that position is \nsenior (see the note \nfollowing this table) \nIn addition to the evidence required, it must be \nestablished that the position the person holds or held \nis a senior one. In order to establish that the person's \nposition was senior, the position should be related to \nthe hierarchy in which the functionary operates. \nCopies of organization charts can be located from the \nEuropa World Year Book, Encyclopedia of the Third \nWorld, Country Reports on Human Rights Practices \n(U.S. Department of State). If it can be demonstrated \nthat the position is in the top half of the organization, \nthe position can be considered senior. This can be \nfurther established by evidence of the responsibilities \nattached to the position and the type of work actually \ndone or the types of decisions made (if not by the \napplicant then by holders of similar positions). \n \n3. Persons not \ndescribed in R16 \n \nDesignation of \nregime \n \nProof that the person \ncould exercise \nsignificant influence or \nwas able to benefit \nfrom the position \n \nIn addition to the designation of the regime, it must be \nestablished that the person, although not holding a \nformal position, is or was able to exercise significant \ninfluence on the actions or policies of the regime or \nwas able to benefit from the position. \nA person who assists in either promoting or sustaining \na government designated by the Minister can be \ncharacterized as having significant influence over its \npolicies or actions.  \n \nThe concept of significant influence is not limited to \npersons who made final decisions on behalf of the \nregime; it also applies to persons who assisted in the \nformulation of these policies, e.g., by providing advice, \nas well as persons responsible for carrying them out, \nas long as the influence or benefit occurred at a high \nlevel and not an average situation applicable to large \ncategories of people. If a person conducts activities \nwhich directly or indirectly allow the regime to \n"
    },
    {
      "page": 19,
      "chars": 2819,
      "text": "ENF 18 Human or international rights violations \n2020-06-03 \n \n19 \nimplement its policies, the test for significant influence \nis met. The phrase \"government power\" in R16 is not \nlimited to powers exercised by central agencies or \ndepartments but can also refer to entities that \nexercise power at the local level.  \nOnce it is established that the person exerted \nsignificant influence or benefited, the extent or degree \nof this influence or benefit is not relevant to the finding \nof inadmissibility; however, they are factors that could \nbe considered by the Minister when deciding whether \na declaration of relief under A42.1 would not be \ncontrary to the national interest. \n \n \nThere is no definition of \"senior official\" in the IRPA but the Federal Court has held on a number of \noccasions that ‘senior’ applies to the top 50% of an organization. \n \n9.4 Opportunity for person to be heard  \n \nIf an officer is reporting the person for an allegation under A35(1)(b), the applicant must be given an \nopportunity to demonstrate that their position is not senior as described in R16 (category 2) or that they \ndid not or could not exert significant influence on their government's actions, decisions, or policies and did \nnot benefit from their position (category 3). This can be done by mail or by personal interview. In either \ncase, the officer should provide the applicant with copies of all unclassified documents that will be \nconsidered in assessing admissibility.    \n \n9.5 Consultation with CBSA HQ \n \nOfficers should be aware of the sensitive nature of A35(1)(b) and the need for careful and thorough \nconsideration of all relevant information. It is not intended that officers should cast the net so widely that \nall employees of a designated regime are considered inadmissible.  \n \n \nBefore considering the refusal of an applicant whose position is not listed in R16 or writing an A44 for \nan allegation of inadmissibility, officers are requested to consult with CBSA Case Management (HQ). \n \nFor Port of Entry and in-Canada cases \n10 Procedure: How to assess A35 or 1F(a) cases  \n \n \n10.1 Determining the general profile \n \nWhen reviewing an application for entry into Canada or investigating an allegation of inadmissibility for \npersons in Canada, applicants who are from countries where there is/was war, internal turmoil, genocide, \nor where human rights abuses are/were widespread and who are one of the following qualify for more in-\ndepth investigation:  \n \n senior government officials, diplomats or employees of the government; \n \n current and former military, para-military, security, intelligence and police personnel or individuals \nemployed in technical or scientific backgrounds related to chemical or biological weapons; \n \n close family relatives of heads of government/state;  \n \n"
    },
    {
      "page": 20,
      "chars": 2753,
      "text": "ENF 18 Human or international rights violations \n2020-06-03 \n \n20 \n persons suspected of being members of an organization that is involved in terrorism or crimes \nagainst humanity; or  \n \n members of guerrilla groups.  \n \n10.2 Security vetting of Temporary and Permanent Resident visa applicants \n \nIRCC visa officers processing temporary and permanent resident visa applications should be aware that \nan Immigration Control (IC) manual outlines procedures for security screening.   \n \n \n \n11 Inadmissibility under paragraphs A35(1)(c), A35(1)(d) and A35(1)(e)  \n \n11.1 A35(1)(c) Restricted entry / Imposed sanctions on a country \n \nA person is inadmissible on grounds of violating human or international rights for: \n \n \nA35(1)(c) Being a person, other than a permanent resident, whose entry into or stay in Canada is \nrestricted pursuant to a decision, or, resolution, or measure of an international organization of states \nof which Canada is a member that imposes sanctions on a country against which Canada has \nimposed or has agreed to impose sanctions in concert with that organization or association. \n \nThe officer may obtain evidence for A35(1)(c) by collecting: \n \n \nProof that the person concerned is a citizen of a country against which Canada has imposed or has \nagreed to impose sanctions;  \n \nProof of the international organization of states or association of states valid decision, resolution or \nmeasure (see also ENF 2, Evaluating Inadmissibility); and \n \nOther documentary evidence including, but not limited to, media articles, scholarly journals, expert \nevidence (i.e. evidence from a person who is a specialist in a subject and who may present an \n“expert” opinion). \n \nThe following considerations apply to inadmissibility under A35(1)(c): \n \n \n35(1)(c) only applies to foreign nationals (it does not apply to permanent residents). \n \n35(1)(c) may be used to deny entry to foreign nationals who are listed by an organization or \nassociation of states. \n \nCanada must be a member of that organization or association of states. \n \nThe restricted entry must be pursuant to sanctions imposed “on a country”.  \n \nCanada must have agreed to impose sanctions in concert with that organization or association of \nstates. There is no requirement of complicity, intent or purpose. \n \n11.2 Inadmissibility under paragraphs A35(1)(d) and A35(1)(e) \n \n \nA person is inadmissible on grounds of violating human or international rights for: \n \n \nA35(1)(d) Being a person, other than a permanent resident, who is currently the subject of an \norder or regulation made under section 4 of the Special Economic Measures Act on the grounds \nthat any of the circumstances described in paragraph 4(1.1)(c) or (d) of that Act has occurred. \n"
    },
    {
      "page": 21,
      "chars": 3592,
      "text": "ENF 18 Human or international rights violations \n2020-06-03 \n \n21 \n \n \nA35(1)(e) Being a person, other than a permanent resident, who is currently the subject of an \norder or regulation made under section 4 of the Justice for Victims of Corrupt Foreign Officials Act \n(Sergei Magnitsky Law). \n \nBill S-226, created the Justice for Victims of Corrupt Foreign Officials Act (Sergei Magnitsky Law) and \nmade related amendments to the Special Economic Measures Act (SEMA) and the IRPA. The bill was \npassed and received Royal Assent on October 18, 2017. \nPursuant to Bill S-226, sanctions may be made against foreign nationals who have committed gross \nviolations of internationally recognized human rights or who have committed significant corruption. As \nsuch, the Government of Canada will publish, update and maintain comprehensive lists of foreign \nnationals who are responsible for, or complicit in gross violations of human rights or significant corruption. \nThe names on these lists include foreign nationals who are subject to an order or regulation under the \nJustice for Victims of Corrupt Foreign Officials Act (Sergei Magnitsky Law) or SEMA. \n \n \nJustice for Victims of Corrupt Foreign Officials Act (Sergei Magnitsky Law) \n \nThe Justice for Victims of Corrupt Foreign Officials Act (Sergei Magnitsky Law) enables the Governor in \nCouncil to issue an order or regulation restricting or prohibiting certain activities in relation to a foreign \nnational who is responsible for, or complicit in gross violations of human rights. An order or regulation \nunder this Act may also be made in respect of foreign public officials who are responsible for, or complicit \nin, acts of significant corruption. The comprehensive list is accessible through the Justice Canada website \n(https://laws.justice.gc.ca/eng/regulations/SOR-2017-233/page-2.html#docCont). \n \n \nSpecial Economic Measures Act \n \nThe Special Economic Measures Act (SEMA) came into force in 1992 to permit Canada to impose \nsanctions against foreign states and their nationals. The Justice for Victims of Corrupt Foreign Officials \nAct (Sergei Magnitsky Law) amends SEMA by expanding the grounds upon which the Governor in \nCouncil may cause to be seized, frozen or sequestrated any property in Canada that is held by or on \nbehalf of a foreign state, any person in that foreign state, or a national of that foreign state who does not \nordinarily reside in Canada. When sanctions are imposed under the Act, the names of listed persons are \npublished in a schedule to the relevant regulations.  \n \nProcedures for A35(1)(d) and A35(1)(e): \n \nIn cases where an individual is listed under the Justice for Victims of Corrupt Foreign Officials (Sergei \nMagnitsky Law) or the SEMA, a lookout will be created in the Integrated Customs Enforcement System \n(ICES) and a Secure Tracking System (STS) case will be created by the National Security Screening \nDivision (NSSD). Officers will need to confirm biographic details of the foreign national. Foreign nationals \nwho are confirmed to be positive matches to the list meet the reasonable grounds to believe standards for \ninadmissibility under A35(1)(d) or A35(1)(e).  \n \nBefore proceeding with an inadmissibility report or a visa refusal, officers must determine whether:  \n \n \nthe individual is a foreign national; and  \n \nthe individual is currently the subject of an order or regulation under section 4 of the SEMA on the \ngrounds described in paragraph 4(1.1)(c) or (d); or under section 4 of the Justice for Victims of \nCorrupt Foreign Officials Act (Serguei Magnitski Law). \n \n"
    },
    {
      "page": 22,
      "chars": 3132,
      "text": "ENF 18 Human or international rights violations \n2020-06-03 \n \n22 \nIn the event of a suspected name match, other biographic details (i.e. full name, date of birth, place of \nbirth, and/or citizenship, etc. where available) shall be confirmed against the CBSA master sanctions list. \n \n \nAt ports of entry, officers may contact the Border Operations Centre (BOC) to assist in \ndetermining whether the foreign national is, in fact, a positive match to the CBSA master \nsanctions list.  \n \n \nAt inland or overseas offices, when encountering a suspected match, officers may send an email \nduring business hours (8am to 4pm EST) to the NSSD’s Security Screening Intelligence Unit’s \n(SSIU) mailbox at CBSA HQ to initiate the verification process. After business hours, officers are \nto contact the CBSA’s Border Operations Centre. \n \nNote:  Pursuant to A35(2), there is a temporal aspect to inadmissibility under A35(1)(d) and A35(1)(e). \nDespite section 33 of the IRPA, a person who ceases being the subject of an order or regulation referred \nto in A35(1)(d) or (e) is no longer inadmissible under that paragraph. In other words, an individual is only \ninadmissible as long as they are currently listed. \n \n \nThe details supporting why an individual is, or was, listed are not relevant for determining \ninadmissibility under A35(1)(d) or A35(1)(e). \n \n \nThe details for listing the foreign national are not in the possession of the CBSA and therefore the \nCBSA is not under an obligation to disclose. With respect to determining inadmissibility under \nA35(1)(d) or A35(1)(e) of the IRPA, the position of CBSA is that the only relevant information is that \nrelated to the foreign national’s identity.  \n \n \nWhile Ministerial relief under A42.1 is available for inadmissibility under A35(1)(c), it is not available \nfor inadmissibility under A35(1)(d) and/or A35(1)(e). \n \n \nShould a delisted foreign national be encountered, the officer must evaluate other inadmissibility \ngrounds under IRPA as outlined in ENF 1 and ENF 2. \n \n \n \n12 Roles and responsibilities \n \n \n \n12.1 National Security Screening Division (NSSD) \n \nThe NSSD is located within the Intelligence and Enforcement Branch at CBSA HQ and is responsible for \nscreening temporary and permanent resident applicants as well as refugee claimants for involvement in \norganized crime, crimes against humanity, genocide, terrorism, espionage and subversion. The NSSD \nalso develops assessments and provides recommendations on security screening referrals to IRCC \noffices (both domestically and internationally) and CBSA offices. \n \n12.2  Intelligence Collection, Analysis and Production (ICAP) \n \nThe Intelligence Collection, Analysis and Production Division of the Intelligence and Enforcement Branch \nat CBSA collects, analyses and disseminates actionable intelligence on individuals, organizations and \nevents of security concern.  The division conducts trend analyses and produces threat assessments and \nscreening aids on current issues and/or groups including those related to foreign interference, espionage, \nwar crimes, crimes against humanity and genocide.  \n  \n"
    },
    {
      "page": 23,
      "chars": 1954,
      "text": "ENF 18 Human or international rights violations \n2020-06-03 \n \n23 \n12.3 Immigration Enforcement Division  \n \nThe Immigration Enforcement Division  of the Intelligence and Enforcement Branch at CBSA HQ, is \nresponsible for: \n \n coordination of the CBSA program input into Canada’s CAHWC Program administration documents \nand agreements including the annual reports, performance measurements, evaluations, etc. \n \n shared responsibility for governance of the program by representing  the CBSA at the Program \nCoordination Operations Committee (PCOC) along with the CBSA’s Case Review section.  The unit \nrepresents the CBSA and works closely with program partners in Justice, the RCMP and IRCC in \npolicy development and program administration, setting of program priorities, and accountability for \nprogram performance including annual reporting, implementation of performance measurements and \nevaluations. \n  \n updates of the ENF 18 manual relating to Human or international rights violations. \n \n providing functional direction and program policy development related to assessment of \ninadmissbility under A35, including Canada’s CAHWC Program. \n \n \n \n \n12.4 Case Review Unit (CRU) \n \nThe Case Review Unit is located within the Case Management Directorate as part of the Intelligence and \nEnforcement Branch at CBSA HQ and is responsible for providing advice to the regions concerning case \nspecific enforcement options.  The unit is also responsible for managing, tracking and reporting on high \nprofile cases in consultation with program areas, IRCC and the regions.  It works closely with IRCC to \nresolve inadmissibility issues and responds to information requests on immigration cases from senior \nmanagement, the Minister’s Office, IRCC and stakeholders.  The CBSA’s Case Review Unit is \nresponsible for producing case chronologies; a weekly report on high-profile immigration cases; and \nmanagement of the “Wanted by the CBSA” program. \n \n \n"
    },
    {
      "page": 24,
      "chars": 2758,
      "text": "ENF 18 Human or international rights violations \n2020-06-03 \n \n24 \nAppendix A - War crimes amendments to the Immigration Act and Regulations \n \nApril 10, 1978 – The Immigration Act 1976 came into force. The Act marked a significant shift in \nCanadian immigration policy in limiting the wide discretionary powers of the Minister of Manpower and \nImmigration. \n \nOctober 30, 1987 - Bill C-71 created 19(1)(j), a new ground of inadmissibility pertaining specifically to war \ncrimes and crimes against humanity.  \n \nJanuary 1, 1989 - Bill C-55 added to the Immigration Act the exclusionary clauses of the 1951 \nConvention Relating to the Status of Refugees. Article 1F(a) of the Convention excludes protection under \nthe Convention to persons who have committed or are complicit in war crimes or crimes against \nhumanity.  \n \nFebruary 1, 1993 - Bill C-86 created 19(1)(l), a new ground of inadmissibility pertaining to individuals who \nare or were senior members of regimes designated by the Minister as having committed gross human \nrights violations or war crimes.  \n \nJuly 10, 1995 - Bill C-44 enabled senior immigration officers to render ineligible decisions at any stage of \nthe refugee determination process. This included the authority to declare a positive refugee decision null \nand void if it was determined that the original decision on eligibility was based on misrepresentation.  \n \nMay 1, 1997 - Amendments to the Post Determination Refugee Claimants in Canada Class (PDRCC) and \nDeferred Removal Orders Class (DROC) Regulations restricted persons excluded under Article 1F(a) of \nthe Convention from accessing these reviews.  \n \nJune 17, 1999 - Bill C-40 introduced changes to the Immigration Act concurrent with the proclamation of \nthe new Extradition Act. These included three new provisions 69.1(12), (14), and (15) designed to \nharmonize the extradition and refugee determination processes.  \n \nOctober 23, 2000 - Bill C-19 modified the description of 19(1)(j) and (l) concurrent with the proclamation \nof the Crimes Against Humanity and War Crimes Act. The grounds of inadmissibility are now based on \nthe definitions of war crimes, crimes against humanity, and genocide contained in the new Act. \n \nJune 28, 2002 - Immigration and Refugee Protection Act came into force.  The Act provides two specific \ngrounds of inadmissibility for persons involved in war crimes, crimes against humanity and/or genocide, \nreporting of those inadmissible and issuance of removal orders.  It also provides for the exclusion from \nthe refugee determination process of persons involved in war crimes, crimes against humanity and/or \ngenocide; and it limits appeal rights of persons involved in war crimes, crimes against humanity and/or \ngenocide. \n \n \n \n \n"
    },
    {
      "page": 25,
      "chars": 3412,
      "text": "ENF 18 Human or international rights violations \n2020-06-03 \n \n25 \nAppendix B – Crimes Against Humanity an War Crimes Act \n \nThe Crimes Against Humanity and War Crimes Act is a statute of the Parliament of Canada.  The Act \nimplements Canada’s obligations under the Rome Statute of the International Criminal Court and \nincorporates several grounds of jurisdiction: \n \nEnsures Canada holds jurisdiction over crimes committed on Canadian territory and by Canadians \nanywhere in the world;  \nGives Canada jurisdiction over crimes committed against Canadian nationals; and, \nAllows Canada to prosecute any individual present in Canada for crimes listed in the Crimes Against \nHumanity War Crimes Act, regardless of that individual’s nationality or where the crimes were committed. \n \n \nSection 4 of the Crimes Against Humanity and War Crimes Act  \n \n4 (1) Every person is guilty of an indictable offence who commits  \n(a) genocide; \n(b) a crime against humanity; or \n(c) a war crime. \n \n(1.1) Every person who conspires or attempts to commit, is an accessory after the fact in relation to, or \ncounsels in relation to, an offence referred to in subsection (1) is guilty of an indictable offence. \n \n(2) Every person who commits an offence under subsection (1) or (1.1)  \n(a) shall be sentenced to imprisonment for life, if an intentional killing forms the basis of the offence; \nand \n(b) is liable to imprisonment for life, in any other case. \n \n(3) The definitions in this subsection apply in this section: \n \n\"crime against humanity\" means murder, extermination, enslavement, deportation, imprisonment, \ntorture, sexual violence, persecution or any other inhumane act or omission that is committed against \nany civilian population or any identifiable group and that, at the time and in the place of its \ncommission, constitutes a crime against humanity according to customary international law or \nconventional international law or by virtue of its being criminal according to the general principles of \nlaw recognized by the community of nations, whether or not it constitutes a contravention of the law \nin force at the time and in the place of its commission. \n \n\"genocide\" means an act or omission committed with intent to destroy, in whole or in part, an \nidentifiable group of persons, as such, that, at the time and in the place of its commission, constitutes \ngenocide according to customary international law or conventional international law or by virtue of its \nbeing criminal according to the general principles of law recognized by the community of nations, \nwhether or not it constitutes a contravention of the law in force at the time and in the place of its \ncommission. \n \n\"war crime\" means an act or omission committed during an armed conflict that, at the time and in the \nplace of its commission, constitutes a war crime according to customary international law or \nconventional international law applicable to armed conflicts, whether or not it constitutes a \ncontravention of the law in force at the time and in the place of its commission. \n \n(4) For greater certainty, crimes described in Articles 6 and 7 and paragraph 2 of Article 8 of the Rome \nStatute of the International Criminal Court are, as of July 17, 1998, crimes according to customary \ninternational law. This does not limit or prejudice in any way the application of existing or developing \nrules of international law.  \n \n \n"
    },
    {
      "page": 26,
      "chars": 2483,
      "text": "ENF 18 Human or international rights violations \n2020-06-03 \n \n26 \nAppendix C - Rome Statute of the International Criminal Court \nhttps://www.icc-cpi.int/nr/rdonlyres/ea9aeff7-5752-4f84-be94-0a655eb30e16/0/rome_statute_english.pdf \n \nThe Rome Statute of the International Criminal Court is the treaty that established the International \nCriminal Court (ICC).  It was adopted as a diplomatic conference in Rome on July 17, 1998 and it entered \ninto force on July 1, 2002.  As of 2015, 123 countries are party to the statute.  The Rome Statute \nestablished 4 core international crimes:  genocide, crimes against humanity, war crimes and crimes of \naggression. \n \nArticles 6, 7 and 8 pertain to definitions and scenarios of genocide (article 6), crimes against humanity \n(article 7) and war crimes (article 8)  \n \nArticles 6, 7 and 8  \n \n(a) Article 6—Genocide  \n \nFor the purpose of this Statute, \"genocide\" means any of the following acts committed with intent to \ndestroy, in whole or in part, a national, ethnical, racial or religious group, as such:  \n \n(a) Killing members of the group; \n \n(b) Causing serious bodily or mental harm to members of the group; \n \n(c) Deliberately inflicting on the group conditions of life calculated to bring about its physical destruction \nin whole or in part; \n \n(d) Imposing measures intended to prevent births within the group; \n \n(e) Forcibly transferring children of the group to another group.  \n \n(b) Article 7—Crimes against humanity  \n \n \n1. For the purpose of this Statute, \"crime against humanity\" means any of the following acts when \ncommitted as part of a widespread or systematic attack directed against any civilian population, with \nknowledge of the attack:  \n \n(a) Murder; \n \n(b) Extermination; \n \n(c) Enslavement; \n \n(d) Deportation or forcible transfer of population; \n \n(e) Imprisonment or other severe deprivation of physical liberty in violation of fundamental rules of \ninternational law; \n \n(f) Torture; \n \n(g) Rape, sexual slavery, enforced prostitution, forced pregnancy, enforced sterilization, or any other \nform of sexual violence of comparable gravity; \n \n(h) Persecution against any identifiable group or collectivity on political, racial, national, ethnic, cultural, \nreligious, gender as defined in paragraph 3, or other grounds that are universally recognized as \nimpermissible under international law, in connection with any act referred to in this paragraph or any \ncrime within the jurisdiction of the Court; \n"
    },
    {
      "page": 27,
      "chars": 3290,
      "text": "ENF 18 Human or international rights violations \n2020-06-03 \n \n27 \n \n(i) Enforced disappearance of persons; \n \n(j) The crime of apartheid; \n \n(k) Other inhumane acts of a similar character intentionally causing great suffering, or serious injury to \nbody or to mental or physical health. \n \n2. For the purpose of paragraph 1:  \n \n(a) \"Attack directed against any civilian population\" means a course of conduct involving the multiple \ncommission of acts referred to in paragraph 1 against any civilian population, pursuant to or in \nfurtherance of a state or organizational policy to commit such attack; \n \n(b) \"Extermination\" includes the intentional infliction of conditions of life, inter alia the deprivation of \naccess to food and medicine, calculated to bring about the destruction of part of a population; \n \n(c) \"Enslavement\" means the exercise of any of all of the powers attaching to the right of ownership over \na person and includes the exercise of such power in the course of trafficking in persons, in particular \nwomen and children; \n \n(d) \"Deportation or forcible transfer of population\" means forced displacement of the persons concerned \nby expulsion or other coercive acts from the area in which they are lawfully present, without grounds \npermitted under international law; \n \n(e) \"Torture\" means the intentional infliction of severe pain or suffering, whether physical or mental, \nupon a person in the custody or under the control of the accused; except that torture shall not include \npain or suffering arising only from, inherent in or incidental to, lawful sanctions; \n \n(f) \"Forced pregnancy\" means the unlawful confinement of a woman forcibly made pregnant, with the \nintent of affecting the ethnic composition of any population or carrying out other grave violations of \ninternational law. This definition shall not in any way be interpreted as affecting national laws relating \nto pregnancy; \n \n(g) \"Persecution\" means the intentional and severe deprivation of fundamental rights contrary to \ninternational law by reason of the identity of the group or collectivity; \n \n(h) \"The crime of apartheid\" means inhumane acts of a character similar to those referred to in \nparagraph 1, committed in the context of an institutionalized regime of systematic oppression and \ndomination by one racial group over any other racial group or groups and committed with the \nintention of maintaining that regime; \n \n(i) \"Enforced disappearance of persons\" means the arrest, detention or abduction of persons by, or with \nthe authorization, support or acquiescence of, a state or a political organization, followed by a refusal \nto acknowledge that deprivation of freedom or to give information on the fate or whereabouts of \nthose persons, with the intention of removing them from the protection of the law for a prolonged \nperiod of time. \n \n3, For the purpose of this Statute, it is understood that the term “gender” refers to the two sexes, male \nand female, within the context of society. The term “gender” does not indicate any meaning different \nfrom the above. \n \n(c) Article 8—War crimes  \n \n1. The Court shall have jurisdiction in respect of war crimes in particular when committed as a part of a \nplan or policy or as part of a large-scale commission of such crimes.  \n"
    },
    {
      "page": 28,
      "chars": 2134,
      "text": "ENF 18 Human or international rights violations \n2020-06-03 \n \n28 \n \n2. For the purpose of this Statute, \"war crimes\" means:  \n \n(a) Grave breaches of the Geneva Conventions of 12 August 1949, namely, any of the following acts \nagainst persons or property protected under the provisions of the relevant Geneva Convention: \n \n(i) \nWilful killing;  \n \n(ii) Torture or inhuman treatment, including biological experiments;  \n \n(iii) Wilfully causing great suffering, or serious injury to body or health; \n  \n(iv) Extensive destruction and appropriation of property, not justified by military necessity and \ncarried out unlawfully and wantonly; \n  \n(v) Compelling a prisoner of war or other protected person to serve in the forces of a hostile Power;  \n \n(vi) Wilfully depriving a prisoner of war or other protected person of the rights of fair and regular trial;  \n \n(vii) Unlawful deportation or transfer or unlawful confinement;  \n \n(viii) Taking of hostages.  \n \n(b) Other serious violations of the laws and customs applicable in international armed conflict, within the \nestablished framework of international law, namely, any of the following acts: \n \n(i) \nIntentionally directing attacks against the civilian population as such or against individual \ncivilians not taking direct part in hostilities;  \n \n(ii)   Intentionally directing attacks against civilian objects, that is, objects which are not military \nobjectives;  \n \n(iii) Intentionally directing attacks against personnel, installations, material, units or vehicles \ninvolved in a humanitarian assistance or peacekeeping mission in accordance with the Charter \nof the United Nations, as long as they are entitled to the protection given to civilians or civilian \nobjects under the international law of armed conflict;  \n \n(iv) Intentionally launching an attack in the knowledge that such attack will cause incidental loss of \nlife or injury to civilians or damage to civilian objects or widespread, long-term and severe \ndamage to the natural environment which would be clearly excessive in relation to the concrete \nand direct overall military advantage anticipated;  \n \n"
    },
    {
      "page": 29,
      "chars": 3180,
      "text": "ENF 18 Human or international rights violations \n2020-06-03 \n \n29 \n(v) Attacking or bombarding, by whatever means, towns, villages, dwellings or buildings which are \nundefined and which are not military objectives;  \n \n(vi) Killing or wounding a combatant who, having laid down his arms or having no longer means of \ndefence, has surrendered at discretion;  \n \n(vii) Making improper use of a flag of truce, of the flag or of the military insignia and uniform of the \nenemy or of the United Nations, as well as of the distinctive emblems of the Geneva \nConventions, resulting in death or serious personal injury;  \n \n(viii) The transfer, directly or indirectly, by the Occupying Power of parts of its own civilian population \ninto the territory it occupies, or the deportation or transfer of all or parts of the population of the \noccupied territory within or outside this territory;  \n \n(ix) Intentionally directing attacks against buildings dedicated to religion, education, art, science or \ncharitable purposes, historic monuments, hospitals and places where the sick and wounded are \ncollected, provided they are not military objectives;  \n \n(x) Subjecting persons who are in the power of an adverse party to physical mutilation or to medical \nor scientific experiments of any kind which are neither justified by the medical, dental or hospital \ntreatment of the person concerned nor carried out in his or her interest, and which cause death \nto or seriously endanger the health of such person or persons;  \n \n(xi) Killing or wounding treacherously individuals belonging to the hostile nation or army;  \n \n(xii) Declaring that no quarter will be given;  \n \n(xiii)Destroying or seizing the enemy's property unless such destruction or seizure be imperatively \ndemanded by the necessities of war;  \n \n(xiii) Declaring abolished, suspended or inadmissible in a court of law the rights and actions of the \nnationals of the hostile party;  \n \n(xiv) Compelling the nationals of the hostile party to take part in the operations of war directed \nagainst their own country, even if they were in the belligerent's service before the \ncommencement of the war;  \n \n(xvi)Pillaging a town or place, even when taken by assault;  \n \n(xv) Employing poison or poisoned weapons;  \n \n(xvi) Employing asphyxiating, poisonous or other gases, and all analogous liquids, materials or \ndevices;  \n \n(xix) Employing bullets which expand or flatten easily in the human body, such as bullets with a hard \nenvelope which does not entirely cover the core or is pierced with incisions;  \n \n(xx) Employing weapons, projectiles and material and methods of warfare which are of a nature to \ncause superfluous injury or unnecessary suffering or which are inherently indiscriminate in \nviolation of the international law of armed conflict, provided that such weapons, projectiles and \nmaterial and methods of warfare are the subject of a comprehensive prohibition and are \nincluded in an annex to this Statute, by an amendment in accordance with the relevant \nprovisions set forth in articles 121 and 123;  \n \n(xxi) Committing outrages upon personal dignity, in particular humiliating and degrading treatment;  \n \n"
    },
    {
      "page": 30,
      "chars": 3310,
      "text": "ENF 18 Human or international rights violations \n2020-06-03 \n \n30 \n(xxii) Committing rape, sexual slavery, enforced prostitution, forced pregnancy, as defined in article \n7, paragraph 2 (f), enforced sterilization, or any other form of sexual violence also constituting a \ngrave breach of the Geneva Conventions;  \n \n(xxiii) Utilizing the presence of a civilian or other protected person to render certain points, areas or \nmilitary forces immune from military operations;  \n \n(xxiv) intentionally directing attacks against buildings, material, medical units and transport, and \npersonnel using the distinctive emblems of Geneva Conventions in conformity with international \nlaw; \n \n(xxv) Intentionally using starvation of civilians as a method of warfare by depriving them of objects \nindispensable to their survival, including wilfully impeding relief supplies as provided for under \nthe Geneva Conventions; \n \n(xxvi) Conscripting or enlisting children under the age of fifteen years into the national armed forces \nor using them to participate actively in hostilities. \n  \n(c) In the case of an armed conflict not of an international character, serious violations of article 3 \ncommon to the four Geneva Conventions of 12 August 1949, namely, any of the following acts \ncommitted against persons taking no active part in the hostilities, including members of armed forces \nwho have laid down their arms and those placed hors de combat by sickness, wounds, detention or \nany other cause: \n \n(i) \nViolence to life and person, in particular murder of all kinds, mutilation, cruel treatment and \ntorture;  \n \n(ii) Committing outrages upon personal dignity, in particular humiliating and degrading treatment;  \n \n(iii) Taking of hostages;  \n \n(iv) The passing of sentences and the carrying out of executions without previous judgement \npronounced by a regularly constituted court, affording all judicial guarantees which are generally \nrecognized as indispensable.  \n \n(d) Paragraph 2(c) applies to armed conflicts not of an international character and thus does not apply to \nsituations of internal disturbances and tensions, such as riots, isolated and sporadic acts of violence \nor other acts of a similar nature. \n \n(e) Other serious violations of the laws and customs applicable in armed conflicts not of an international \ncharacter, within the established framework of international law, namely, any of the following acts: \n \n(i) \nIntentionally directing attacks against the civilian population as such or against individual \ncivilians not taking direct part in hostilities;  \n \n(ii) Intentionally directing attacks against buildings, material, medical units and transport, and \npersonnel using the distinctive emblems of the Geneva Conventions in conformity with \ninternational law;  \n \n(iii)  Intentionally directing attacks against personnel, installations, material, units or vehicles \ninvolved in a humanitarian assistance or peacekeeping mission in accordance with the Charter \nof the United Nations, as long as they are entitled to the protection given objects under the law \nof armed conflict;  \n \n(iv) Intentionally directing attacks against buildings dedicated to religion, education, art, science or \ncharitable purposes, historic monuments, hospitals and places where the sick and wounded are \n"
    },
    {
      "page": 31,
      "chars": 1924,
      "text": "ENF 18 Human or international rights violations \n2020-06-03 \n \n31 \ncollected, provided they are not military objectives;  \n \n(v) Pillaging a town or place, even when taken by assault;  \n \n(vi) Committing rape, sexual slavery, enforced prostitution, forced pregnancy, as defined in article 7, \nparagraph 2(f), enforced sterilization, and any other form of sexual violence also constituting a \nserious violation of article 3 common to the four Geneva Conventions;  \n \n(vii) Conscripting or enlisting children under the age of fifteen years into armed forces or groups or \nusing them to participate actively in hostilities;  \n \n(viii) Ordering the displacement of the civilian population for reasons related to the conflict, unless \nthe security of the civilians involved or imperative military reasons so demand;  \n \n(ix) Killing or wounding treacherously a combatant adversary;  \n \n(x) Declaring that no quarter will be given;  \n \n(xi) Subjecting persons who are in the power of another party to the conflict to physical mutilation or \nto medical or scientific experiments of any kind which are neither justified by the medical, dental \nor hospital treatment of the person concerned nor carried out in his or her interest, and which \ncause death to or seriously endanger the health of such person or persons;  \n \n(xii) Destroying or seizing the property of an adversary unless such destruction or seizure be \nimperatively demanded by the necessities of the conflict.  \n \n(f) \nParagraph 2(e) applies to armed conflicts not of an international character and thus does not \napply to situations of internal disturbances and tensions, such as riots, isolated and sporadic \nacts of violence or other acts of a similar nature. It applies to armed conflicts that take place in \nthe territory of a state when there is protracted armed conflict between governmental authorities \nand organized armed groups or between such groups. \n \n \n"
    }
  ]
}