{
  "file": "/workspaces/legalnew/manuals/enf28-eng.pdf",
  "page_count": 33,
  "pages": [
    {
      "page": 1,
      "chars": 165,
      "text": " \n \n \n \n \n \nENF 28 \nMinisterial opinions on danger to the \npublic, nature and severity of the acts \ncommitted and danger to the security \nof Canada \n \n \n \n \n \n \n \n \n"
    },
    {
      "page": 2,
      "chars": 4636,
      "text": "ENF 28 Ministerial opinions on danger to the public, nature and severity of the acts committed and \ndanger to the security of Canada \n2017-11-21 \n \n2 \nTable of contents \nUpdates to chapter ................................................................................................................. 4 \nListing by date .................................................................................................................... 4 \n1 What this chapter is about ..................................................................................................... 6 \n2 Program objectives............................................................................................................... 6 \n3 The Act and Regulations ....................................................................................................... 6 \n3.1 Forms .......................................................................................................................... 9 \n4 Instruments and delegations .................................................................................................10 \n4.1 Authorities ...................................................................................................................10 \n4.2 Guidance.....................................................................................................................10 \n5 Departmental policy.............................................................................................................11 \n5.1 Danger opinion provisions ..............................................................................................11 \n5.2. Removal of Convention refugees or protected persons [A115] ............................................11 \n6 Definitions..........................................................................................................................12 \n7 Procedure: issuing ministerial opinions ...................................................................................13 \n7.1 Identification by a CBSA officer of danger opinion cases .....................................................13 \n7.2 When to request the Minister’s opinion .............................................................................13 \n7.3 Determinant factors.......................................................................................................14 \n7.4 Factors .......................................................................................................................15 \n7.5 Procedural fairness .......................................................................................................16 \n7.6 Notification letter: intent to seek the Minister’s opinion ........................................................17 \n7.7 Danger opinion package ................................................................................................18 \n7.8 Documentation .............................................................................................................19 \n7.9 Urgent consideration .....................................................................................................20 \n7.10 Humanitarian and compassionate considerations.............................................................21 \n7.11 The Youth Criminal Justice Act (YCJA)...........................................................................21 \n7.12 Disclosure..................................................................................................................22 \n7.13 Extension requests for submissions ...............................................................................22 \n7.14 Following receipt of submissions ...................................................................................23 \n7.15 After the Minister’s delegate’s danger opinion decision .....................................................23 \n7.16 Reconsideration of danger opinion.................................................................................23 \n7.17 Info-alert ....................................................................................................................24 \nAppendix A Letter advising the client that the CBSA will seek the Minister’s opinion on the basis of \nparagraph A115(2)(a) .............................................................................................................25 \nAppendix B Letter advising the client that the CBSA will seek the Minister’s opinion on the basis of \nparagraph A115(2)(b) .............................................................................................................27 \n"
    },
    {
      "page": 3,
      "chars": 609,
      "text": "ENF 28 Ministerial opinions on danger to the public, nature and severity of the acts committed and \ndanger to the security of Canada \n2017-11-21 \n \n3 \nAppendix C Letter advising the client that the CBSA will seek the Minister’s opinion on the basis of \nparagraphs A115(2)(a) and (b) ................................................................................................29 \nAppendix D Danger Opinion Narrative Report form for use in paragraph A115(2)(b) cases and hybrid \ncases involving paragraphs A115(2)(a) and (b) ..........................................................................31 \n \n \n"
    },
    {
      "page": 4,
      "chars": 1997,
      "text": "ENF 28 Ministerial opinions on danger to the public, nature and severity of the acts committed and \ndanger to the security of Canada \n2017-11-21 \n \n4 \nUpdates to chapter \nListing by date \n2017-11-21 \nSection 7.16 has been updated to include guidance for officers reconsidering danger opinions pursuant to \nsection 115(2)(a) of the Immigration and Refugee Protection Act (IRPA).  \n2016-09-16 \nMost sections of this chapter have been updated to include more information regarding the processing of \ncases involving paragraph 115(2)(b) of the IRPA and to reflect respective responsibilities of Immigration, \nRefugees and Citizenship Canada (IRCC) and the Canada Border Services Agency (CBSA). \n2005-11-07 \nThe chapter has been updated to reflect respective responsibilities of Citizenship and Immigration \nCanada (CIC) and the Canada Border Services Agency (CBSA). \nSection 4: Clarification added to indicate that “the Minister” refers to the Minister of Citizenship and \nImmigration.  \nSection 4.1: Removed list of delegated authority. \nAdded a reference to the chapter IL 3, Designation of Officers and Delegation of Authority, for information \non delegated authority to form an opinion pursuant to paragraphs A101(2)(b) and A115(2)(a) that a \nperson is a danger to the public in Canada, and pursuant to paragraph A115(2)(b) that a person is a \ndanger to the security of Canada, or should not be allowed to remain in Canada on the basis of the nature \nand severity of acts committed.  \nAdded instruction to indicate that all requests for danger opinion pursuant to A115(2)(b), as well as \ncomplete documentation, must be sent to the Manager, National Security Coordination Section, Canada \nBorder Services Agency, Jean Edmonds Tower North, 300 Slater Street, 6th floor, Ottawa ON K1A 0L8. \nSection 4.2: Corrections to indicate the responsible Divisions within the National Security Division (NSD) \nof the CBSA for Organized Crime Division, Modern War Crimes Division and Security Review Division. \n"
    },
    {
      "page": 5,
      "chars": 1776,
      "text": "ENF 28 Ministerial opinions on danger to the public, nature and severity of the acts committed and \ndanger to the security of Canada \n2017-11-21 \n \n5 \nSection 7.2: Addition to indicate that officers should consult with the National Security Division (NSD), the \nCBSA for guidance, before initiating a request for danger opinion pursuant to paragraph A115(2)(b).  \nSection 7.10: Added instruction with respect to requests for danger opinions pursuant to \nparagraphs A101(2)(b) and A115(2)(a), to send the completed IMM 5367B, including all documentation \nand submissions to the Director, Case Review Division, Case Management Branch, NHQ; and with \nrespect to request for danger opinion pursuant to paragraph A115(2)(b), to send the completed \nIMM 5367B, including all documentation and submissions to the Manager, National Security Coordination \nSection, Canada Border Services Agency, NHQ.  \nSection 7.11: Added information to indicate that the documents should be returned to the Director, Case \nReview Division, Case Management Branch, NHQ, under “After Disclosure”, which provides information \non the type documents that should be returned to NHQ. This relates to documents and submissions with \nrespect to requests for danger opinion pursuant to paragraphs A101(2)(b), A115(2)(a), as well as \nA115(2)(b). \nSection 7.16: Correction to indicate that an EII is entered in FOSS rather than an NCB, regarding the \ndecision of the Minister’s delegate concerning a request for a danger opinion or a request for \nreconsideration.  \nAppendix A: Removed references inviting the client to provide submissions addressing the extent to \nwhich his life or freedoms are threatened by removal from Canada. This relates to the letter to client with \nrespect to paragraph A101(2)(b). \n \n \n"
    },
    {
      "page": 6,
      "chars": 1809,
      "text": "ENF 28 Ministerial opinions on danger to the public, nature and severity of the acts committed and \ndanger to the security of Canada \n2017-11-21 \n \n6 \n1 What this chapter is about \nThe purpose of this chapter is to define the policies and procedures with respect to ministerial danger \nopinion reports. \nThis chapter aims to provide functional guidance and direction to officers, managers and others at \nImmigration, Refugees and Citizenship Canada (IRCC) and the Canada Border Services Agency (CBSA) \nwho are involved in the decision-making process and the issuance of danger opinions.  \n2 Program objectives \nThe program objectives for the issuance of danger opinions with respect to protected persons are to \n• \nprotect the health and safety of Canadians and to maintain the security of Canadian society; and  \n• \npromote international justice and security by denying access to Canadian territory to protected \npersons who were found inadmissible under section 34, section 35, subsection 36(1) or \nsection 37 of the Immigration and Refugee Protection Act (IRPA) on grounds of security, violation \nof human or international rights, serious criminality or organized criminality. \nThe IRPA is to be construed and applied in a manner that \n• \nfurthers the domestic and international interests of Canada; and  \n• \ncomplies with international human rights instruments to which Canada is a signatory.  \n3 The Act and Regulations \nReference should be made to the IRPA and the Immigration and Refugee Protection Regulations (IRPR) \nfor the full and complete wording of the texts. \nProvision \nIRPA and IRPR \nA permanent resident or a foreign national is inadmissible on security \ngrounds for \nA34(1) \n• \nengaging in an act of espionage that is against Canada or that is \ncontrary to Canada’s interests;  \nA34(1)(a) \n"
    },
    {
      "page": 7,
      "chars": 1639,
      "text": "ENF 28 Ministerial opinions on danger to the public, nature and severity of the acts committed and \ndanger to the security of Canada \n2017-11-21 \n \n7 \n• \nengaging in or instigating the subversion by force of any \ngovernment; \nA34(1)(b) \n• \nengaging in an act of subversion against a democratic \ngovernment, institution or process as they are understood in \nCanada; \nA34(1)(b.1) \n• \nengaging in terrorism; \nA34(1)(c) \n• \nbeing a danger to the security of Canada; \nA34(1)(d) \n• \nengaging in acts of violence that would or might endanger the \nlives or safety of persons in Canada; or  \nA34(1)(e) \n• \nbeing a member of an organization that there are reasonable \ngrounds to believe engages, has engaged or will engage in acts \nreferred to in paragraph (a), (b), (b.1) or (c).  \nA34(1)(f) \nA permanent resident or a foreign national is inadmissible on grounds of \nviolating human or international rights for  \nA35(1) \n• \ncommitting an act outside Canada that constitutes an offence \nreferred to in sections 4 to 7 of the Crimes Against Humanity and \nWar Crimes Act; \nA35(1)(a) \n• \nbeing a prescribed senior official in the service of a government \nthat, in the opinion of the Minister, engages or has engaged in \nterrorism, systematic or gross human rights violations, or \ngenocide, a war crime or a crime against humanity within the \nmeaning of subsections 6(3) to (5) of the Crimes Against \nHumanity and War Crimes Act; or  \nA35(1)(b) \n• \nbeing a person, other than a permanent resident, whose entry \ninto or stay in Canada is restricted pursuant to a decision, \nresolution or measure of an international organization of states or \nA35(1)(c) \n"
    },
    {
      "page": 8,
      "chars": 1889,
      "text": "ENF 28 Ministerial opinions on danger to the public, nature and severity of the acts committed and \ndanger to the security of Canada \n2017-11-21 \n \n8 \nassociation of states, of which Canada is a member, that \nimposes sanctions on a country against which Canada has \nimposed or has agreed to impose sanctions in concert with that \norganization or association.  \nA permanent resident or a foreign national is inadmissible on grounds of \nserious criminality for  \nA36(1) \n• \nhaving been convicted in Canada of an offence under an Act of \nParliament punishable by a maximum term of imprisonment of at \nleast 10 years, or of an offence under an Act of Parliament for \nwhich a term of imprisonment of more than six months has been \nimposed; \nA36(1)(a) \n• \nhaving been convicted of an offence outside Canada that, if \ncommitted in Canada, would constitute an offence under an Act \nof Parliament punishable by a maximum term of imprisonment of \nat least 10 years; or  \nA36(1)(b) \n• \ncommitting an act outside Canada that is an offence in the place \nwhere it was committed and that, if committed in Canada, would \nconstitute an offence under an Act of Parliament punishable by a \nmaximum term of imprisonment of at least 10 years.  \nA36(1)(c) \nA permanent resident or a foreign national is inadmissible on grounds of \norganized criminality for  \nA37(1) \n• \nbeing a member of an organization that is believed on \nreasonable grounds to be or to have been engaged in activity \nthat is part of a pattern of criminal activity planned and organized \nby a number of persons acting in concert in furtherance of the \ncommission of an offence punishable under an Act of Parliament \nby way of indictment, or in furtherance of the commission of an \noffence outside Canada that, if committed in Canada, would \nconstitute such an offence, or engaging in activity that is part of \nsuch a pattern; or  \nA37(1)(a) \n"
    },
    {
      "page": 9,
      "chars": 1591,
      "text": "ENF 28 Ministerial opinions on danger to the public, nature and severity of the acts committed and \ndanger to the security of Canada \n2017-11-21 \n \n9 \n• \nengaging, in the context of transnational crime, in activities such \nas people smuggling, trafficking in persons or money laundering.  \nA37(1)(b) \nA protected person or a person who is recognized as a Convention \nrefugee by another country to which the person may be returned shall not \nbe removed from Canada to a country where they would be at risk of \npersecution for reasons of race, religion, nationality, membership in a \nparticular social group or political opinion or at risk of torture or cruel and \nunusual treatment or punishment.  \nA115(1) \nSubsection (1) does not apply in the case of a person  \n• \nwho is inadmissible on grounds of serious criminality and who \nconstitutes, in the opinion of the Minister, a danger to the public \nin Canada; or  \nA115(2)(a) \n• \nwho is inadmissible on grounds of security, violating human or \ninternational rights or organized criminality if, in the opinion of the \nMinister, the person should not be allowed to remain in Canada \non the basis of the nature and severity of acts committed or of \ndanger to the security of Canada.  \nA115(2)(b) \n3.1 Forms \nThe forms required for requests for danger opinions pursuant to paragraphs A115(2)(a) and (b) are as \nfollows: \nForm title  \nForm number  \nDanger Opinion Narrative Report (for paragraph 115(2)(b) and hybrid \ncases only) \nSee Appendix D \nDanger to the Public – Ministerial Opinion Report (for \nparagraph 115(2)(a) cases only) \nIMM 5367B \n"
    },
    {
      "page": 10,
      "chars": 1944,
      "text": "ENF 28 Ministerial opinions on danger to the public, nature and severity of the acts committed and \ndanger to the security of Canada \n2017-11-21 \n \n10 \n4 Instruments and delegations \nPursuant to subsections A6(1) and (2), the Minister of IRCC has delegated persons or a class of persons \nas officers to carry out any purpose of any provision, legislative or regulatory, and has specified the \npowers and duties of the officers so delegated. These delegations may be found in chapter IL 3, \nDesignation of officers and delegation of authority. \n4.1 Authorities \nThe IRPA authorizes the Minister of IRCC to form an opinion that a person is a danger to the public in \nCanada or to the security of Canada or should not be allowed to remain in Canada on the basis of the \nnature and severity of acts committed. \nRefer to chapter IL 3, Designation of officers and delegation of authority, for information on delegated \nauthority to form an opinion, pursuant to paragraph A115(2)(a), that a person is a danger to the public in \nCanada and, pursuant to paragraph A115(2)(b), that a person is a danger to the security of Canada or \nthat a person should not be allowed to remain in Canada on the basis of the nature and severity of acts \ncommitted. \nAll requests for danger opinions pursuant to paragraphs A115(2)(a) and (b), as well as complete \ndocumentation, must be sent to the CBSA’s Danger Assessments Section (DAS), which acts as the \ncentralized point of contact, at the following address:  \nManager  \nDanger Assessments Section \nInland Enforcement Operations and Case Management Division \nCanada Border Services Agency \n191 Laurier Avenue West, 13th floor \nOttawa, ON \nK1A 0L8 \n4.2 Guidance \nThe Operational Management and Coordination Branch, IRCC, National Headquarters (NHQ), may be \ncontacted at the following email address for guidance on policy issues regarding opinions on danger to \nthe public in Canada: OMC-GOC-Immigration@cic.gc.ca. \n"
    },
    {
      "page": 11,
      "chars": 1938,
      "text": "ENF 28 Ministerial opinions on danger to the public, nature and severity of the acts committed and \ndanger to the security of Canada \n2017-11-21 \n \n11 \nThe DAS, CBSA, NHQ, may be contacted at the following email address for guidance regarding danger \nto the security of Canada or nature and severity cases under paragraph A115(2)(b) as well as on specific \ncases regarding danger opinions under paragraph A115(2)(a): CBSA-ASFC_Danger_Assessments-\nEvaluations_De_Danger@cbsa-asfc.gc.ca. \n5 Departmental policy \n5.1 Danger opinion provisions \nThe IRPA allows for a danger opinion to be issued in the following situation:  \nException to non-refoulement (removal) \nA protected person or a person who is recognized as a Convention refugee by another country to which \nthe person may be returned should not be removed from Canada to a country where they would be at risk \nof persecution, torture or cruel and unusual treatment or punishment, except for a person who is \ninadmissible on grounds of \n• \nserious criminality and who constitutes, in the opinion of the Minister of IRCC, a danger to the \npublic in Canada [A115(2)(a)]; or \n• \nsecurity, violating human or international rights or organized criminality if, in the opinion of the \nMinister of IRCC, the person should not be allowed to remain in Canada on the basis of the \nnature and severity of acts committed or of danger to the security of Canada [A115(2)(b)].  \n5.2. Removal of Convention refugees or protected persons [A115] \nUnder the principle of non-refoulement, a protected person or a person who is recognized as a \nConvention refugee by another country to which the person may be returned should not be removed from \nCanada to a country where they would be at risk of \n• \npersecution for the following reasons:  \no race, \no religion, \no nationality, \no membership in a particular social group, \no political opinion; \n• \ntorture or cruel and unusual treatment or punishment. \n"
    },
    {
      "page": 12,
      "chars": 2590,
      "text": "ENF 28 Ministerial opinions on danger to the public, nature and severity of the acts committed and \ndanger to the security of Canada \n2017-11-21 \n \n12 \nA protected person or a person who is recognized as a Convention refugee by another country to which \nthe person may be returned should not be removed from Canada and returned to their country of alleged \npersecution, except in the following circumstances:  \n• \nit has been determined that the person concerned is described under section A34, section A35, \nsubsection A36(1) or section A37; \n• \na removal order was issued; \n• \nthe Minister of IRCC has issued an opinion that the person concerned is a danger to the public in \nCanada [A115(2)(a)], that the person should not be allowed to remain in Canada on the basis of \nthe nature and severity of the acts committed or that the person concerned is a danger to the \nsecurity of Canada [A115(2)(b)]. \n6 Definitions \nAct of \nParliament  \nLegislative act or statutory law: A bill that has been created or arrived at through \nthe will of the electorate and their elected officials and that has been enacted by \nfederal legislature into law  \nConvention \nrefugee  \nA person who, by reason of a well-founded fear of persecution for reasons of race, \nreligion, nationality, membership in a particular social group or political opinion, is \noutside each of their countries of nationality and is unable or, by reason of that fear, \nunwilling to avail themselves of the protection of each of those countries or, not \nhaving a country of nationality, is outside the country of their former habitual \nresidence and is unable or, by reason of that fear, unwilling to return to that country \nIAD  \nImmigration Appeal Division  \nID  \nImmigration Division  \nIRB  \nImmigration and Refugee Board  \nPerson in \nneed of \nprotection \nA person in Canada whose removal to their country or countries of nationality, or, if \nthey do not have a country of nationality, their country of former habitual residence \nwould subject them personally to a danger, believed on substantial grounds to \nexist, of torture within the meaning of Article 1 of the Convention against Torture or \nto a risk to their life or to a risk of cruel and unusual treatment or punishment if the \nperson is unable or, because of that risk, unwilling to avail themselves of the \nprotection of that country; the risk would be faced by the person in every part of that \ncountry and is not faced generally by other individuals in or from that country, is not \ninherent or incidental to lawful sanctions, unless imposed in disregard of accepted \n"
    },
    {
      "page": 13,
      "chars": 1868,
      "text": "ENF 28 Ministerial opinions on danger to the public, nature and severity of the acts committed and \ndanger to the security of Canada \n2017-11-21 \n \n13 \ninternational standards, and is not caused by the inability of that country to provide \nadequate health or medical care \nProtected \nperson  \nA person on whom refugee protection is conferred and whose claim or application \nhas not subsequently been deemed to be rejected \nRAD  \nRefugee Appeal Division  \nRecidivism  A tendency to relapse into a habit of criminal activity or behaviour \nRPD  \nRefugee Protection Division  \n7 Procedure: issuing ministerial opinions  \n7.1 Identification by a CBSA officer of danger opinion cases \nOfficers are responsible for identifying persons who may be recommended for a Minister’s opinion on \ndanger to the public of Canada, on danger to the security of Canada or on the basis of the nature and \nseverity of acts committed. This occurs when a protected person has been found inadmissible under \nsection A34, section A35, subsection A36(1) or section A37 and is the subject of a removal order that is in \nforce. The officer must obtain their manager’s approval before submitting a case to the DAS, CBSA, \nNHQ. \n7.2 When to request the Minister’s opinion \nAfter removal order [A115(2)(a)] \nThe officer may initiate a request for the Minister’s opinion when \n• \na protected person or a person who is recognized as a Convention refugee is found inadmissible \non grounds of serious criminality; and  \n• \nthat person constitutes, in the opinion of the officer, a danger to the public in Canada.  \nAfter removal order [A115(2)(b)] \nThe officer may initiate a request for the Minister’s opinion when \n• \na protected person or a person who is recognized as a Convention refugee is inadmissible on \ngrounds of security, violating human or international rights or organized criminality; and \n"
    },
    {
      "page": 14,
      "chars": 2037,
      "text": "ENF 28 Ministerial opinions on danger to the public, nature and severity of the acts committed and \ndanger to the security of Canada \n2017-11-21 \n \n14 \n• \nthe person concerned is a person who, in the opinion of the officer, should not be allowed to \nremain in Canada on the basis of the nature and severity of acts committed or of danger to the \nsecurity of Canada. \nOfficers must consult with the DAS of the CBSA for guidance before initiating a request for a danger \nopinion pursuant to paragraph A115(2)(b). \nAfter removal order [A115(2)(a) and (b)] \nIn hybrid cases, the officer should initiate a request for the Minister’s opinion when \n• \na protected person or a person who is recognized as a Convention refugee is inadmissible on \ngrounds of security, violating human or international rights, or organized criminality as well as on \ngrounds of serious criminality; and \n• \nthe person concerned is a person who, in the opinion of the officer, constitutes a danger to the \npublic and is a danger to the security of Canada or should not be allowed to remain in Canada on \nthe basis of the nature and severity of acts committed. \nDetained cases \nIn the case of a person who is detained for serious criminality, the officer who initiates a request for the \nMinister’s opinion should do so at least one year prior to the date of the person’s earliest anticipated date \nof release. \n7.3 Determinant factors  \nIn determining whether to seek the Minister’s opinion on danger to the public, the officer must examine \nthe seriousness and nature of the offence to ensure that they support the officer’s decision that the \nperson represents an unacceptable risk to the public and is likely to commit offences in the future.  \nThe officer must not only consider the conviction and sentence, but also \n• \ninclude an analysis of the person’s past and current offences and activities in the \nrecommendation; and \n• \nindicate that, if the person is considered to be a danger to the public, a request for the Minister’s \nopinion may be initiated.  \n"
    },
    {
      "page": 15,
      "chars": 2602,
      "text": "ENF 28 Ministerial opinions on danger to the public, nature and severity of the acts committed and \ndanger to the security of Canada \n2017-11-21 \n \n15 \nIn determining whether to seek the Minister’s opinion on danger to the security of Canada or on the basis \nof the nature and severity of the acts committed, the officer must examine the seriousness and nature of \nthe person’s actions or the actions of the organization of which the person was a member if it is \ndetermined that the person made a contribution to the nefarious activities of the organization. \nIn cases of danger to the security of Canada, the officer will also consider what activities there are \nreasonable grounds to believe the individual may engage in in the future. \nFor all requests pursuant to paragraph A115(2)(b) cases, the officer will submit a request for guidance \nfrom the DAS of the CBSA prior to providing notification to the person concerned that a danger opinion \nwill be sought in their case. Upon receipt of such a request, the DAS will review the information provided \nand complete a pre-assessment to determine if the CBSA should move forward in seeking the Minister’s \nopinion. \nNote: All available and the most up-to-date documentation relevant to the case must be included with the \nrequest for a danger opinion. \n7.4 Factors \nCriminal factors \nThe following factors must be considered in the preparation of a danger opinion submission for serious \ncriminality as well as for organized criminality: \n• \ncriminal history and established patterns of violent criminal behaviour or threats of violent \nbehaviour that suggest present and future danger to the public, and evidence to support the \nperson’s pattern of behaviour; \n• \nconvictions for serious offences involving but not limited to violence, weapons, drug trafficking, \nhuman smuggling and trafficking, sexual offences and economic crimes; \n• \ndocuments illustrating an escalation of violence or of gravity in the convictions; \n• \nconvictions for actions by the person that caused or might reasonably be expected to have \ncaused death, serious physical or psychological harm or significant property damage; \n• \nevidence to substantiate the link between the criminal conviction, the likelihood that the person \nwill re-offend and a pattern of increasingly serious criminal activity; \n• \npolice, correctional services or other credible source information indicating that the person \ncontinues to pose a danger to the public; \n• \nthe circumstances of the offence(s) in order to provide insight into the level of risk the person may \npresent to the public; \n"
    },
    {
      "page": 16,
      "chars": 2354,
      "text": "ENF 28 Ministerial opinions on danger to the public, nature and severity of the acts committed and \ndanger to the security of Canada \n2017-11-21 \n \n16 \n• \nevidence of rehabilitation on the part of the individual (education or training certificates, \npsychological reports, reports from the parole officer, evidence of employment, etc.); \n• \nmultiple convictions, including serious offences, that could form the basis for a danger opinion; \n• \na single conviction that may sustain a finding of danger to the public if it is clearly demonstrated \nthat the person poses a present or future risk of danger to the public, as evidenced by the nature \nand circumstances of the offence. The jurisprudence indicates that it is possible to base a danger \nopinion on a single serious conviction when sufficient evidence exists.  \nDanger to the security of Canada and the nature and severity of the acts \ncommitted: factors \nThe following are some of the factors that must be considered in the preparation of a danger opinion \nbased on danger to the security of Canada or on the nature and severity of the acts committed: \n• \nacts committed by the individual or the group, if applicable; \n• \nactivities undertaken by the person in the furtherance of the group’s objectives; \n• \nthe level of involvement of the person in the acts committed by the organization; and \n• \nthe level of threat either direct or indirect that the person presents to the security of Canada. \n7.5 Procedural fairness  \nThe decision-making process for a Minister’s opinion must adhere to the principles of procedural fairness. \nThe person concerned must be fully informed of the case and be given a reasonable opportunity to \nrespond to any information the decision maker will use to arrive at a decision. A copy of all \ndocumentation that will be put before the decision maker must be provided to the person concerned. \nExceptionally, information may be used that cannot be disclosed to the person concerned where the \ndisclosure of this information would be injurious to national security or would endanger the safety of any \nperson. In such circumstances, all efforts should be made to provide as much information as possible to \nthe person concerned and to limit the amount of undisclosed information to be considered. Consultation \nwith the DAS, CBSA, is required in such circumstances. \n"
    },
    {
      "page": 17,
      "chars": 2259,
      "text": "ENF 28 Ministerial opinions on danger to the public, nature and severity of the acts committed and \ndanger to the security of Canada \n2017-11-21 \n \n17 \n7.6 Notification letter: intent to seek the Minister’s opinion \nNotification letter \nAs soon as a CBSA manager or supervisor agrees with the officer to seek a Minister’s opinion, the person \nconcerned must be notified by letter. In paragraph A115(2)(b) cases, this happens only after consultation \nwith the DAS at the CBSA, NHQ. The notification letter must be accurate and make reference to the \nappropriate section(s) of the IRPA and should \n• \nexplain the effect of the Minister’s opinion on the person’s ability to remain in Canada; \n• \nadvise the person concerned of the opportunity to make representations or submit any other \nevidence regarding danger, nature and severity of the acts committed, risks upon removal, and \nhumanitarian and compassionate considerations, including written statements from others; \n• \nconfirm that the deadline for the submissions is 15 calendar days from the day that the notice is \nreceived by the person (the 15 days do not include the day on which the letter was issued but do \ninclude the fifteenth day, unless it falls on a holiday or weekend, in which case the deadline is the \nnext working day); \n• \ninclude a list and attached copies of some of the material that is expected to form the record that \nmay be forwarded to the Minister’s delegate for making the decision; \n• \nnot include evidence in the danger opinion package that could prejudice a third party, unless the \nsource has authorized disclosure for this purpose (if disclosure has not been authorized, the \ninformation cannot be disclosed to the person concerned); \n• \nbe signed by the CBSA manager or supervisor; and \n• \nbe dated when served or sent to the person concerned.  \nSamples of notification letters \n• \nAppendix A Letter advising the client that the CBSA will seek the Minister’s opinion on the basis \nof paragraph A115(2)(a) \n• \nAppendix B Letter advising the client that the CBSA will seek the Minister’s opinion on the basis \nof paragraph A115(2)(b) \n• \nAppendix C Letter advising the client that the CBSA will seek the Minister’s opinion on the basis \nof paragraphs A115(2)(a) and (b)  \n"
    },
    {
      "page": 18,
      "chars": 2332,
      "text": "ENF 28 Ministerial opinions on danger to the public, nature and severity of the acts committed and \ndanger to the security of Canada \n2017-11-21 \n \n18 \nService of notification letter \nThe notification letter must be served, and an acknowledgment of receipt should be obtained from the \nperson concerned. Service can be either in person or by any mail service that provides acknowledgment \nof receipt (for instance, double registered mail). A copy of the letter should be sent to the person’s \ncounsel, if known. \nIf the person concerned is incarcerated, arrangements must be made for a CBSA officer to serve the \nnotification letter in person and to obtain an acknowledgment of receipt.  \nWhen the person concerned does not understand either English or French and requires the services of \nan interpreter at an admissibility hearing, a translation of the notification letter must be provided either \norally or in writing. \nIf the person refuses to sign the acknowledgment of receipt, a note to that effect will be added to the \ndepartmental copy of the notification letter, signed and dated by the serving officer, to establish service. \nNote: When service is by mail but the post office is unable to confirm receipt by the person concerned, \nthe request for a danger opinion cannot proceed. A warrant for the person’s arrest for removal should be \nobtained, and the process of obtaining a danger opinion can recommence when the person is arrested. \n7.7 Danger opinion package \nFor paragraph A115(2)(a) and (b) requests, if no extension has been granted at the expiration of the \nperiod for receiving submissions, the CBSA regional office should review all danger opinion material to \ndetermine that the package is complete before forwarding it to the CBSA, NHQ.  \nThe officer or manager should not summarize or comment on the documents submitted by the person \nconcerned when completing the documentation. \nThe officer should forward copies of all documentation and submissions to the DAS at the CBSA, NHQ \n(see section 4.1). The following is to be included in the danger opinion package: \n• \nnotice to the person concerned and their counsel, if known; \n• \nacknowledgement of service to the client; \n• \nall documentation provided to the person concerned; and \n• \nsubmissions made by the person concerned or their counsel, if any. \n"
    },
    {
      "page": 19,
      "chars": 2487,
      "text": "ENF 28 Ministerial opinions on danger to the public, nature and severity of the acts committed and \ndanger to the security of Canada \n2017-11-21 \n \n19 \nIn cases where the person concerned is detained, it is imperative that the regional officer clearly identify \nthis information on the cover letter when referring the case to NHQ and that any future changes in \ndetention status be forwarded without delay. \nIn hybrid cases involving both paragraphs A115(2)(a) and (b), the DAS at the CBSA, NHQ, will coordinate \nthe preparation and disclosure of both assessments with IRCC Case Management so that they can be \ndone simultaneously. \nAfter preparing the assessment of the danger to the security of Canada and/or of the nature and severity, \nthe DAS will contact IRCC Case Management at NHQ for them to prepare the assessment of the risks \nassociated with removal and of humanitarian and compassionate considerations prior to disclosure. Once \nboth assessments have been completed, the DAS will provide the package for disclosure to the regional \noffice concerned. See section 7.12. \nNote: A copy of the danger opinion package should be kept in the responsible originating office file. \n7.8 Documentation \nWhen possible, when third parties are involved, certified copies should be made by the issuing authority \nof the original document. Authority to disclose third-party information should be sought where required. \nCopies of original documentation that must be provided to NHQ within the danger opinion package \ninclude \n• \nthe Danger to the Public – Ministerial Opinion Report form [IMM 5367B] in hybrid and \nparagraph 115(2)(a) cases only;  \n• \nthe Danger Opinion Narrative Report form, found in Appendix D, in hybrid and \nparagraph 115(2)(b) cases; \n• \na section A44 report highlights form [IMM 5051B or IMM 5084B], which details the person’s \ninadmissibility and personal history (employment, family, community involvement, associations, \netc.) in Canada; \n• \nthe person’s Basis of Claim form (BOC) or Personal Information Form (PIF), if applicable; \n• \nrelevant interview notes; \n• \ndecisions from the Immigration Refugee Board (IRB), including available transcripts, exhibits and \nremoval orders or detention reviews; \n• \nany permanent residence, citizenship, sponsorship or overseas immigration applications; \n• \nfor each offence, police occurrence or observance reports linking the person to criminal activity or \nknown associates, organizations or accomplices, if releasable; \n"
    },
    {
      "page": 20,
      "chars": 2397,
      "text": "ENF 28 Ministerial opinions on danger to the public, nature and severity of the acts committed and \ndanger to the security of Canada \n2017-11-21 \n \n20 \n• \ncourt decisions, pre-sentence reports or the judge’s sentencing remarks, which should determine \nthat the level of risk is consistent with the officer’s recommendation; \n• \nprobation and parole services and Correctional Service Canada documentation addressing \nrehabilitation issues; \n• \nCorrectional Service Canada reports that include information about the crime; \n• \nan RCMP Summary of Police Information form [C480], which must be obtained by forwarding the \nperson’s fingerprints to the RCMP (after an RCMP Summary of Police Information form is \nobtained, conviction certificates for each conviction are not required); \n• \nonly credible and reliable evidence underlying criminal charges, and not the charges in and of \nthemselves, which can be used in the absence of a criminal conviction, when they indicate a \npattern of negative behaviour; \n• \nall evidence, whether it be positive or negative to the person concerned; \n• \nevidence of rehabilitation; information concerning the person’s behaviour during immigration \nproceedings, criminal proceedings and detention;  \n• \nmedia reports regarding the person, the organization and the offences committed (keeping in \nmind that while media accounts may not be completely accurate, they are of use in demonstrating \nthe impact of the crimes on the community); \n• \nany other document on file that could be relevant to assessing the danger the person represents \nto the public or to the security of Canada or the nature and severity of the acts committed. \nThe following documentation should not be included: \n• \nstatements that are speculative in nature; \n• \ninformation that cannot be sourced; and \n• \ninformation relating to charges under the Youth Criminal Justice Act (YCJA) that have been \nwithdrawn or stayed. Absolute or conditional discharges must be blocked out (refer to \nsection 7.11 below). \n7.9 Urgent consideration \nThe officer must clearly indicate the reasons for urgency on the danger package. NHQ will try to ensure \nthat the request is processed as quickly as possible.  \nThe officer must provide the following: \n• \njustification for the request; \n• \nthe date of release from criminal incarceration, if applicable; \n• \nwhere and by whom the person is being detained; and \n"
    },
    {
      "page": 21,
      "chars": 2182,
      "text": "ENF 28 Ministerial opinions on danger to the public, nature and severity of the acts committed and \ndanger to the security of Canada \n2017-11-21 \n \n21 \n• \nthe date on which the person was released by a member of the Immigration Division, if \napplicable. \n7.10 Humanitarian and compassionate considerations \nAny humanitarian and compassionate considerations submitted by the person concerned or their counsel \nmust be considered by the decision maker in subsection A115(2) cases. \nFurther information on humanitarian and compassionate considerations is available in the program \ndelivery instructions on permanent residents. \n7.11 The Youth Criminal Justice Act (YCJA) \nAny material references to a person’s record under the YCJA, such as correctional reports and \nsentencing remarks, may be put before the decision maker when forming a danger opinion in the \nfollowing circumstance:  \nParagraph 119(2)(i) and subsection 119(9) of the YCJA allow for crimes committed by a young offender \nto be considered if the individual is convicted as an adult three years after the completion of the YCJA \nsentence for summary convictions and five years after the completion of the YCJA sentence for indictable \noffences. \nFor information that does not make up the individual’s criminal record, such as charges that have been \nwithdrawn or stayed, absolute or conditional discharges under the YCJA and convictions that do not fall \nwithin the three- or five-year exception, the officer preparing the danger opinion submission should \n• \nmake a note to file; \n• \nlegibly sign and date the form to indicate that this information was blocked out in order to remove \nany references to material that is non-releasable; and \n• \nindicate in the letter attached to the package that the information blocked out cannot be provided \nto the decision maker. \nIn the case of a judicial review, the officer may explain in an affidavit why sections were blocked out in \norder to confirm that the material was not put before the decision maker.  \nThe person concerned must be provided with a copy of the package that is presented to the Minister’s \ndelegate, including the sections that have been blocked out.  \n"
    },
    {
      "page": 22,
      "chars": 2338,
      "text": "ENF 28 Ministerial opinions on danger to the public, nature and severity of the acts committed and \ndanger to the security of Canada \n2017-11-21 \n \n22 \nNote: If officers consider any evidence pertaining to a record under the YCJA to be relevant, they should \nfollow the appropriate procedures pertaining to procedural fairness for including this information. \n7.12 Disclosure \nDisclosure prior to ministerial review \nThe CBSA regional office discloses the assessments of the danger to the public, danger to the security of \nCanada or nature and severity of the acts and the risks and humanitarian and compassionate \nconsiderations received from NHQ to the subject and their counsel for written submissions. \nUpon receipt of the disclosure package, the CBSA regional office must \n• \nadvise the DAS when the package is received by them from NHQ; \n• \nadvise the DAS when the package is disclosed to the subject and counsel; \n• \nprovide the DAS with an electronic copy of the disclosure letter that has been signed by the \nperson concerned acknowledging receipt of the disclosure package or with the refusal to sign or \nacknowledge, if applicable; \n• \nprovide the date by which submissions by the subject must be received (15 days); and \n• \nadvise the DAS when they receive submissions (or fail to receive them). \n7.13 Extension requests for submissions  \nShould the person or counsel retained by the person request an extension of the 15-day period, the \nCBSA regional office will \n• \nconsider the reasons for the request and consult with the DAS, CBSA, NHQ; \n• \ngrant the extension, if it is allowed, for a short period only; \n• \nacknowledge the request in writing and include it in the danger opinion package; and \n• \nadvise the appropriate section at NHQ of the granted extension request and of the new date \nsubmissions are due. \nIf the request was made after submissions were due and the danger package has already been provided \nto the Minister for decision, advise the client or their counsel that, even though a late submission cannot \nbe refused, there is no guarantee that the submission will be considered, as it may reach the decision \nmaker after a decision has already been made. The DAS, CBSA, NHQ, must be made aware of such \nrequests and will inform the IRCC decision maker, who must always be made aware of such requests. \n"
    },
    {
      "page": 23,
      "chars": 2314,
      "text": "ENF 28 Ministerial opinions on danger to the public, nature and severity of the acts committed and \ndanger to the security of Canada \n2017-11-21 \n \n23 \nAll submissions must be accepted by the local responsible office and referred to the appropriate section \nat NHQ, regardless of whether an extension was granted.  \n7.14 Following receipt of submissions \nUpon receipt of a submission, the CBSA regional office will forward the following documentation to the \nDAS, CBSA: \n• \nany submissions made by the subject or their counsel (depending on the size of the material, this \ncan be done electronically or via mail); \n• \na copy of the signed disclosure letter sent to the client; and \n• \nany additional evidence being introduced by the local responsible office that has been disclosed \nto the client.  \n7.15 After the Minister’s delegate’s danger opinion decision \nAfter the Minister’s delegate issues an opinion under paragraphs A115(2)(a) and/or (b), a copy of the \ndecision will be sent by IRCC’s Case Management Branch, NHQ, to the DAS, CBSA, NHQ, who will then \nforward the decision to the originating CBSA office for further action. \nThe manager of the originating CBSA office is responsible for notifying the person concerned \nimmediately, in writing, of the decision. Notice should also be provided to the person’s counsel when one \nis on file. \nIf the person is to be removed, the process will require coordination with the local Removals Screening \nUnit. \n7.16 Reconsideration of danger opinion \nNote 1: Requests for reconsideration will not stay the processing of a case, including removal. The \nremovals officer is responsible for deciding whether a deferral of removal is appropriate in each case. \nNote 2: Where the subject of a danger opinion pursuant to section A115(2)(a) has obtained a record \nsuspension for the underlying serious criminality conviction(s), please request advice from the CBSA \nDanger Assessments Section (DAS) (CBSA-ASFC_Danger_Assessments-\nEvaluations_De_Danger@cbsa-asfc.gc.ca), who will consult with the IRCC Case Management Branch. \nUpon receipt of a request for reconsideration of a danger opinion, the local CBSA office will forward the \nrequest to the CBSA DAS. A decision maker at the IRCC Case Management Branch will then be \nassigned to make a decision on the request. \n"
    },
    {
      "page": 24,
      "chars": 2447,
      "text": "ENF 28 Ministerial opinions on danger to the public, nature and severity of the acts committed and \ndanger to the security of Canada \n2017-11-21 \n \n24 \nA decision maker will review the request and determine whether to reopen the original danger decision \nbased on whether the request (along with any accompanying submissions) demonstrates one of the \nfollowing: \no New evidence has been submitted that meets all of the following criteria:  \na) Reliable: Is the evidence reliable, considering its source and the circumstances \nin which it came into existence?  \nb) Relevance: Is the evidence relevant to the decision type, in the sense that it is \ncapable of proving or disproving a fact that is relevant to the proceeding? \nc) Materiality: Is the evidence material, in the sense that the decision maker may \nhave come to a different conclusion if it had been known?  \nd) Newness: Is the evidence new in the sense that it is capable of \ni. \nproving the current state of affairs in the country of removal; \nii. \nproving a fact that was unknown at the time of the original decision; \niii. \ncontradicting a finding of fact made by the original decision maker? \no \nA principle of natural justice was violated by the original decision maker. \nReopening and reconsidering \nWhere the decision maker decides that a reopening of the original danger opinion is required based on either \nor both of the 2 above assessments, it becomes as though the initial decision was never finalized, and a \nnew decision must therefore be made. This second decision is termed the reconsideration decision. \nBefore the new decision is rendered, the subject of the danger opinion and/or their counsel should be \ninformed of the decision to reconsider, and a further opportunity for submissions should be provided. \nRefusal to reopen and reconsider \nAlternatively, after reviewing the request to reconsider and any new submissions made in support of the \nrequest, the decision maker may deny the request. The decision maker must explain the reasons for \nrefusing to reopen the original decision with regard to the applicant’s submissions and the policy \nguidelines. This may be done in letter format. \n7.17 Info-alert \nThe Immigration Cases Division, Case Management Branch will enter an info-alert in the Global Case \nManagement System (GCMS) regarding the decision of the Minister’s delegate concerning a request for \na danger opinion or a request for reconsideration. \n \n \n"
    },
    {
      "page": 25,
      "chars": 2697,
      "text": "ENF 28 Ministerial opinions on danger to the public, nature and severity of the acts committed and \ndanger to the security of Canada \n2017-11-21 \n \n25 \nAppendix A Letter advising the client that the CBSA will seek \nthe Minister’s opinion on the basis of paragraph A115(2)(a) \nSubject: Notice of intention to seek the opinion of the Minister, pursuant to paragraph 115(2)(a) of the \nImmigration and Refugee Protection Act, that you are a danger to the public in Canada \n[Person’s name]: \nYou are hereby advised that the Canada Border Services Agency (CBSA) possesses information \nsuggesting you are a person in Canada who is a danger to the public. The CBSA intends to request an \nopinion, pursuant to paragraph 115(2)(a) of the Immigration and Refugee Protection Act (IRPA), from the \nMinister of Immigration, Refugees and Citizenship Canada (IRCC), which, if given, will have serious \nconsequences for you. \nIf the Minister is of the opinion that you are a danger to the public in Canada, you may be removed from \nCanada to [list the country or countries here].  \nAn assessment will be made of the threat that you pose to the public in Canada. In addition, an \nassessment will be made of the possibility of risk you may face should you be removed from Canada to \nthe country from which you have been determined to be a protected person, the country from which you \ncame to Canada, the country of your permanent residence, the country of your nationality or the country \nof your birth as well as of any humanitarian and compassionate considerations. These assessments will \nbe disclosed to you before they are presented to the Minister for decision. The following is a list of some \nof the materials that will be presented to the Minister for consideration, copies of which are included with \nthis letter: \n• \n[List all pertinent documentary evidence that will be forwarded to the Case Management Branch, \nIRCC, NHQ] \nThe Minister may refer to your refugee claim material, where applicable, and to the most recent and \ncurrent country information available at the Immigration and Refugee Board Documentation Centre. This \ninformation may include the Human Rights Package, the Contextual Package, the Indexed Media Review \nand the Weekly Media Review, which cover the country or countries to which you may be removed. The \nMinister may also use other annually published and publicly available material.  \nYou may make any written representations or arguments that you deem necessary and submit any \ndocumentary evidence that you believe to be relevant. All representations, arguments or evidence—\nwhich should address whether you are a danger to the public, the risks you may face if removed from \n"
    },
    {
      "page": 26,
      "chars": 1392,
      "text": "ENF 28 Ministerial opinions on danger to the public, nature and severity of the acts committed and \ndanger to the security of Canada \n2017-11-21 \n \n26 \nCanada and any humanitarian and compassionate factors—that are to be considered by the Minister \nmust be received by the CBSA at the address noted above on or before the expiration of 15 days from \nthe date you receive this letter. All material must be submitted in either of Canada’s official languages. \nPrior to being presented to the Minister’s delegate for decision, you and/or your counsel will be provided \nwith the assessment of the danger you may pose to the public, the risks you may face upon removal, and \nhumanitarian and compassionate factors in your case as well as all supporting documentation considered \nin the assessment that has not already been disclosed to you or your counsel. Following receipt of this \ninformation, you will be invited to make further written submissions within a certain time frame. Your \nsubmissions, along with the documents disclosed to you, will be presented to the Minister’s delegate for \ndecision. \nOnce a determination is rendered, pursuant to paragraph 115(2)(a) of the IRPA, you will be informed in \nwriting of the decision of the Minister. \nYours truly, \n[Name of manager or supervisor], CBSA \nEncl.: ___________________________________ \nReceipt acknowledged ______________ \n[Date] \n \n \n"
    },
    {
      "page": 27,
      "chars": 2665,
      "text": "ENF 28 Ministerial opinions on danger to the public, nature and severity of the acts committed and \ndanger to the security of Canada \n2017-11-21 \n \n27 \nAppendix B Letter advising the client that the CBSA will seek \nthe Minister’s opinion on the basis of paragraph A115(2)(b) \nSubject: Notice of intention to seek the opinion of the Minister pursuant to paragraph 115(2)(b) of the \nImmigration and Refugee Protection Act \n[Person’s name]: \nYou are hereby advised that the Canada Border Services Agency (CBSA) possesses information \nsuggesting you are a person who should not be allowed to remain in Canada on the basis of the nature \nand severity of acts committed or the danger to the security of Canada. The CBSA intends to request an \nopinion, pursuant to paragraph 115(2)(b) of the Immigration and Refugee Protection Act (IRPA), from the \nMinister of Immigration, Refugees and Citizenship Canada (IRCC), which, if given, will have serious \nconsequences for you. \nIf the Minister is of the opinion that you are a person who should not be allowed to remain in Canada on \nthe basis of the nature and severity of acts committed or of the danger to the security of Canada, you may \nbe removed from Canada to [list the country or countries here]. \nAn assessment of the nature and severity of acts committed or of the danger to the security of Canada \nwill be made by the CBSA. In addition, an assessment will be made by IRCC of the possibility of risk you \nmay face should you be removed from Canada to the country from which you have been determined to \nbe a protected person, the country from which you came to Canada, the country of your permanent \nresidence, the country of your nationality or the country of your birth as well as of any humanitarian and \ncompassionate considerations. These assessments will be disclosed to you before they are presented to \nthe Minister for decision. \nThe following is a list of some of the materials that will be presented to the Minister for consideration, \ncopies of which are included with this letter: \n• \n[List all documentary evidence pertinent to danger considerations that will be forwarded to the \nCase Management Branch, IRCC, NHQ] \nThe Minister may refer to your refugee claim material, where applicable, and to the most recent and \ncurrent country information available at the Immigration and Refugee Board Documentation Centre. This \ninformation may include the Human Rights Package, the Contextual Package, the Indexed Media Review \nand the Weekly Media Review, which cover the country or countries to which you may be removed. The \nMinister may also use other annually published and publicly available material. \n"
    },
    {
      "page": 28,
      "chars": 1886,
      "text": "ENF 28 Ministerial opinions on danger to the public, nature and severity of the acts committed and \ndanger to the security of Canada \n2017-11-21 \n \n28 \nYou may make any written representations or arguments that you deem necessary and submit any \ndocumentary evidence that you believe to be relevant. All representations, arguments or evidence—\nwhich should address whether you are a person who should not be allowed to remain in Canada on the \nbasis of the nature and severity of acts committed or the danger to the security of Canada, the risks you \nmay face if removed from Canada and any humanitarian and compassionate factors—that are to be \nconsidered by the Minister must be received by the CBSA at the address noted above on or before the \nexpiration of 15 days from the date you receive this letter. All material must be submitted in either of \nCanada’s official languages. \nPrior to being presented to the Minister’s delegate for decision, you and/or your counsel will be provided \nwith the assessment of the danger it is believed you pose to the security of Canada, the nature and \nseverity of the acts committed, the risks you may face upon removal and humanitarian and \ncompassionate factors in your case as well as all supporting documentation considered in the \nassessment that has not already been disclosed to you or your counsel. Following receipt of this \ninformation, you will be invited to make further written submissions within a certain time frame. Your \nsubmissions, along with the documents disclosed to you, will be presented to the Minister’s delegate for \ndecision. \nOnce a determination is rendered pursuant to paragraph 115(2)(b) of the IRPA, you will be informed in \nwriting of the decision of the Minister. \nYours truly, \n[Name of manager or supervisor], CBSA \nEncl.: ___________________________________ \nReceipt acknowledged ______________ \n[Date] \n \n \n"
    },
    {
      "page": 29,
      "chars": 2769,
      "text": "ENF 28 Ministerial opinions on danger to the public, nature and severity of the acts committed and \ndanger to the security of Canada \n2017-11-21 \n \n29 \nAppendix C Letter advising the client that the CBSA will seek \nthe Minister’s opinion on the basis of paragraphs A115(2)(a) and \n(b) \nSubject: Notice of intention to seek the opinion of the Minister pursuant to paragraphs 115(2)(a) and (b) of \nthe Immigration and Refugee Protection Act \n[Person’s name]: \nYou are hereby advised that the Canada Border Services Agency (CBSA) possesses information \nsuggesting you are a person in Canada who should not be allowed to remain in Canada on the basis of \nthe nature and severity of acts committed, the danger to the security of Canada or the danger to the \npublic. The CBSA intends to request an opinion, pursuant to paragraphs 115(2)(a) and (b) of the \nImmigration and Refugee Protection Act (IRPA), from the Minister of Immigration, Refugees and \nCitizenship Canada (IRCC), which, if given, will have serious consequences for you. \nIf the Minister is of the opinion that you are a person who should not be allowed to remain in Canada on \nthe basis of the nature and severity of acts committed, the danger to the security of Canada or the danger \nto the public, you may be removed from Canada to [list the country or countries here]. \nAn assessment of the nature and severity of acts committed or the danger to the security of Canada will \nbe prepared by the CBSA. An assessment of the danger to the public, the possibility of risk you may face \nshould you be removed from Canada to the country from which you have been determined to be a \nprotected person, the country from which you came to Canada, the country of your permanent residence, \nthe country of your nationality or the country of your birth as well as of any humanitarian and \ncompassionate considerations will be prepared by IRCC. These assessments will be disclosed to you \nbefore they are presented to the Minister for decision. The following is a list of some of the materials that \nwill be presented to the Minister for consideration, copies of which are included with this letter: \n• \n[List all documentary evidence pertinent to danger considerations that will be forwarded to the \nCase Management Branch, IRCC, NHQ] \nThe Minister may refer to your refugee claim material, where applicable, and to the most recent and \ncurrent country information available at the Immigration and Refugee Board Documentation Centre. This \ninformation may include the Human Rights Package, the Contextual Package, the Indexed Media Review \nand the Weekly Media Review, which cover the country or countries to which you may be removed. The \nMinister may also use other annually published and publicly available material. \n"
    },
    {
      "page": 30,
      "chars": 1998,
      "text": "ENF 28 Ministerial opinions on danger to the public, nature and severity of the acts committed and \ndanger to the security of Canada \n2017-11-21 \n \n30 \nYou may make any written representations or arguments that you deem necessary and submit any \ndocumentary evidence that you believe to be relevant. All representations, arguments or evidence—\nwhich should address whether you are a person who should not be allowed to remain in Canada on the \nbasis of the nature and severity of acts committed, the danger to the security of Canada or the danger to \nthe public and the risks you may face if removed from Canada, and any humanitarian and compassionate \nfactors—that are to be considered by the Minister must be received by the CBSA at the address noted \nabove on or before the expiration of 15 days from the date you received this letter. All material must be \nsubmitted in either of Canada’s official languages. \nPrior to being presented to the Minister’s delegate for decision, you and/or your counsel will be provided \nwith the assessment of the danger it is believed you pose to the security of Canada and the nature and \nseverity of the acts committed as well as the assessment of the danger you may pose to the public, the \nrisks you may face upon removal and humanitarian and compassionate factors in your case as well as all \nsupporting documentation considered in the assessments that has not already been disclosed to you or \nyour counsel. Following receipt of this information, you will be invited to make further written submissions \nwithin a certain time frame. Your submissions, along with the documents disclosed to you, will be \npresented to the Minister’s delegate for decision. \nOnce a determination is rendered, pursuant to paragraphs 115(2)(a) and (b) of the IRPA, you will be \ninformed in writing of the decision of the Minister. \nYours truly, \n[Name of manager or supervisor], CBSA \nEncl.: ___________________________________ \nReceipt acknowledged ______________ \n[Date] \n \n \n"
    },
    {
      "page": 31,
      "chars": 1450,
      "text": "ENF 28 Ministerial opinions on danger to the public, nature and severity of the acts committed and \ndanger to the security of Canada \n2017-11-21 \n \n31 \nAppendix D Danger Opinion Narrative Report form for use in \nparagraph A115(2)(b) cases and hybrid cases involving \nparagraphs A115(2)(a) and (b) \n DANGER OPINION NARRATIVE REPORT  \nTo:  \n      \nFrom:  \n      \nDate:       \nFile #:       \nUCI/FOSS ID #:        \nFPS #:       \nInadmissibility findings:       \nDanger opinion sought pursuant to \n115(2)(a) \n115(2)(b) [danger guidance request] \n115(2)(a) and (b) [danger guidance request] \nDETENTION STATUS \n Not detained \n Detained          Detained since:       \n      \n IRPA          Next detention review:        \n      \n Criminal    *fill out section 9 \nSECTION 1 BACKGROUND INFORMATION \nSurname:       \nGiven names:       \nDate of birth:       \nAlias(es) or former name(s):  \n      \nPlace of birth:       \nCitizenship:       \nDate of arrival in Canada:       \nDate of CR status:       \nDate of PR status:        \nMarital status:       \nNumber of children:       \nSECTION 2A RELATIVES IN CANADA \nList all relatives including spouse, common law  spouse, children, parents, siblings, etc. \nName \nRelationship \n1.       \n2.       \n… \n1.       \n2.       \n… \nSECTION 2B RELATIVES OUTSIDE OF CANADA \nList relatives including spouse, common law  spouse, children, parents, siblings, etc. \nName \nRelationship \n1.       \n2.       \n… \n1.       \n2.       \n… \n"
    },
    {
      "page": 32,
      "chars": 3391,
      "text": "ENF 28 Ministerial opinions on danger to the public, nature and severity of the acts committed and \ndanger to the security of Canada \n2017-11-21 \n \n32 \nSECTION 3 CRIMINAL HISTORY \nList all offences, disposition and sentence \nDate \nCharges  \nDisposition (withdrawn, \nconvicted, not guilty, \netc.) \nSentence \n1.       \n2.       \n… \n1.       \n2.       \n… \n1.       \n2.       \n… \n1.       \n2.       \n… \nSECTION 4 CIRCUMSTANCES OF INADMISSIBILITY \nList all occurrences with police, role and activities on behalf of the organization, etc. \n      \n \nSECTION 5 DEGREE OF ESTABLISHMENT \nProvide a brief description of subject’s current and past employment and/or studies, of the assets and liabilities, the \nlevel of education, any trade/skills training, official languages ability, recent or past receipt of social \nassistance/unemployment insurance, of residence, of community involvement/ties, etc. \n      \n \nSECTION 6 HUMANITARIAN, COMPASSIONATE AND RISK  CONSIDERATIONS \nProvide any information on spouse, children, parents, siblings, etc. and the relationship w ith the subject including \nanyone dependent on the subject for financial or emotional support. Is the subject part of a nuclear family relationship? \nIf there is a child, does the subject play a strong parental role? Is there any indication of drug/alcohol abuse or \ndependence? What hardship, if any, w ould the subject experience if removed to his/her home country? If removed, \nw hat hardship, if any, w ould anyone in Canada experience as a result of the removal? Has the subject been issued a \nw arning letter in the past? If an interview  was not conducted, w hat attempts w ere made to contact the subject? \n      \n \nSECTION 7 POTENTIAL FOR REHABILITATION \nProvide any information as to w hether the subject has admitted their guilt or participation in the activities during the \ninterview , the testimony or by a guilty plea at trial. Is there an appeal of the conviction or sentence? Is the subject still \nin contact w ith any co-accused or members of the organization? Has the subject attempted to improve their life (i.e., \nentering a rehabilitation program, upgrading skills/education)? Does the subject have stable/supportive family \nmembers or others w ho are w illing and able to assist in the rehabilitation efforts? Is the subject w orking or is there an \noffer of employment upon release? Has the subject reintegrated or made a plan to reintegrate into the community? \nHas the subject expressed remorse for their actions? Has the subject indicated a desire or need to rehabilitate? Does \nthe offence or do activities seem isolated? Are there outstanding charges? What w as the subject’s attitude or level of \nco-operation w hile detained or at the interview ? Etc. \n      \n \nSECTION 8 RECOMMENDATION AND DANGER RATIONALE \nProvide information on w hether the offence/activities involved violence. Were there any criminal proceedings or \nconvictions? If so, w hat w as the sentence? Is there a pattern of criminal behaviour and if so, is it escalating? What \nw as the impact of the activities on the victim(s), public and society? Has the subject expressed remorse or \nrenounced their activities? Is the subject still involved w ith the organization or its members? What is the likelihood \nof the subject becoming a contributing and law  abiding member of society? Are there any removal impediments? \nEtc. \n      \n \n"
    },
    {
      "page": 33,
      "chars": 1794,
      "text": "ENF 28 Ministerial opinions on danger to the public, nature and severity of the acts committed and \ndanger to the security of Canada \n2017-11-21 \n \n33 \nSECTION 9 CORRECTIONAL INSTITUTION INFORMATION \nCase management officer and phone \nnumber:       \nPlace of detention:       \nFPS number:       \nDay parole eligibility date:       \nFull parole eligibility date:       \nStatutory release date:       \nWarrant expiry date:       \nSECTION 10 LIST OF ATTACHMENTS \nPlease provide any and all document pertinent to assessing risks, danger to the public, danger to the security of \nCanada and/or nature and severity of the acts committed, such as the PIF, POE notes, CBSA/IRCC interview  notes, \nA44 reports, any IRB decisions, transcripts, court decisions, police/correctional services/parole board reports, \nintelligence reports, etc. \nInformation  \n Personal Information Form (PIF) / Basis of Claim form (BOC) \n Refugee Protection Division (RPD) / Convention Refugee Determination Division (CRDD) \ndecision(s) \n A44 report(s) \n Deportation order(s) \n Immigration Division (ID) – Inadmissibility decision(s) \n Immigration Division (ID) – Inadmissibility transcript (if on file) \n Immigration Division (ID) – Detention review decision(s) \n Court decision(s) \n Interview notes (specify date and organization responsible):       \n \nList all other documents being provided:       \n         \nSECTION 11 PUBLIC POLICY CONSIDERATIONS \nPlease list any public policy considerations.  \n      \nSECTION 12 LITIGATION \nPlease list any ongoing litigation for the subject.  \n      \n \nName of reporting officer:       \nSignature  \n \n \nDate:       \n \n**THIS DOCUMENT IS FOR CBSA PURPOSES ONLY. \nTO REQUEST AUTHORIZATION TO SHARE THIS DOCUMENT, PLEASE \nCONTACT THE MANAGER OF THE CBSA DANGER ASSESSMENTS SECTION.** \n"
    }
  ]
}