{
  "file": "/workspaces/legalnew/manuals/enf34-eng.pdf",
  "page_count": 29,
  "pages": [
    {
      "page": 1,
      "chars": 61,
      "text": " \n \n \n \n \n \n \nENF 34 \nAlternatives to Detention Program \n \n \n"
    },
    {
      "page": 2,
      "chars": 4115,
      "text": " \nENF 34 Alternatives to Detention Program  \n  \nCONTENTS  \n1. Updates to chapter ....................................................................................................... 3 \n1.1. Listing by date ........................................................................................................ 3 \n2. What this chapter is about ............................................................................................ 3 \n3. Definitions  ................................................................................................................... 4 \n4. Program Objectives ...................................................................................................... 5 \n5. The Acts and Regulations ............................................................................................ 6 \n6. Forms and Publications ................................................................................................ 6 \n7. Departmental Policy ..................................................................................................... 7 \n8. Assessment of alternatives to detention ....................................................................... 7 \n8.1. Risk identification for ATD Considerations ............................................................. 7 \n8.2. Conducting the risk analysis .................................................................................. 8 \n8.3. Risk offset ............................................................................................................ 11 \n8.4. Evaluation of residual risk .................................................................................... 11 \n8.5. Documenting the decision .................................................................................... 12 \n9. Vulnerable persons .................................................................................................... 13 \n10. Minors ...................................................................................................................... 14 \n11. Use of Alternatives to Detention Program tools at ports of entry .............................. 14 \n12. Alternatives to Detention .......................................................................................... 14 \n12.1. Imposition of Conditions under 56(1) ................................................................. 15 \n12.2. Issuance of deposits and guarantees ................................................................ 15 \n12.3. In-person reporting ............................................................................................. 16 \n12.4. Remote Reporting .............................................................................................. 16 \n12.5. Community Case Management and Supervision ............................................... 16 \n12.6. Electronic monitoring.......................................................................................... 22 \n13. Roles and responsibilities ........................................................................................ 24 \n13.1. Community liaison officer ................................................................................... 24 \n13.2. CSC National Monitoring Centre ........................................................................ 25 \n13.3. CCMS service provider ...................................................................................... 25 \n14.0. Jurisprudence........................................................................................................ 25 \n15. Presenting the alternatives to detention assessment at detention reviews .............. 28 \n16. Privacy and information-sharing ............................................................................... 28 \n16.1. Community case management and supervision Privacy Notice form ................ 29 \n16.2. Requesting sensitive information from the community case management and \nsupervision service provider ....................................................................................... 29 \n \n  \n  \n  \n  \n  \n"
    },
    {
      "page": 3,
      "chars": 1634,
      "text": "3  \n  \n1. Updates to chapter  \n1.1. Listing by date  \n2023-10-26 \nSubstantive revisions were made to improve the flow of the manual and to reflect \nupdated procedures, including the following: \n Updated definitions section. \n Sections 3.0 to 6.0 are new and include Program Objectives, Acts and \nRegulations, Forms and Publications, and Departmental Policy. The forms were \nformally in Annex A. \n Updated information on identity cases under 8.2.2.Revised information on risk \noffset 8.3, 8.4, and 8.5, particularly around the role of the Community Liaison \nOfficer.  \n Updated information under section 9.0 vulnerable persons, including \nvulnerabilities to be considered.  \n Revised information under section 11. \n Revisions were made to section 12, 12.4.2, 12.4.4, 12.4.5, 12.6 and 12.6.1.  \n New section added under 12.5.3 for CCMS transfers. \n New section added under 12.5.5 for the use of interpreters. \n Reference to Voice Reporting as an ATD option has been removed.  \n Revised Community Liaison Roles and Responsibilities under section 13. \n New section for jurisprudence.  \n \n22 June 2018 – Initial version  \n2. What this chapter is about  \nThis chapter describes the elements of the Alternatives to Detention (ATD) Program and \nprovides information and guidance on how the tools available under the ATD Program should \nbe used.  \n  \nThis chapter is meant to be read in conjunction with  \n  \n• \nENF 3 Admissibility Hearings and Detention Reviews  \n• \nENF 7 Immigration Investigations and IPRA s.55 Arrests/Detention  \n• \nENF 8 Deposits and Guarantees  \n• \nENF 20 Detentions  \n• \nENF 22 Persons serving a sentence  \n"
    },
    {
      "page": 4,
      "chars": 2522,
      "text": "4  \n  \n \nRequests for clarification, questions and comments in relation to this manual should be \naddressed to the Canada Border Services Agency (CBSA) Alternatives to Detention Unit, \nIntelligence and Enforcement Branch’s generic mailbox at CBSA.Alternatives_to_Detention-\nSolutions_de_rechange_de_detentions.ASFC@cbsa-asfc.gc.ca. \n3. Definitions  \nAlternative to \ndetention  \nAn alternative to detention is defined as one of the conditions that may \nbe imposed on an individual to offset a risk they represent to the \nenforcement objectives and the mandate of the CBSA by either an \nofficer or a Member of the Immigration Division (ID) of the Immigration \nand Refugee Board (IRB).  \nCase closure  \nCase closure happens when an individual enrolled in an ATD no \nlonger requires community based support (for example, a change in \nthe individual’s risk level or circumstances where the individual has \nother support mechanisms, the individual has been compliant after \nalready being de-escalated or the individual is removed from the \ncountry). \nCommunity case \nmanagement and \nsupervision (CCMS)  \nThe CCMS program provides in-community support to individuals in \norder to manage and mitigate risk. CCMS promotes detention \navoidance or detention release for people who lack a bondsperson or \nrequire support in addition to a bondsperson to mitigate risk upon \nrelease into the community. The CBSA has entered into contracted \npartnerships with third-party service providers to support individuals in \nthe community.  \nDeposit \nThe payment of a sum of money by a person to the Receiver \nGeneral for Canada for compliance with the conditions imposed on \nthe person concerned and their release from detention. See ENF 8 \nDeposits and Guarantees. \nDetention review  \nSee ENF 3 Admissibility, Hearings and Detention Reviews.  \nElectronic \nmonitoring (EM)  \nEM is the use of a global positioning system (GPS), radio-frequency \n(RF) system or both to monitor individuals in the community. The EM \nmonitoring system is built on real-time location data, which is collected \nand analysed in a central facility and reported to regional staff to \npursue for enforcement, as deemed appropriate.  \nGuarantee  \nA guarantee is a written enforceable undertaking by a third party \n(the guarantor) that the person concerned will abide by the \nconditions imposed by a CBSA or IRCC officer or the Immigration \nDivision and to forfeit or pay a sum of money to the Crown if the \nperson concerned breaches any conditions. The guarantor and the \n"
    },
    {
      "page": 5,
      "chars": 1988,
      "text": "5  \n  \nperson concerned must both agree to the conditions. They are also \ncalled “performance bonds”. See ENF 8 Deposits and Guarantees. \nIn-person reporting  \nIn-person reporting is a condition imposed on individuals where they \nare required to physically appear at a specified place and make \nthemselves known to an official. Usually, this means attending a \nCBSA inland enforcement office and checking in with a CBSA staff \nmember, who verifies the individual’s identity and records their \nattendance in the system.  \nService provider  \nA service provider provides CCMS services on behalf of the CBSA to \neligible individuals and engages in discussions with the Community \nLiaison Officer (CLO), pertaining to individuals enrolled in CCMS \nservices.  \nWithdrawal of \nsupervision  \nWithdrawal of supervision is a decision made by the CCMS service \nprovider to the CLO or CBSA management when the provider is of the \nopinion that the individual can no longer be managed in the community \n(that is, when the individual is no longer willing to comply with the \nrequirements of the program).  \n  \n4. Program Objectives  \nThe ATD Program encompasses all conditions that can be imposed to manage and mitigate the \nrisk posed by an individual in relation to the enforcement objectives of the Immigration and \nRefugee Protection Act (IRPA) and the CBSA’s mandate. The ATD Program provides officers \nand the Immigration and Refugee Board (IRB) with tools and programs that enable them to \nmanage individuals released into the community more effectively.  \n  \nThe ATD Program is a mechanism to protect the integrity of Canada’s immigration detention \nsystem by ensuring individuals are treated fairly and in accordance with the overarching principle \nthat detention is a measure of last resort, and the decision to detain or release an individual is \nbased on the risk they present.  \n \nThe CLO is the ATD subject matter expert. They provide a centralized approach for the ATD \nprogram.  \n  \n \n \n"
    },
    {
      "page": 6,
      "chars": 2055,
      "text": "6  \n  \n5. The Acts and Regulations \nOfficers should be familiar with the legislative and regulatory authorities that surround the use of \nATDs contained in the IRPA and its Regulations. The following are referenced authorities that \nofficers should be familiar with: \n \nAuthorities \nSections \nof \nIRPA/IRPR \nRelease - officer \n \nAn officer may order the release from detention of a permanent resident or a \nforeign national before the first detention review by the Immigration Division if \nthe officer is of the opinion that the reasons for the detention no longer exist. \nThe officer may impose any conditions, including the payment of a deposit or \nthe posting of a guarantee for compliance with the conditions, that the officer \nconsiders necessary. \nA56(1) \nRelease – Immigration Division, Conditions \n \nIf the Immigration Division orders the release of a permanent resident or a \nforeign national, it may impose any conditions that it considers necessary, \nincluding the payment of a deposit or the posting of a guarantee for compliance \nwith the conditions. \nA58(3) \n \nOther factors \n \nIf it is determined that there are grounds for detention, the following factors \nshall be considered before a decision is made on detention or release: \n the existence of alternatives to detention \n \nR248(e) \n \n6. Forms and Publications \nThe ATD forms reflect the following: male, female and an unspecified options. The unspecified \nidentifier is an option that may be chosen by individuals who do not identify exclusively as male, \nfemale, as well as two-spirit individuals. However, some ATD forms will require an individual’s \ngender in order to ensure their safety and well-being through the ATD continuum. \n \nForm Title - CBSA \nForm \nNumber \nCommunity Case Management and Supervision Referral  \nBSF801 \nCommunity Case Management and Supervision - Supervision Agreement \nBSF802 \nCommunity Case Management and Supervision Privacy Notice \nBSF803 \nConsent to Share Location with the CBSA \nBSF804 \nCommunity Case Management and Supervision Case Summary \nBSF805 \n"
    },
    {
      "page": 7,
      "chars": 2028,
      "text": "7  \n  \nCommunity Case Management and Supervision (CCMS) Change of \nConditions  \nBSF806 \nCommunity Case Management and Supervision Report of Non-Compliance \nBSF807 \nClient Profile Set Up (Electronic Monitoring) \nBSF808 \nClient Instructions (Electronic Monitoring) \nBSF809 \n \nForm Title - Toronto Bail Program  \nBail Program Supervision Contract \nAgreement of Supervision: Crim \nAgreement of Supervision: Holding Centre \nGraduation Request  \nInterview Results \nWithdraw Supervision Letter Template \n \nThe ATD forms must be uploaded within seven business days into the Global Case Management \nSystem (GCMS) and in accordance with the Alternatives to Detention Forms Upload \nProcedures. The forms and assessment should also be placed on the individuals’ physical file.  \n \n \n7. Departmental Policy \nThe CBSA has established tools and programs that enable officers to more effectively release \nindividuals into the community, while achieving balanced enforcement outcomes. The ATD \nprogram provides risk-based, nationally consistent programming to individuals deemed suitable \nfor release from detention.  \n \nIn addition to the options of releasing an individual on reporting conditions (e.g., in-person \nreporting), cash deposit, or with a bond and/or guarantee upon the establishment of a suitable \nbondsperson, the ATD program also includes the option of: \n A national Community Case Management and Supervision (CCMS) program that \nmitigates risk factors in a manner that aligns in-community support services with \nindividuals’ needs. \n An Electronic Monitoring (EM) program that uses global positioning satellites, cellular and \nradio frequency technology to monitor an individual’s whereabouts.  \n \n \n8. Assessment of alternatives to detention  \n8.1. Risk identification for ATD Considerations \nRisk identification is an evaluation of the information available at the time of the assessment. \nInformation can be obtained through an interview and should include evidence available that \nmay help predict future behaviour.  \n  \n"
    },
    {
      "page": 8,
      "chars": 2608,
      "text": "8  \n  \nRisks related to the objectives of the IRPA can generally be categorized in the following ways:  \n  \n1. \nAs described in paragraphs A3(1)(h) and A3(2)(g) risk to public safety is related to the \nobjectives of the IRPA. Public safety is the top priority for the CBSA. When consequences \nassociated with public safety risks are significant, an officer may, where appropriate, impose \nconditions that they consider necessary, and the conditions must minimize the risk and be \nproportional to the risk (Mawut: 2022 FC 415, paragraph 35) for the purpose of release or \ndetention avoidance.  \n   \n2. \nRisk to program integrity is also a key consideration in regards to risk identification. These \nrisks relate to a negative impact on achieving all other objectives of the IRPA. The acceptable \ndegree of risk depends on the specific circumstances and is discussed further below.  \n  \nAt this stage, the focus is on identifying information that will be considered during the risk \nanalysis.  \n  \n8.2. Conducting the risk analysis  \nOnce all the available information on potential risks has been gathered, officers must analyze \nthe information to determine what weight should be given. The following factors and questions \nassist in determining the weight to be given:  \n  \n1. How reliable, accurate and comprehensive is the information?  \na. Greater weight should be given to information that is believed to be unbiased and fully \ndescribes the behaviour or circumstances.  \n2. How likely is it that the risk will impact the CBSA’s enforcement mandate or IRPA objective?  \na. Greater weight should be given to information that directly relates to the objectives of \nthe IRPA. For example, a history of failing to appear for immigration proceedings or to \nappear before the Court for criminal matters should be given more weight than failure \nto appear for regulatory (traffic) proceedings.  \n \nUsing the information gathered, officers consider the prescribed factors, as identified in sections \n244 to 247 of the Immigration and Refugee Protection Regulations (IRPR), as well as some \nadditional factors discussed below, as they relate to the grounds for detention. Where the \nindividual is subject to conditions under the Criminal Code of Canada, care should be taken to \nensure that the conditions imposed under the IRPA are not contradictory. Officers should be \naware of the specific details of any criminal conditions and should considered this as part of the \nrisk analysis. \n \nOfficers should reference ENF 7 for factors to be considered by an officer before, during and \nafter arrest/detention.  \n \n"
    },
    {
      "page": 9,
      "chars": 2922,
      "text": "9  \n  \n8.2.1. Flight risk  \nIndividuals who pose a risk of not appearing for proceedings (Unlikely to Appear) may be more \nlikely to appear than not after the imposition of conditions, taking into account the factors in \nsection R245 and paragraphs R248(b), (c) and (d) as well as any other relevant factors, such \nas:  \n• \nObjective assessment of their chances of gaining durable status in Canada.  \n• \nExistence of strong ties to a community in Canada.  \n Strong ties are a factor in favour of release if the ties are to a person or people \nwho can influence the person to appear for proceedings.  \n Strong ties are a factor against release if the person or people have shown not to \nhave a positive influence and, therefore, become a strong pull factor motivating \nthe individual not to appear for removal.  \n• \nAccess to  sufficient financial means, which may provide an increased ability to abscond.  \n• \nUse of false identity documents and aliases to evade detection from the authorities.  \n• \nPrevious attempts to hide their presence in Canada.  \n• \nLack of credibility, as demonstrated in dealings with immigration or police officials.  \n• \nCo-operation of the individual.  \n If an individual is uncooperative with the CBSA, this is a strong indicator that the \nindividual is unlikely to comply with imposed conditions.  \n  \n8.2.2. Identity  \nParagraph 58(1)(d) of the IRPA provides that delegated officials may issue an opinion to the \nImmigration Division with respect to the establishing of identity of the foreign national, which the \nImmigration Division must consider during a detention review. This opinion must be documented \nusing the BSF510 form. In regions with Immigration Holding Centres (IHCs) the foreign national \ncould be detained at the IHC until their identity is established.  \n \nEstablishing identity is a two-way street, in that both the Minister and the foreign national must \nwork together in an effort to establish the foreign nationals identity. The Immigration Division’s \nsupervisory jurisdiction on the issue of identity is limited to examining whether the Minister is \nconducting an ongoing investigation, in good faith, and the foreign national is cooperating with \nthe Minister in an effort to establish the foreign national’s identity. \n \nThe Federal Court of Appeal in Brown (2020 FCA 130, paragraph 99) states the following:  \n“ Detention cannot be ordered on the basis of non-cooperation alone—to do so would be \ncontrary to sections 7 and 9. But where the impasse in effecting removal is disputed identity \nand the detainee has refused to cooperate in confirming their identity, delays in removal \ncannot count against the Minister. Release in these circumstances would encourage \ndetainees to be less than forthcoming. Where a detainee is uncooperative, detention \ncannot be classified as indefinite because it is within the detainee’s control to change their \ndestiny. \n \n"
    },
    {
      "page": 10,
      "chars": 2712,
      "text": "10  \n  \nEstablishing the identity of an individual remains the cornerstone to the Canadian Immigration \nSystem (Singh: 2004 FC 1634, paragraph 38) and the non-confirmation of identity under the Act \nis still a ground for detention.  \n  \nThe CBSA must have enough reliable, accurate and comprehensive information to effectively \nassess the risk posed by an individual, if released. If the CBSA does not have sufficient \ninformation, release on the basis of ATDs is generally not appropriate until the CBSA is able to, \nbased on a balance of probabilities, feel sufficiently comfortable that the information on file is \nenough to predict risk.  \n  \n8.2.3. Danger  \nIndividuals who are detained for danger to the public should have their risk mitigated, so the risk \nof serious harm to the public is significantly reduced by the conditions being imposed. Factors \nto be assessed include the following:  \n  \n• \nassessment related to present or future danger based on prior history;  \n• \npositive danger opinion from the Minister; \n• \nassociation with criminal organizations, including people smuggling and human trafficking  \n(membership is not required, just association; a criminal record is not required either)  \n• \nconvictions in Canada for offences involving violence or drug trafficking  \n• \ncharges or convictions outside Canada involving violence or drugs trafficking  \n• \nage of convictions must be considered, as the more time that has passed since the \nconvictions the lesser the risk, taking into account efforts by the individual to rehabilitate, \nincluding any associated factors, such as substance addiction;  \n• \nparole, probation and bail decisions (where available) serve as good references when \nevaluating the level of danger, and may include risk assessment and related supervision \nconditions in the area of criminal history, institutional/custodial behavior, and community \nreintegration potential, etc.  \n CBSA’s assessment may take into consideration third party criminal justice \nagency information from a non-immigration perspective, and strengthen decision-\nmaking pertaining to the conditions recommended to manage risk. Where \npossible, CBSA’s conditions should respect any active parole, probation and bail \ndecisions to ensure consistency in the management of individuals risk to public \nsafety. \n• \nnature of the risk posed  \n For example, if an individual presents a very likely risk of serious harm to the \npublic, the risk should be significantly reduced by the conditions being imposed. If \nthe risk posed to the public is based on predictive factors and is more general in \nnature, the imposed conditions should reasonably be expected to reduce the \ngeneral risk posed.  \n  \n"
    },
    {
      "page": 11,
      "chars": 2712,
      "text": "11  \n  \n8.2.4. Mental health concerns  \nThe risk posed by individuals with mental health concerns depends largely on the available \ntreatment options and the individual’s ability and willingness to participate in the treatment. The \nhistory of the individual’s compliance with previous treatment is a good indicator of future \ncompliance. However, the individual’s history is only one factor to be considered, and should be \nassessed against their current ability and willingness to participate in treatment. \n \nThe National Risk Assessment for Detention (NRAD) form is used to determine the appropriate \nplacement of individuals in detention. Many of the factors identified and analyzed in the NRAD \nform are likely relevant to a risk analysis for alternatives to detention; however, the analysis of \nrisks for purposes of alternatives to detention must be done separately from the NRAD form \ndecision.  \n  \nFor more information on risk analysis and the use of the NRAD form, see ENF 20.  \n  \n8.3. Risk offset  \nRisk offset describes the degree to which the condition that is imposed is expected to minimize \nthe risk posed. Identifying conditions that effectively reduce the specific risk or risks posed is the \nintended outcome of this phase of the eligibility assessment of an ATD.  \n  \nA condition imposed as a risk offset should:  \n• minimize the likelihood of the risk impacting the enforcement outcome;  \n• minimize the risk of harm to the public;  \n• address specific negative behaviours of the individual;  \n• be reasonable and proportional to the risk.  \n  \nATD options may be combined together to offset risk. ATD options are at the disposal of CBSA \nofficers to leverage while imposing conditions on individuals that they consider necessary in light \nof the facts and circumstances before them. The imposed conditions must minimize risk and be \nproportional to the risk. For CCMS and EM, a suitability assessment must be conducted. For \nEM, concurrence from regional management is required.  \n \nFurthermore, the ATD program options are at the disposal of the Hearings Officer to leverage in \nconsultation with the CLO and the Inland Enforcement Officer while making recommendations \nof release during detention reviews before an Immigration Division Member of the IRB. \n \n \n8.4. Evaluation of residual risk  \nResidual risk is the level of risk that remains if it is decided that an individual be placed on \nconditions. It is either acceptable residual risk (the risk has been sufficiently mitigated) or \nunacceptable residual risk (the risk has not been sufficiently mitigated). When an officer (CLO, \nInland Enforcement Officer, Border Services Officer) is considering release, or when a Hearings \n"
    },
    {
      "page": 12,
      "chars": 2740,
      "text": "12  \n  \nOfficer is making submissions on a release plan to the IRB, the residual risk posed by the \nindividual, after conditions are imposed, is the primary consideration.  \n  \n What is acceptable or unacceptable in any given case depends on the unique facts of \nthe case. Therefore, a case-by-case analysis is required. It is important for officers to \nremember that if an individual is a flight risk, but poses no other risks, only those \nconditions that minimize their risk of absconding should be imposed. Similarly, if an \nindividual poses a risk to public safety, only the least onerous conditions to address that \nspecific risk should be imposed.   \n  \nWhen deciding if the residual risk is acceptable for individuals who are unlikely to appear, the \nofficer should be evaluating, on a balance of probabilities, whether the individual is more likely \nto appear than not.  \n  \nWhen deciding if the residual risk is acceptable for an individual who is detained for identity, the \nofficer must evaluate the risk of the individual not appearing and the possible danger to the public \nthe individual poses, taking into account the risks inherent in not being satisfied with the \nindividual’s identity. Additionally, the officer must be satisfied that the ability to continue the \ninvestigation into the individual’s identity is not negatively impacted by releasing the individual \non the conditions available.  \n  \nFor an individual who presents as a danger to the public, the residual risk must be very low. The \nIRPA prioritizes the safety of the public and, therefore, any risk posed must be minimal, taking \ninto account all of the individual circumstances.  \n  \nIf the residual risk is acceptable, in the officer’s opinion, they may decide to release prior to the \n48 hour detention review or present the release options to the Hearings Officer  for the detention \nreview.  \n  \nIf the residual risk is unacceptable, in the officer’s opinion, taking into account the factors in \nparagraphs R248(a) to (d), they should proceed with making a recommendation for continued \ndetention to the authorized reviewing manager or the Hearings Officer for the detention review, \nas appropriate.  \nENF 3 Admissibility Hearings and Detention Reviews provides guidance on evaluating residual \nrisk at detention reviews.  \n  \n8.5. Documenting the decision  \nOfficers are required to document their assessment of ATDs and the reasons for the \nrecommendation to continue detention or support release on ATDs. The written assessment of \nATDs must contain the salient facts and must include, at a minimum  \n  \n• the information that was available at the time the assessment was made;  \n• factors used to determine the weight given to the information;  \n"
    },
    {
      "page": 13,
      "chars": 2209,
      "text": "13  \n  \n• the risks identified;  \n• for a recommendation to continue detention, the factors in paragraphs R248(a) to (d) that \nweighed in favour of detention, when balanced against the risk offset provided by the \navailable ATDs;  \n• for a recommendation to release on the basis of ATDs, the risk offset provided by the ATDs;  \n• justification for any recommendation that is an exception to the guidelines provided in this \nmanual or other operational guidance.  \n  \nFor every assessment completed, all details must be entered into the relevant case management \nsystems (i.e., National Case Management System, GCMS, etc.). The BSF forms and \nassessment must be uploaded into GCMS in accordance with the Alternatives to Detention Form \nUpload Procedures and placed on the individuals’ physical file.  \n  \n9. Vulnerable persons  \nSome vulnerable persons have an increased risk, based on their vulnerability. For the purposes \nof immigration detention, vulnerable persons include but are not limited:  \n \npregnant women and nursing mothers; \n \nminors (under 18 years of age); \n \npersons suffering from a severe medical condition or disability; \n \npersons suffering from restricted mobility; \n \npersons with a suspected or known mental illness (including suicide and self harm); \n \nvictims of human trafficking; \n \npersons who may face hardship for sexual or gender based reasons or who may be \nvictims or survivors of gender-based violence. \n \nIt is recognized that detention has a greater impact on vulnerable persons, and detention should \nbe minimized to the extent possible for such groups. Risk tolerance may be influenced by \nvulnerability factors. Each case needs to be assessed on its case-specific factors to determine \nif release is a viable option. If the individual has been identified on the National Risk Assessment \nfor Detention or through an IHC doctor assessment as a vulnerable person, the assessment and, \nif applicable, a  referral to a CCMS Service Provider must be completed by the CLO within 72 \nhours of the vulnerability being noted and the decisions documented as per section 8.5 of this \nmanual. \n \nSee ENF 20 Detentions for more information regarding vulnerable persons.  \n  \n"
    },
    {
      "page": 14,
      "chars": 2349,
      "text": "14  \n  \n10. Minors  \nSee ENF 20 Detentions for guidance on the factors to be considered when a case involves a \nminor child. This includes detention decisions related to parents and legal guardians of minors \nwhen the minor is affected.  \n  \n11. Use of Alternatives to Detention Program tools at ports of \nentry  \nThe assessment process for ATDs is the same at ports of entry (POE) as it is for inland cases.  \nMost POE detentions are for a very short amount of time, and the grounds for detention are \nusually related to a high or unknown risk. These factors usually weigh heavily in favour of \ndetention. However, this does not preclude the officer’s responsibility to assess and consider \nATDs in all cases where detention may be continued.   \n \nAll officers arresting and/or detaining under section A55 of the IRPA, including officers at the \nPOE, are required to consider available ATDs. This includes officers detaining on entry under \nA55(3). Border Services Officers could leverage, where necessary and appropriate, deposits \nand guarantees as ATDs when imposing conditions under POE authorities. Please refer to ENF8 \nfor additional information on Deposits and Guarantees.  \n \nIn instances where the POE examination has ended and ATDs  are not available at the time of \narrest/detention under A55, the designated officer (e.g., Border Services Officer) that made the \ndecision to arrest and detain under A55 may refer the case to the CLO at the inland office that \nwill take carriage of the file, for further assessment of available ATDs.  \n  \nBorder Services Officers should ensure persons with disabilities are entitled to the same services \nas any other person, in accordance with the People Processing Manual Part One, Chapter Four \n– Awareness Issues.  \n \n \n12. Alternatives to Detention  \nVarious ATDs are available and must be reasonably considered prior to immigration detention \nand while the individual remains in immigration detention. The officer should consider the \nindividual’s immigration history and potential risk against the maximum risk that can be \nmitigated through each ATD. Accessibility to ATDs may differ between POE and inland \nenforcement offices. The availability of ATDs may be impacted by the time of day of the arrest \nas some require involvement from third parties (e.g., guarantor or service provider). \n \n"
    },
    {
      "page": 15,
      "chars": 2175,
      "text": "15  \n  \n12.1. Imposition of Conditions under 56(1) \n \n \nIRPA allows for general conditions to be imposed on individuals when the Minister orders the \nrelease of an individual. General conditions can be imposed with or without any additional \nconditions, such as payment of deposits, or in addition to other types of conditions (e.g. \ndeposits, community supervision, in-person reporting, etc.). It is important to note that release \nsolely on conditions equates to ATDs.  \n  \nThe following are commonly imposed conditions that are appropriate in a majority of cases where \nrelease from detention is being contemplated:  \n  \nCondition  \nRisk mitigation  \nKeep the CBSA \nupdated with a \ncurrent address  \nA current address allows the CBSA to locate the individual if they \nfail to comply with conditions or requirements, including removal. \nA current address is likely to provide investigative leads if the \nindividual fails to comply.  \nReport criminal \ncharges and \nconvictions  \nCriminal charges and convictions are indicators that an \nindividual may pose a danger to the public, which is a primary \nconcern for the CBSA.  \nCooperate with \nobtaining an identity \nor travel document  \nThe lack of an identity or travel document is often the sole \nimpediment to removal for many individuals. Obtaining an \nidentity or travel document can take a long time, and the sooner \nthe process begins, the more likely the timely removal of the \nperson will take place if it becomes necessary.  \nOther conditions, \nincluding those listed \non the BSF821 form \n(Acknowledgement \nof Conditions) \nAn officer may impose any other condition that they consider \nnecessary in order to address risk specific to each individual \nprovided the condition is proportional to the risk; however, the \nofficer must be able to articulate why specific conditions are \nbeing imposed and they cannot be unreasonable or amount to \nde facto detention.   \n  \n  \n12.2. Issuance of deposits and guarantees  \nDeposits and guarantees are tools intended to provide some assurances that an individual will \ncomply with conditions imposed. Deposits and guarantees are discussed in ENF 8 Deposits and \nGuarantees.  \n  \n"
    },
    {
      "page": 16,
      "chars": 2779,
      "text": "16  \n  \n12.3. In-person reporting  \nIn-person reporting is intended to keep the individual connected with the CBSA through regular \nface-to-face interactions. Regular reporting allows the CBSA to obtain updates on information \nrelevant to the administration and/or enforcement of IRPA and allows the individual to ask \nquestions of the CBSA in relation to their immigration enforcement proceedings. \n \n12.4. Remote Reporting \nWith the decommissioning of Voice Reporting System and the delay in implementing its \nreplacement, on a case-by-case basis, an individual may be permitted to report remotely via \ntelephone. An individual should only be considered for this option if they cannot physically report \nin-person (e.g., geographical location – individual lives in Whitehorse, or mobility issues).  \n \n12.5. Community Case Management and Supervision  \nLike all other ATD options, the CCMS program is intended for individuals under the immigration \ncontinuum, who are cooperative with the CBSA in working towards furthering their enforcement \nproceedings, including effecting their removal from Canada. CCMS provides released \nindividuals with services in the community that mitigate and manage the risk they pose through \ncase management and pro-social treatment options. CCMS is delivered by existing non-\ngovernmental organizations and community organizations contracted by the CBSA to provide \nthese services.  \n  \nCCMS service providers conduct an eligibility assessment of detained individuals referred to \nthem by the CLO and provide the results of the eligibility assessment to the CLO. If the service \nprovider accepts an individual into the program and CCMS is imposed as a condition by either \nthe CBSA or the IRB order for release, the CCMS service provider will enrol the individual in the \nappropriate program and services, and will monitor the individual as they participate in the \nprogram. \n  \nCCMS services are primarily focused on mitigating and managing the risk of non-compliance \nassociated with vulnerabilities such as physical health, mental health, substance abuse, \naddictions and behavioral issues. Additionally, the CCMS service provider can refer individuals \nto existing community resources that provide housing and shelter assistance as well as child \nand family services.  \n  \nFor a limited number of individuals who present a high flight risk or danger to the public, CCMS \nservice providers have community residential facilities that individuals can be released to, under \nstrict conditions and subject to very close monitoring. Individuals released to these facilities are \nrequired to reside in the facility, follow facility rules and participate in any programmes deemed \nnecessary to mitigate and manage the risk the individual poses.  \n  \n"
    },
    {
      "page": 17,
      "chars": 2290,
      "text": "17  \n  \nCCMS service providers report any violations of conditions to the CLO who will then consider all \nof the information and consult impacted areas, as required, when determining an appropriate \nresolution.  \n12.5.1. Description of CCMS services  \nCCMS is intended to address factors that are likely to impact the individual’s ability to maintain \na stable community living situation. The underlying premise is that an individual who is stable in \nthe community is more likely to comply with imposed IRPA requirements and conditions.  \n  \nThe following CCMS services assist individuals in becoming and remaining stable in the \ncommunity:  \n  \nService  \nDescription  \nCase management  Every individual enrolled in CCMS receives case management services. \nThe CCMS service provider performs an assessment to determine the \nappropriate nature and frequency of case management services. At a \nminimum, the individual is required to report to the CCMS service \nprovider at regular intervals to update on changes to their living situation, \ndaily activities (such as work and school) and any specific issues that \ncould impact compliance with the imposed conditions.  \nLinks to health \nsupport  \nIndividuals who have a serious medical condition that require significant \nongoing treatment may be eligible to receive support from the CCMS \nservice provider in arranging and managing their treatment in the \nabsence of a support system of their own.  \nMental health \nassistance  \nIndividuals with mental health issues that are likely to impact their \ncompliance with conditions may have treatment options available to \nthem that are designed to support and encourage compliance with IRPA \nrequirements and imposed conditions. These services may be provided \nby program operators available through the CCMS service provider or \nsubcontracted by the CCMS service provider.  \nAddiction and \nsubstance abuse \ncounselling and \nsupport  \nIndividuals whose ability to comply with conditions is impacted by \naddiction may be eligible to participate in counselling and/or treatment \nprograms designed to minimize the impact of their addiction and assist \nwith maintaining stability in the community. These outcomes are \nexpected to support the individual’s ability to comply with imposed \nconditions.  \n"
    },
    {
      "page": 18,
      "chars": 2620,
      "text": "18  \n  \nInformation \nregarding housing \nand employment  \nIndividuals who are eligible to work in Canada may be eligible to receive \nassistance from the CCMS service provider in accessing local \nemployment resources. Employment provides stability in the community \nas well as a legitimate source of funds to live on, both of which contribute \nto the individual being more likely to comply with imposed conditions.  \n  \nIndividuals who are or anticipate having difficulty finding a stable \nresidence may be eligible to receive assistance from the CCMS service \nprovider in accessing local housing resources. A stable residential \naddress is one of the strongest contributors to an individual complying \nwith conditions.  \nInformation \nregarding child-\nrelated or family \nneeds  \nIndividuals with child-care needs may be eligible to receive assistance \nfrom the CCMS service provider in accessing local resources. A stable \ncommunity and family situation both contribute to an increased likelihood \nof compliance.  \nMandatory \nresidency  \nIndividuals who require close supervision may be eligible to be placed \ninto residential facilities operated by the CCMS service provider. These \nfacilities closely monitor the individual’s behavior and report any \nconcerns or violations of curfews or other conditions to the CBSA  \nimmediately. Individuals may receive treatment services in some of \nthese facilities and be escorted to appointments and treatment programs \nby the CCMS service provider when necessary.  \n \nTo maintain the integrity of the CCMS program and ensure resources are used most \neffectively, below are guidelines on individuals that should not be considered for enrolment \nin CCMS.  \nExamples may include, but are not limited to:  \n Protected persons (including Convention Refugees) who have lost their Permanent \nResident status due to serious criminality. CBSA cannot enforce the removal order.  \n Protected persons (including Convention Refugees) who have lost their Permanent \nResident status due to criminality, but for whom a Danger Opinion is not being sought. \nCBSA cannot enforce the removal order.  \n Permanent Residents who have applied for, or have been granted an Immigration \nAppeal Division (IAD) stay. They remain Permanent Residents. \n Eligible refugee claimant who are eligible for services and programs through settlement \nprofessionals. \n \n12.5.2. Referral to the CCMS service provider  \nAt any time throughout the enforcement continuum, an officer, including an arresting officer, the \nHearings Officer and a CLO, may form the opinion that the risk the individual presents could be \n"
    },
    {
      "page": 19,
      "chars": 3054,
      "text": "19  \n  \nmitigated or managed by one of the services available through the CCMS service provider. The \nCLO, as the ATD subject matter expert, will conduct an assessment to determine if the individual \nshould be recommended for an ATD. This includes the completion of all relevant BSF forms, in \naccordance with risk offset strategies and ATD program objectives.  \n  \nThe decision to refer an individual for an eligibility assessment by the CCMS service provider \nshould take into account these factors:  \n  \n• \nExpected removal timeline: \n CCMS is intended to provide risk mitigation over a period of time, as part of a case \nmanagement process. If the individual is being removed within a few weeks or \nless, CCMS is likely not appropriate, as the assessment and enrolment process \nmay take some time.  \n• \nStability of the individual in detention:  \n In the event an individual has medical or mental health concerns that have \ncontributed to their detention, these issues must be stabilized while in detention to \na point that the individual can effectively participate in the assessment process.  \n• \nRisk level of the individual:   \n If the risk level of the individual is so high that release on even the strictest \nconditions is only plausible far into the future, an assessment should not be \nrequested. The relevance of an assessment by the CCMS service provider \ndiminishes over time and should be done only when there is a realistic possibility \nof release.  \n  \nIn most instances, the decision to refer an individual for an eligibility assessment rests solely \nwith the CLO. When a CCMS service provider has comprehensive knowledge of CBSA \nenforcement operations, referrals to the CCMS program may also be initiated through outside \nparties, such as the individual themselves, counsel or another party associated with the \nindividual (only available through the Toronto Bail Program or by the Immigration Division). \nThese may be directed to the CLO for referral or to the CCMS service provider themselves. The \nCLO, in conjunction with the CCMS service provider, will review the request and take appropriate \naction.  Once reviewed by the CLO, the CCMS provider may undertake an eligibility assessment \nof an outside referral following notification to the CLO. For Member directed referrals, the CLO \nwill send the referral to the service provider on behalf of the IRB, regardless of whether or not \nthe CLO is in agreement of the referral. The CLO should refrain from providing their opinion on \na individual’s suitability when submitting the CCMS Supervision Referral Form for Member \ndirected referrals.  \n \nIf an IRB Member directs the CBSA to refer the individual to the service provider for a CCMS \neligibility assessment, the CLO must articulate a chronological immigration history of the \nindividual on the CCMS Supervision Referral Form and forward it to the service provider so that \nthey can conduct the eligibility assessment. The CCMS Supervision Referral Form must also \narticulate that it is a member directed referral. \n  \n"
    },
    {
      "page": 20,
      "chars": 3016,
      "text": "20  \n  \nIn the instance of a CLO referral, the referral must include all of the salient facts that  the CBSA \nhas available to assist the CCMS service provider in assessing the individual for services and \ntreatment.. In completing the assessment, the CLO must conduct a comprehensive file and \nsystems review, that may include speaking with the Inland Enforcement Officer, Removals \nOfficer, Hearings Officer, and Detention Liaison Officer or IHC staff when necessary. The \nassessment process by the CLO should include an interview with the detainee in order to \ndetermine ATD eligibility. The CLO should not initiate simultaneous CCMS referrals. \n  \n12.5.3. CCMS Regional Transfer  \nTransfers of actual or potential CCMS participants are permitted for all intervention levels \nprovided that several logistical steps are performed prior to doing so. Whenever possible, \nCCMS transfers should be planned and set-up two to three working days prior to the actual \ntransfer date to address outliers and ensure a smooth transfer. \n \nCCMS transfers can occur in the following scenarios for which the list is non-exhaustive:  \n1. An individual is enrolled in CCMS with a service provider and wishes to move to another \nregion to improve ATD program outcomes. For example, moving to a city where they \nhave deeper ties to the community (family, close friend, etc.). The goal in this scenario \nis to improve ATD program outcomes and better prepare the participant for success \nduring the programs de-escalation stage. \n2. An individual is in detention, is not enrolled in the ATD program, has few or no ties to \nthe community in their originating region, but has strong ties in another region where the \nCCMS program is available. \n3. An individual is in detention, is not enrolled in the ATD program, and the CBSA regional \nboundary does not align with the service provider regional boundary (e.g. Hamilton is in \nGreater Toronto Area Region for the CBSA but in Southern Ontario Region for the \nservice provider). \n4. An individual is in detention, is not enrolled in the ATD program, and when no sufficient \nhigh intervention programming is available in the originating region. For example, a \nsituation where no beds are available in the originating region where the case is, but are \navailable in another. \n \nIt is important to note that all costs associated with CCMS transfers are the responsibility of the \ntwo regions involved. Costs incurred by the regions may include, but are not limited to: fleet \nvehicle use and gasoline, bus/train/airplane tickets for the individual being transferred, officer \nsalary and any overtime incurred, and meal per diems for longer escorted transfers. Please \nrefer to the CCMS Regional Transfer Guidelines for additional details.  \n \n \n12.5.4. Assessment by the CCMS service provider  \nUpon receipt of a referral, the CCMS service provider performs an initial review of the information \nand contacts the CLO with a plan to complete the eligibility assessment. When necessary, the \n"
    },
    {
      "page": 21,
      "chars": 2854,
      "text": "21  \n  \nCLO assists the CCMS service provider in gathering additional information that may be required \nin setting up interviews with the individual.  \n  \nThe CCMS service provider interviews the individual in person or remotely, if necessary, using \nthe services of an interpreter, as required. The service provider provides the results of the \neligibility assessment to the CLO as soon as it is completed and within the timelines outlined in \nthe CCMS service providers statement of work.  \n  \nThe completed assessment is reviewed by the CLO and can be used in subsequent detention \nreviews by the Hearings Officer, as appropriate. The eligibility assessment provides the CBSA \nwith sufficient information related to a proposed release plan for presentation to the IRB.  \n  \n12.5.5. CCMS Use of Interpreters  \nThe CBSA has access to interpreters through a list of accredited and security cleared \ninterpreters maintained by IRCC.  \nCCMS service providers can access (and use) the interpreters list to assist in service delivery \nduring the following phases:  \n1. Referral and Assessment: the service provider is required, at the request of the CBSA \nand/or the IRB to assess individuals for ATD CCMS enrolment. This will include an \ninterview, which may be undertaken in person or via telephone.  \n2. Enrolment: once released by the IRB, the service provider will meet with the individual \nto enrol them in ATD CCMS Program. This includes discussing the terms and \nconditions of release and any service provider-related rules for programming. \n3. Case Management: the service provider is required to meet with the individual while \nthey are released into the community to discuss programming, verify attendance, etc.  \n \n12.5.6. Enrolment with the CCMS service provider  \nOnce enrolment with a CCMS service provider has been imposed as a condition of release by \nthe CBSA or the IRB, the CLO makes arrangements with the CCMS service provider to enrol \nthe individual. In most cases, the individual is released from the detention facility with a direction \nto report to the CCMS service provider at a scheduled time.  \n  \nHigh-risk individuals may be transported to the CCMS service provider office or residential facility \nby the CBSA or contracted guard service for enrolment, when deemed necessary. The CBSA or \nthe contracted guard service can only transport individuals who have their release conditions \nexplicitly worded that release is contingent upon enrolment.  \n  \nAt the enrolment appointment, the CCMS case worker reviews the release conditions imposed \nand the particulars of the individual’s case to develop an appropriate program of reporting and \ncommunity services that collectively mitigates risk factors present. They further explain what is \nrequired of the individual to participate in the CCMS program. The specific services and \n"
    },
    {
      "page": 22,
      "chars": 2997,
      "text": "22  \n  \nprograms that the individual is subject to, as part of their participation in the CCMS program, are \ndocumented within the Agreement of Supervision or the Supervision Contract initiated between \nthe CCMS service provider and the individual. This document (BSF802) is sent to the CLO using \nCanada Post Connect and is to be placed on the individual’s file, in accordance with the CCMS \nstatement of work. All relevant information is put into the NCMS. Within seven business days, \nthe CLO will upload the ATD forms into GCMS as per the ATD Form Upload Procedures.  \n  \n12.5.7. Monitoring and enforcement by CCMS service provider and CBSA  \nOnce the individual has been enrolled into the CCMS program, the CCMS service provider has \nregular and ongoing interactions with the individual to ensure that the individual is abiding by the \nrequirements of the program and their release conditions. Over the course of their participation \nin the program, the CCMS service provider, in accordance with the parameters of their statement \nof work, provides the CLO with any new information received from the individual that may be of \ninterest to the CBSA in the ongoing administration of the program.  \n  \nOn a regular schedule, the CCMS service provider will review the services the individual is \nenrolled in and provide the CLO with a recommendation to maintain the current services or \nmodify them, in accordance with the CCMS service providers statement of work. In general, \nindividuals enrolled in the CCMS program are expected to gradually require less support from \nthe CCMS service provider, to the point where they can remain stable in the community without \nsupport from the CCMS service provider.  \n  \nIf the CCMS service provider becomes aware that the individual is not abiding by the \nrequirements of the CCMS program or other conditions of their release, the CCMS service \nprovider must contact the CLO with the details. The CLO, in conjunction with the service \nprovider, will have a discussion to determine the appropriate response. Depending on the nature \nand severity of the violation, the history of the individual and the risk level of the individual, more \nrestrictive conditions may be imposed, withdrawal of supervision may be undertaken, and the \ncase may be referred for investigation and further enforcement action.  \n  \n \n12.6. Electronic monitoring  \nThe National Electronic Monitoring Program (NEMP) is an ATD option and is currently operated \nthrough a partnership with Correctional Service Canada (CSC). A Memorandum of \nUnderstanding with CSC facilitates the provision of monitoring services, software profile \nmanagement and inventory services.   \n  \nEM involves attaching a bracelet-type device to an individual’s ankle which allows continuous \nmonitoring of the individual’s location when released in the community. The bracelet is securely \nattached and should only be removed in cases of medical necessity, unless otherwise directed \nby the CBSA or IRB.  \n \n"
    },
    {
      "page": 23,
      "chars": 2671,
      "text": "23  \n  \nEM is intended to be used in conjunction with CCMS, a deposit or guarantee, or both for \nindividuals who present a high risk if released into the community, but whose predicted length of \ndetention favours release. Individuals on EM usually have restrictions on places and times that \nthey can be in the community. Compliance with these conditions is monitored at all times by staff \nin the National Monitoring Centre, operated by CSC. Any violation of EM conditions is reported \nimmediately to the CBSA for review and action, as required.  \n  \n12.6.1. Enrolment  \nOnce an individual has an EM condition imposed by the IRB or CBSA, the enrolment process is \ninitiated by regional CBSA staff. EM enrolment is a two-step process: installation of the ankle \nmonitor on the individual and installation of the Radio Frequency (RF) modem in the individual’s \nresidence. The installation of the EM monitoring device takes approximately 60 minutes and is \ndone by a CBSA inland enforcement officer.  \n  \nBefore the individual’s release from detention, the officer performs an assessment of the \nproposed residence and tests the functioning of the RF unit and the ankle monitor at the \nproposed residence by verifying the operation of the units with the CSC National Monitoring \nCentre. After verifying the equipment is functioning correctly, officers explain to the individual the \nterms and conditions of their participation in the NEMP and installs the ankle monitor. The officer \nreviews and shares a copy of the NEMP Client Handbook, which has their EM assigned client \nnumber listed on the cover page. The officer should also provide the client with a copy of the \nNEMP – Charging Instructions document.  \n  \nEnrolment in the NEMP program is undertaken in English and French only, so an interpreter may \nbe necessary to assist the individual in following enrolment instructions.  \n  \nWhen an individual is successfully enrolled, they are provided with detailed written instructions \non how to remain compliant with NEMP requirements and the particular conditions associated \nwith their participation on the program. They are also provided with a handbook that provides \ntips, troubleshooting and contact information for assistance.  \n  \n12.6.2. Monitoring and enforcement  \nIndividuals on EM are monitored by the CSC National Monitoring Centre, in conjunction with the \nCBSA. Any breach or non-compliance is referred to the region for immediate action. All functions \nrelated to monitoring and enforcement are undertaken in accordance with NEMP policies and \nguidelines and are governed by the established Memorandum of Understanding between both \ndepartments.  \n  \n"
    },
    {
      "page": 24,
      "chars": 3362,
      "text": "24  \n  \n13. Roles and responsibilities  \n13.1. Community liaison officer  \nThe role of the CLO  is to provide a centralized approach for the ATD program. All CBSA regions \nhave dedicated CLOs to ensure the effective and ongoing use of ATDs, in accordance with \nprogram objectives, national policies and guidelines. The CLO is the subject matter expert in all \nregions for ATDs and are primarily responsible for the assessment, referral and case \nmanagement of ATD individuals. . While the CLO is not the primary file holder for specific cases, \nthey must be made aware of all new detention cases. They may be informed about detainees \nthrough inclusion on arrest and detention emails, and may review the Notice of Arrest and \nDetention, or where applicable, converse with the arresting officer to discuss which ATD options \nare suitable based on the individual’s immigration history, ability to acquire travel documents, \nties to Canada, period of time since last incident with the CBSA or the criminal justice system \nand vulnerabilities.  \n \nIt is the CLO’s responsibility to conduct an initial assessment to determine if the individual should \nbe recommended for an ATD, in accordance with case management risk mitigation strategies \nand ATD program objectives. The assessment process by the CLO should include an interview \nwith the detainee in order to determine ATD eligibility. All individuals for whom detention was \nordered and continued past the seven day detention review will be assigned for an ATD \nassessment by the CLO to ensure all individuals have an ATD assessment prior to the 30-day \ndetention review. The CLO is the sole point of contact in the region for the CCMS service \nprovider. On a monthly basis, the CLO will review the individuals’ file to determine if they should \nbe considered for de-escalation and/or graduation from the CCMS program, and recommend \namended conditions for consideration by the IRB.  \n \nAt the three (3) month mark of EM participation OR as new information comes to light that \ndiminishes the need1 for EM use, the CLO must initiate a case review for EM participants. This \ncan be done alone or with the assistance of the regional EM response unit.  \n If the case was not recommended for de-escalation by the CLO at the three (3) month \nmark, the CLO is to review the case every thirty (30) days thereafter or as new \ninformation becomes available that diminishes the need for EM use.  \n The CLO’s are regional program officers with the delegated authorities under the IRPA to make \ndecisions. Despite this authority, they are not expected to make decisions on detention, release \nor the imposition of conditions. Rather, they provide functional advice and guidance, as required, \non the imposition of ATD condition to Inland Enforcement Officers, Border Services Officers and \nHearings Officers in the management of their cases and the execution of their work. The CLO \nmay, in conjunction with Inland Enforcement Officers and CCMS service providers, monitor \nindividuals released into the community to assess their continued compliance with the ATD \nProgram.  \n  \n                                            \n1 Examples of information include but are not limited to: solidified travel documents; new family and/or kin has \ncome forward to vouch for the participant; a history of compliance with the program. \n"
    },
    {
      "page": 25,
      "chars": 2485,
      "text": "25  \n  \n \n13.2. CSC National Monitoring Centre  \nThe CSC National Monitoring Centre monitors the status of individuals enrolled in EM 24 hours \nper day and seven days per week and immediately notifies the CBSA of any violations of EM \nconditions. The CSC National Monitoring Centre also confirms the successful installation and \napplication of EM equipment during enrolment and provides technical support to CBSA officers \nresponsible for managing individuals on EM.  \n  \n13.3. CCMS service provider  \nThe CCMS service provider writes an eligibility assessment for individuals referred to them that \ndescribes the services and support available that are expected to mitigate and manage the \nindividual’s risk in the community. Once the individual is enrolled in CCMS programming, the \nCCMS service provider monitors the individual and provides case management services. \nInformation regarding changes in circumstances and violations is reported to the CLO for review \nand action, if required.  \n  \nThe CCMS service provider must ensure the necessary services and programs are available in \nthe service locations listed in the statement of work and fulfill the reporting and administrative \nobligations outlined in the statement of work. The CCMS service provider must provide qualified, \nsecurity-cleared staff to perform case management functions, as specified in the statement of \nwork.  \n  \n14.0. Jurisprudence \nThe CLO is required to write comprehensive notes to file based on the assessment they \nconduct, including a recommendation for an ATD if applicable, because these \nrecommendations could be put forward by the Hearings Officers during a detention review \nbefore the IRB. \nThe Federal Court in Mawut (Citation: 2021 FC 1155) stated the following: \n[35] As a practical matter, the Minister’s representative should review the file and start \nfrom the premise that disclosure is the rule and withholding information, the \nexception. As the Federal Court of Appeal noted in Brown, at paragraph 142, the duty \nto disclose “is not unlimited” and is “tempered by the requirement that the information \nbe relevant.” Relevance should be assessed according to the principles set out \nabove. An assessment of relevance, however, cannot be based on the Minister’s \nrepresentative’s opinion as to what avenues the detainee’s counsel should pursue, or \nthe idea that the evidence already disclosed is overwhelming with respect to a \nparticular issue or sufficient to justify detention. \n"
    },
    {
      "page": 26,
      "chars": 2999,
      "text": "26  \n  \n[36] Given the nature of detention reviews, the Minister’s duty to disclose is a \ncontinuing one. Therefore, as the situation evolves, the weight of each section 248 \nfactor may vary. Nevertheless, information should not be withheld simply because the \nMinister’s representative believes that information may only become relevant at a \nlater stage. \n[37] Adherence to the foregoing principles should go a long way towards preventing \ndisputes regarding the scope of disclosure. Should an issue nonetheless arise, it \nshould be brought before the ID. \nIt is important to note that the CBSA has the obligation to demonstrate the IRB Members \nthat it is being diligent in considering ATDs for vulnerable individuals. The Federal Court in \nLee (Citation: 2022 FC 383) stated the following:  \n[68] As counsel for Ms. Lee properly emphasizes, there is a heightened obligation on \nthe part of the ID to consider alternatives to detention for vulnerable persons such as \npersons with mental illness (a point I will return to below). Related to this is a heightened \nonus on the Minister to justify the detention of such persons, as reflected in paragraph \n3.1.15 of the Guideline. Consequently, as the Guideline also notes, a member \nshould “actively question” the steps that the Minister has taken to make an alternative \nto detention available when the person concerned is a vulnerable person. I am not \npersuaded that the ID erred in failing to do this in the last detention review. That being \nsaid, there has now been a material change in circumstances with the March 14, 2022, \nOrder of Justice Ahmed granting an interlocutory stay of Ms. Lee’s removal. Given this, \nI fully expect the question of whether the CBSA is being diligent in identifying and \nsupporting alternatives to detention to be front and centre at the next detention review. \nIt is noteworthy that the CBSA has a heightened obligation to consider ATDs when detention \nbecomes lengthy. The Federal Court in Ahmed (Citation: 2015 FC 876) stated the following:  \n[34] Nevertheless, given the finding that Mr. Ahmed’s detention is indefinite, both the \nBoard and the Minister are under a heightened obligation to consider alternatives to \ndetention, specifically release upon conditions. The National Parole Board previously \ndetermined that Mr. Ahmed could be released subject to stringent conditions. It is open \nto the Board to require a psychological assessment as a condition of release (Canada \n(Minister of Citizenship and Immigration) v Romans, 2005 FC 435 at para 74). Counsel \nfor Mr. Ahmed informed the Court that she has initiated the process to update the \nMinister’s Danger Opinion. These are all considerations that should be at the forefront \nwhen Mr. Ahmed’s detention is next reviewed on July 24, 2015. \nIt is important to note that ATDs need not be perfect. Rather, they need only be proportional \nto the individual’s risk profile. The Federal Court in Hamdan (Citation: 2019 FC 1129) stated \nthe following:  \n"
    },
    {
      "page": 27,
      "chars": 3416,
      "text": "27  \n  \n[97] Some final comments are in order regarding the specifics of the 25 \nconditions. First, there could of course have been more safeguards placed within them \nin a perfect world. But as pointed out above, perfection is not the standard to be \nattained in a reasonableness review, and thus alternatives to detention need not \nbe perfect (Canada (Public Safety and Emergency Preparedness) v Berisha, 2012 FC \n1100 at para 85). Rather, they need only be proportionate and attainable, which these \nconditions were. \nIt is noteworthy that the “virtually eliminate” test is virtually impossible to meet and could \nprevent release whenever a detainee is a danger to the public. The Federal Court in Mawut \n(Citation: 2022 FC 415) stated the following:  \n[35] I wish to add that in reaching this conclusion, I have not found it necessary to rely \non the idea that the conditions of release must “virtually eliminate” any danger to the \npublic posed by Mr. Mawut. The phrase “virtually eliminate” finds its origin in Canada \n(Public Safety and Emergency Preparedness) v Lunyamila, 2016 FC 1199, [2017] 3 \nFCR 428 [Lunyamila], and was mentioned in subsequent cases. It is not always easy \nto reduce a complex decision-making process to a few words. Taken too literally, the \n“virtually eliminate” test is virtually impossible to meet and could foreclose release \nwhenever a detainee is a danger to the public. This, however, is not what is \ncontemplated by section 58 of the Act and section 248 of the Regulations, nor by the \ndecision of the Federal Court of Appeal in Brown. In the context of bail, which shares a \npreventive purpose with immigration detention, conditions must “minimize’ or \n“attenuate” risk and be “proportional to the risk”: R v Zora, 2020 SCC 14, at paragraphs \n84, 85 and 89. I also note that in Canada (Public Safety and Emergency Preparedness) \nv Ali, 2018 FC 552, at paragraph 47, a decision rendered after Lunyamila, the test in \nthe context of immigration detention was described as “any conditions of release [must \nbe] sufficiently robust to ensure that the general public will not be exposed to any \nmaterial risk of harm”. Whatever the best manner to formulate the test, it was clearly \nnot met in this case. The basic conditions imposed by the ID do not attenuate in any \nway, and are not proportional to the risk posed by Mr. Mawut. \nIt is of paramount importance to note that EM only monitors an individual’s whereabouts, not \nhis activities, who he talks to and what he says. Therefore, a human supervision component is \nvital. The Federal Court in Bruzzese (Citation: 2014 FC 230) stated the following:  \n[78] Finally, I have also come to the conclusion that ID members could reasonably find \nthat the GPS monitoring was not sufficient to overcome the shortcomings of the \nbondspersons offered by the Applicant. There is no doubt that such a device, in \ncombination with appropriate bondspersons, can sometimes provide an acceptable \nalternative to detention. In the case at bar, however, there were good reasons to find that \nit would not be sufficient to offset the concerns with respect to danger to the public. First \nof all, Mr Bruzzese did not present the ID members with a comprehensive proposal \nwhereby any risk of flight could allegedly be managed, as was done in Tursunbayev. It \nappears that the bracelet used by the proposed company could be cut with a simple pair \n"
    },
    {
      "page": 28,
      "chars": 2533,
      "text": "28  \n  \nof scissors, that it might take six hours to notify the authorities should the system breaks \ndown, and that the monitoring would discontinue should the monthly bill not be paid. \nMaybe more importantly, the system would only control Mr Bruzzese’s location, not his \nactivities, who he talks to and what he says. The GPS, therefore, might conceivably be \nan alternative to detention as far as the flight risk is concerned, but it would not be sufficient \nto ensure that Mr Bruzzese is not involved in the criminal activities of the ‘Ndrangheta, \neither in Canada or abroad. \n \n15. Presenting the alternatives to detention assessment at \ndetention reviews  \nThe results of an ATD eligibility assessment is used by Hearings Officers when making \nsubmissions to the IRB on the residual risk posed by an individual if released. This may include \nthe assessment by the CCMS service provider, if enrolment in CCMS is being proposed. In \ngeneral, Hearings Officers make submissions on whether the factors in paragraphs R248(a) to \n(d) weigh in favour of detention or release, taking into account the residual risk after the available \nATDs are considered.  \n  \nSee ENF 3 Admissibility Hearings and Detention Reviews for more information on the factors for \nconsideration and procedures at detention reviews.  \n  \nIf the CBSA has not referred the case to the CCMS service provider and does not intend to in \nthe foreseeable future, the Hearings Officer should provide a brief explanation of that decision. \nIf the IRB requests that the individual be referred to the CCMS service provider for eligibility \nassessment, the CLO must do so.  \n  \nWhen making submissions on the wording of the conditions for CCMS and EM, the Hearings \nOfficer should propose language that allow the CCMS service provider and the CBSA the latitude \nnecessary to manage the person effectively while released. The proposed wording of the \nconditions should authorize the CBSA to modify or cancel the conditions imposed by the IRB \nrelated to CCMS and EM.  \n  \n16. Privacy and information-sharing  \nInformation collected under the ATD Program can only be disclosed under the provisions of the \nPrivacy Act. See CBSA guidelines of information-sharing for details. In general, collected \ninformation can be shared under paragraph 8(2)(a) of the Privacy Act if it is shared for a use \nconsistent with the purpose it was collected for. Information related to alternatives to detention \nis collected for the purpose of administering and enforcing the IRPA.  \n  \n \n"
    },
    {
      "page": 29,
      "chars": 1628,
      "text": "29  \n  \n16.1. Community case management and supervision Privacy Notice form  \nThe CBSA is authorized to share information necessary for the assessment and participation \nin CCMS with the CCMS service provider, without the consent of the individual, as prescribed \nin paragraph 8(2)(a) of the Privacy Act. However, the individual must be notified that their \ninformation is being shared. The CCMS Privacy Notice form (BSF803) notifies the individual \nthat their information may be provided to the CCMS service provider to start the eligibility \nassessment process and as needed, if enrolled. The sharing and use of information must be \nconveyed to the individual by the CLO, using an interpreter, if required, before the individual’s \ninformation is shared outside the CBSA.  \nThe BSF803 form must be uploaded in accordance with section 8.5. – Documenting the \nDecision.  \n \n16.2. Requesting sensitive information from the community case \nmanagement and supervision service provider  \nWhile enrolled in CCMS, individuals may provide sensitive information, such as health and \nmental health information, to the CCMS service provider. The CBSA does not have routine \naccess to this information. The CLO can only request sensitive information from the CCMS \nservice provider if it is required to protect the health or safety of the individual, CBSA staff or the \npublic.  \n  \nAll requests for information from the CCMS service provider must be submitted by the CLO. The \nCLO will ensure that the requested information meets the requirements of the above policy and \nother applicable policies, regulations and legislation.  \n  \n  \n \n"
    }
  ]
}